[
    {
        "NNQT_question": "Show me all the breweries in Australia.",
        "uid": "256",
        "subgraph": "",
        "template_index": "",
        "question": "Show me all the breweries in Australia.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q131734 . ?uri wdt:P17 wd:Q408 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1313123",
            "http://www.wikidata.org/entity/Q16899043",
            "http://www.wikidata.org/entity/Q16932183",
            "http://www.wikidata.org/entity/Q19877213",
            "http://www.wikidata.org/entity/Q24190026",
            "http://www.wikidata.org/entity/Q2426375",
            "http://www.wikidata.org/entity/Q48808361",
            "http://www.wikidata.org/entity/Q48816560",
            "http://www.wikidata.org/entity/Q4999111",
            "http://www.wikidata.org/entity/Q5374850",
            "http://www.wikidata.org/entity/Q55605458",
            "http://www.wikidata.org/entity/Q55615830",
            "http://www.wikidata.org/entity/Q55623793",
            "http://www.wikidata.org/entity/Q55627422",
            "http://www.wikidata.org/entity/Q55637339",
            "http://www.wikidata.org/entity/Q56747448",
            "http://www.wikidata.org/entity/Q56752734",
            "http://www.wikidata.org/entity/Q60791658"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Foster's Group Limited",
            "Queensland Brewery Ltd",
            "South Australian Brewing Company",
            "Power's Brewery",
            "Lion Brewery, Townsville",
            "Coopers Brewery",
            "Hindmarsh Brewery",
            "Pirie Street Brewery",
            "Burleigh Brewing Company",
            "Emu Brewery",
            "Billson's Brewery",
            "Kent Town Brewery",
            "Morphett Street Brewery",
            "Old Goulburn Brewery",
            "Walkerville Brewery",
            "Yorkshire Brewery building",
            "Victoria Brewery building",
            "Pirate Life Brewing"
        ]
    },
    {
        "NNQT_question": "Give me all films produced by Steven Spielberg with a budget of at least $80 million.",
        "uid": "257",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all films produced by Steven Spielberg with a budget of at least $80 million.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P162 wd:Q8877 ; wdt:P31/wdt:P279* wd:Q11424 ; wdt:P2130 ?cost . FILTER(?cost > 80000000)}",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q19689203",
            "http://www.wikidata.org/entity/Q22000542",
            "http://www.wikidata.org/entity/Q3512046",
            "http://www.wikidata.org/entity/Q63643994"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "The BFG",
            "Ready Player One",
            "Jurassic World",
            "West Side Story"
        ]
    },
    {
        "NNQT_question": "Give me all breeds of the German Shepherd dog.",
        "uid": "260",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all breeds of the German Shepherd dog.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279* wd:Q38280 FILTER(?uri != wd:Q38280) }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q28442893"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Adel V.Leonberg White German Shepherds"
        ]
    },
    {
        "NNQT_question": "Who created Batman?",
        "uid": "278",
        "subgraph": "",
        "template_index": "",
        "question": "Who created Batman?",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2695156 wdt:P170 ?uri . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q313048",
            "http://www.wikidata.org/entity/Q464282"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Bob Kane",
            "Bill Finger"
        ]
    },
    {
        "NNQT_question": "Give me all launch pads operated by NASA.",
        "uid": "292",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all launch pads operated by NASA.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q194188 ; wdt:P137 wd:Q23548 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q48821",
            "http://www.wikidata.org/entity/Q845774"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Kennedy Space Center",
            "Kennedy Space Center Launch Complex 39"
        ]
    },
    {
        "NNQT_question": "Give me the runtime of Toy Story.",
        "uid": "314",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the runtime of Toy Story.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?val WHERE { wd:Q171048 wdt:P2047 ?val . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "+87"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "+87"
        ]
    },
    {
        "NNQT_question": "List the children of Margaret Thatcher.",
        "uid": "321",
        "subgraph": "",
        "template_index": "",
        "question": "List the children of Margaret Thatcher.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7416 wdt:P40 ?uri . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q2449855",
            "http://www.wikidata.org/entity/Q713468"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Carol Thatcher",
            "Mark Thatcher"
        ]
    },
    {
        "NNQT_question": "List all games by GMT.",
        "uid": "334",
        "subgraph": "",
        "template_index": "",
        "question": "List all games by GMT.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11410 ; wdt:P123 wd:Q928726 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1115156",
            "http://www.wikidata.org/entity/Q44571846",
            "http://www.wikidata.org/entity/Q44782145",
            "http://www.wikidata.org/entity/Q4660797",
            "http://www.wikidata.org/entity/Q5412155",
            "http://www.wikidata.org/entity/Q6020459"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Commands & Colors: Ancients",
            "Thunder Alley",
            "Labyrinth",
            "A World at War",
            "Europe Engulfed",
            "Reds!"
        ]
    },
    {
        "NNQT_question": "Give me all members of Prodigy.",
        "uid": "339",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all members of Prodigy.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P463 wd:Q7256860 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q12054176",
            "http://www.wikidata.org/entity/Q1776781",
            "http://www.wikidata.org/entity/Q1776790",
            "http://www.wikidata.org/entity/Q388259"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Sharky",
            "Maxim Reality",
            "Keith Flint",
            "Liam Howlett"
        ]
    },
    {
        "NNQT_question": "Give me the birth place of Frank Sinatra.",
        "uid": "353",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the birth place of Frank Sinatra.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q40912 wdt:P19 ?uri }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q138578"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Hoboken"
        ]
    },
    {
        "NNQT_question": "Show me all books in Asimov's Foundation series.",
        "uid": "371",
        "subgraph": "",
        "template_index": "",
        "question": "Show me all books in Asimov's Foundation series.",
        "sparql_wikidata": "SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1564644> <http://www.wikidata.org/prop/direct/P527> ?uri }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1050014",
            "http://www.wikidata.org/entity/Q753894",
            "http://www.wikidata.org/entity/Q783533",
            "http://www.wikidata.org/entity/Q839800",
            "http://www.wikidata.org/entity/Q853927",
            "http://www.wikidata.org/entity/Q913482",
            "http://www.wikidata.org/entity/Q932592",
            "http://www.wikidata.org/entity/Q938629"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Foundation and Earth",
            "Foundation",
            "Prelude to Foundation",
            "Foundation and Empire",
            "Second Foundation",
            "Robot series",
            "Foundation\u2019s Edge",
            "Forward the Foundation"
        ]
    },
    {
        "NNQT_question": "Give me the currency of China.",
        "uid": "404",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the currency of China.",
        "sparql_wikidata": "SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q148>  <http://www.wikidata.org/prop/direct/P38>  ?o1 .  } ",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q39099"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "renminbi"
        ]
    }
]