[
    {
        "NNQT_question": "Who killed Caesar?",
        "uid": "2",
        "subgraph": "",
        "template_index": "",
        "question": "Who killed Caesar?",
        "sparql_wikidata": "SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q1048>  <http://www.wikidata.org/prop/direct/P157>  ?o1 .  }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q172248",
            "http://www.wikidata.org/entity/Q207370",
            "http://www.wikidata.org/entity/Q294846",
            "http://www.wikidata.org/entity/Q1228715",
            "http://www.wikidata.org/entity/Q1243545"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Marcus Junius Brutus",
                "Brutus",
                "Quintus Servilius Caepio Brutus",
                "Marcus Iunius Brutus",
                "Q. Caepio Brutus",
                "Quintus Servilius Caepio Junianus",
                "Marcus Junius Brutus the Younger"
            ],
            [
                "Gaius Cassius Longinus",
                "Cassius",
                "Caius Cassius"
            ],
            [
                "Decimus Junius Brutus Albinus",
                "Decimus Iunius Brutus Albinus",
                "Brutus Albinus"
            ],
            [
                "Tillius Cimber"
            ],
            [
                "Publius Servilius Casca",
                "Publius Servilius Casca Longus"
            ]
        ]
    },
    {
        "NNQT_question": "What is Angela Merkel\u2019s birth name?",
        "uid": "9",
        "subgraph": "",
        "template_index": "",
        "question": "What is Angela Merkel\u2019s birth name?",
        "sparql_wikidata": "SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q567> <http://www.wikidata.org/prop/direct/P1477>  ?o1 .  }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "Angela Dorothea Kasner"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            "Angela Dorothea Kasner"
        ]
    },
    {
        "NNQT_question": "Give me the homepage of Forbes.",
        "uid": "20",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the homepage of Forbes.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q25161472 wdt:P856 ?uri } ",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "https://www.forbes.com"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            "https://www.forbes.com"
        ]
    },
    {
        "NNQT_question": "Give me English actors starring in Lovesick.",
        "uid": "28",
        "subgraph": "",
        "template_index": "",
        "question": "Give me English actors starring in Lovesick.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q12125895 wdt:P161 ?uri. ?uri wdt:P19 ?birthplace . ?birthplace wdt:P17 wd:Q145 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q103894",
            "http://www.wikidata.org/entity/Q310343"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Alec Guinness",
                "Alec Guinness de Cuffe",
                "Sir Alec Guinness"
            ],
            [
                "Dudley Moore",
                "Dudley Stuart John Moore"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all spacecrafts that flew to Mars.",
        "uid": "54",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all spacecrafts that flew to Mars.",
        "sparql_wikidata": "SELECT ?s1 where  { ?s1 <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q389459> } ",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q48485",
            "http://www.wikidata.org/entity/Q176276",
            "http://www.wikidata.org/entity/Q193538",
            "http://www.wikidata.org/entity/Q223652",
            "http://www.wikidata.org/entity/Q1770537",
            "http://www.wikidata.org/entity/Q3216558",
            "http://www.wikidata.org/entity/Q3445540",
            "http://www.wikidata.org/entity/Q25415685",
            "http://www.wikidata.org/entity/Q87749354",
            "http://www.wikidata.org/entity/Q106614244"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Curiosity",
                "Mars Science Laboratory",
                "Curiosity rover"
            ],
            [
                "Spirit",
                "MER-A",
                "Spirit rover",
                "Mars Exploration Rover Spirit",
                "2003-027A",
                "Mars Exploration Rover - A",
                "MER-2"
            ],
            [
                "Opportunity",
                "MER-B",
                "Opportunity rover",
                "Mars Exploration Rover Opportunity",
                "2003-032A",
                "MER-1"
            ],
            [
                "Astrobiology Field Laboratory"
            ],
            [
                "Sojourner",
                "Microrover Flight Experiment"
            ],
            [
                "LAMA robot - CnAM 44681"
            ],
            [
                "Rosalind Franklin",
                "Rosalind Franklin rover",
                "ExoMars rover"
            ],
            [
                "Hyperion Rover"
            ],
            [
                "Perseverance",
                "Percy",
                "Perseverance rover",
                "Mars rover Perseverance"
            ],
            [
                "Zhurong",
                "Zhurong (rover)",
                "Zhurong rover",
                "Zhu Rong (Mars Rover)"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all taikonauts.",
        "uid": "56",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all taikonauts.",
        "sparql_wikidata": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q11631 . ?uri wdt:P27 wd:Q148 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q235266",
            "http://www.wikidata.org/entity/Q344892",
            "http://www.wikidata.org/entity/Q461840",
            "http://www.wikidata.org/entity/Q470059",
            "http://www.wikidata.org/entity/Q472683",
            "http://www.wikidata.org/entity/Q557082",
            "http://www.wikidata.org/entity/Q704554",
            "http://www.wikidata.org/entity/Q705626",
            "http://www.wikidata.org/entity/Q715126",
            "http://www.wikidata.org/entity/Q147581",
            "http://www.wikidata.org/entity/Q197135",
            "http://www.wikidata.org/entity/Q5256924",
            "http://www.wikidata.org/entity/Q7129713",
            "http://www.wikidata.org/entity/Q8070347",
            "http://www.wikidata.org/entity/Q9095339",
            "http://www.wikidata.org/entity/Q9364420",
            "http://www.wikidata.org/entity/Q27336250",
            "http://www.wikidata.org/entity/Q28413601",
            "http://www.wikidata.org/entity/Q107258209",
            "http://www.wikidata.org/entity/Q112206264",
            "http://www.wikidata.org/entity/Q114690441",
            "http://www.wikidata.org/entity/Q118799016",
            "http://www.wikidata.org/entity/Q123186464",
            "http://www.wikidata.org/entity/Q123186517"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Liu Yang"
            ],
            [
                "Fei Junlong"
            ],
            [
                "Jing Haipeng"
            ],
            [
                "Liu Wang"
            ],
            [
                "Nie Haisheng"
            ],
            [
                "Liu Boming"
            ],
            [
                "Li Qinglong",
                "Qinglong Li"
            ],
            [
                "Wang Yaping"
            ],
            [
                "Wu Jie"
            ],
            [
                "Yang Liwei"
            ],
            [
                "Zhai Zhigang"
            ],
            [
                "Deng Qingming"
            ],
            [
                "Pan Zhanchun"
            ],
            [
                "Zhang Xiaoguang"
            ],
            [
                "Zhao Chuandong"
            ],
            [
                "Chen Quan"
            ],
            [
                "Chen Dong"
            ],
            [
                "Ye Guangfu"
            ],
            [
                "Tang Hongbo",
                "Hongbo Tang"
            ],
            [
                "Cai Xuzhe"
            ],
            [
                "Zhang Lu"
            ],
            [
                "Gui Haichao",
                "Haichao Gui"
            ],
            [
                "Tang Shengjie"
            ],
            [
                "Jiang Xinlin"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all female German chancellors.",
        "uid": "61",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all female German chancellors.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P21 wd:Q6581072 . ?uri wdt:P39 wd:Q4970706 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q567"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Angela Merkel",
                "Angela Dorothea Merkel",
                "Angela Kasner",
                "Angela Dorothea Kasner"
            ]
        ]
    },
    {
        "NNQT_question": "Who owns Aldi?",
        "uid": "62",
        "subgraph": "",
        "template_index": "",
        "question": "Who owns Aldi?",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q125054 wdt:P355 ?uri }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q15815751",
            "http://www.wikidata.org/entity/Q104439664"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Hofer KG"
            ],
            [
                "Leader Price Exploitation"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all Frisian islands that belong to the Netherlands.",
        "uid": "100",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all Frisian islands that belong to the Netherlands.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { { wd:Q76936 wdt:P527+ ?uri . } UNION { wd:Q76936 wdt:P527* ?islandgroup . ?uri wdt:P361+ ?islandgroup . } ?uri wdt:P17 wd:Q55 . ?uri wdt:P31 wd:Q23442 . } ",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q9966",
            "http://www.wikidata.org/entity/Q204412",
            "http://www.wikidata.org/entity/Q207851",
            "http://www.wikidata.org/entity/Q1342240",
            "http://www.wikidata.org/entity/Q1479319",
            "http://www.wikidata.org/entity/Q1546490",
            "http://www.wikidata.org/entity/Q1640819",
            "http://www.wikidata.org/entity/Q1758944",
            "http://www.wikidata.org/entity/Q1825429",
            "http://www.wikidata.org/entity/Q2090531",
            "http://www.wikidata.org/entity/Q47009672",
            "http://www.wikidata.org/entity/Q47009672"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Texel",
                "Texel Island",
                "Texel (Nizozemsko : ostrov)"
            ],
            [
                "Terschelling"
            ],
            [
                "Vlieland"
            ],
            [
                "Engelsmanplaat"
            ],
            [
                "Rottumerplaat"
            ],
            [
                "Griend"
            ],
            [
                "Simonszand"
            ],
            [
                "Rottumeroog"
            ],
            [
                "Rif"
            ],
            [
                "Wexalia"
            ],
            [
                "Texel",
                "Tessel"
            ]
        ]
    },
    {
        "NNQT_question": "Who founded Intel?",
        "uid": "107",
        "subgraph": "",
        "template_index": "",
        "question": "Who founded Intel?",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q248 wdt:P112 ?uri . }  ",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q241735",
            "http://www.wikidata.org/entity/Q243969",
            "http://www.wikidata.org/entity/Q432929"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Robert Noyce",
                "Robert Norton Noyce",
                "Robert N. Noyce"
            ],
            [
                "Gordon Moore",
                "Gordon E. Moore",
                "Gordon Earle Moore"
            ],
            [
                "Andrew Grove",
                "Andrew Stephen Grove",
                "Andy Grove",
                "Andr\u00e1s Istv\u00e1n Gr\u00f3f",
                "Andras Istvan Grof"
            ]
        ]
    },
    {
        "NNQT_question": "Give me the Apollo 14 astronauts.",
        "uid": "135",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the Apollo 14 astronauts.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q178871 wdt:P1029 ?uri }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q174979",
            "http://www.wikidata.org/entity/Q295873",
            "http://www.wikidata.org/entity/Q375065"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Alan Shepard",
                "Alan Bartlett Shepard Jr."
            ],
            [
                "Edgar Mitchell",
                "Edgar Dean Mitchell",
                "Edgar D. Mitchell"
            ],
            [
                "Stuart Roosa",
                "Stuart Allen Roosa, Stuart A. Roosa",
                "Stuart Allen Roosa"
            ]
        ]
    },
    {
        "NNQT_question": "Show me all museums in London.",
        "uid": "142",
        "subgraph": "",
        "template_index": "",
        "question": "Show me all museums in London.",
        "sparql_wikidata": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q33506> . ?uri <http://www.wikidata.org/prop/direct/P276> <http://www.wikidata.org/entity/Q84> . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q55075068",
            "http://www.wikidata.org/entity/Q4064609",
            "http://www.wikidata.org/entity/Q10534945",
            "http://www.wikidata.org/entity/Q109996849",
            "http://www.wikidata.org/entity/Q113572234"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Vagina Museum"
            ],
            [
                "Amora London",
                "London Amora"
            ],
            [
                "India Museum"
            ],
            [
                "Central Saint Martins Museum & Study Collection",
                "CSM Museum & Study Collection"
            ],
            [
                "Museum of Leathercraft",
                "National Leather Collection"
            ]
        ]
    },
    {
        "NNQT_question": "Show a list of soccer clubs that play in the Bundesliga.",
        "uid": "157",
        "subgraph": "",
        "template_index": "",
        "question": "Show a list of soccer clubs that play in the Bundesliga.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q476028 ; wdt:P118 wd:Q82595 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q4512",
            "http://www.wikidata.org/entity/Q15755",
            "http://www.wikidata.org/entity/Q15789",
            "http://www.wikidata.org/entity/Q22707",
            "http://www.wikidata.org/entity/Q38245",
            "http://www.wikidata.org/entity/Q41420",
            "http://www.wikidata.org/entity/Q51976",
            "http://www.wikidata.org/entity/Q101859",
            "http://www.wikidata.org/entity/Q101959",
            "http://www.wikidata.org/entity/Q104761",
            "http://www.wikidata.org/entity/Q104770",
            "http://www.wikidata.org/entity/Q105254",
            "http://www.wikidata.org/entity/Q105861",
            "http://www.wikidata.org/entity/Q106394",
            "http://www.wikidata.org/entity/Q479351",
            "http://www.wikidata.org/entity/Q141971",
            "http://www.wikidata.org/entity/Q142005",
            "http://www.wikidata.org/entity/Q162251",
            "http://www.wikidata.org/entity/Q702455"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "VfB Stuttgart",
                "Verein f\u00fcr Bewegungsspiele Stuttgart 1893 e. V."
            ],
            [
                "FC Augsburg",
                "Fu\u00dfball-Club Augsburg 1907 e. V",
                "FC Augsburg Football Team",
                "Fu\u00dfball-Club Augsburg",
                "FC Augsburg Soccer Team"
            ],
            [
                "FC Bayern Munich",
                "Bayern Munich",
                "Bayern Muenchen",
                "Bayern Munchen",
                "FC Bayern Muenchen",
                "FC Bayern Munchen",
                "Bayern",
                "Bayern M\u00fcnchen",
                "FC Bayern M\u00fcnchen",
                "FCBM",
                "Munich",
                "FCBM 1900",
                "FCB Munich",
                "Bayern of Munich",
                "F.C. Bayern Munich"
            ],
            [
                "TSG 1899 Hoffenheim",
                "TSG Hoffenheim",
                "1899 Hoffenheim II",
                "1899 Hoffenheim",
                "TSG Hoffenheim II",
                "Turn- und Sportgemeinschaft 1899 Hoffenheim e.V."
            ],
            [
                "Eintracht Frankfurt",
                "Eintracht Frankfurt e. V.",
                "Frankfurt",
                "Eintracht"
            ],
            [
                "Borussia Dortmund",
                "BVB",
                "Dortmund",
                "Ballspielverein Borussia 09 e.V. Dortmund"
            ],
            [
                "SV Werder Bremen",
                "Werder Bremen"
            ],
            [
                "VfL Wolfsburg"
            ],
            [
                "Borussia M\u00f6nchengladbach"
            ],
            [
                "Bayer 04 Leverkusen",
                "Bayer 04 Leverkusen Fu\u00dfball GmbH",
                "Bayer Leverkusen",
                "Bayer",
                "Leverkusen",
                "Die Werkself",
                "Bayer 04 Leverkusen Fu\u00dfball GmbH Soccer",
                "Bayer 04 Football"
            ],
            [
                "1. FC K\u00f6ln",
                "1. FC Cologne",
                "1. Fu\u00dfball-Club K\u00f6ln 01/07 e. V."
            ],
            [
                "1. FSV Mainz 05",
                "1. Fu\u00dfball- und Sportverein Mainz 05 e. V.",
                "Mainz 05",
                "Mainz"
            ],
            [
                "VfL Bochum",
                "VfL Bochum 1848"
            ],
            [
                "SC Freiburg",
                "Sport Club Freiburg",
                "Sport-Club Freiburg e.V.",
                "S.C. Freiburg"
            ],
            [
                "SV Darmstadt 98",
                "S.V. Darmstadt 98"
            ],
            [
                "1. FC Union Berlin",
                "1. Fu\u00dfballclub Union Berlin",
                "Berlin FC",
                "FC Union Berlin",
                "FC Berlin",
                "Union Berlin"
            ],
            [
                "F.C. Hansa Rostock"
            ],
            [
                "1. FC Heidenheim"
            ],
            [
                "RB Leipzig",
                "RasenBallsport Leipzig e.V."
            ]
        ]
    },
    {
        "NNQT_question": "Give me the capitals of all countries that the Himalayas run through.",
        "uid": "164",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the capitals of all countries that the Himalayas run through.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?country . ?country wdt:P36 ?uri . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q956",
            "http://www.wikidata.org/entity/Q987",
            "http://www.wikidata.org/entity/Q1362",
            "http://www.wikidata.org/entity/Q3037",
            "http://www.wikidata.org/entity/Q5838",
            "http://www.wikidata.org/entity/Q9270",
            "http://www.wikidata.org/entity/Q37400"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Beijing",
                "Peking",
                "Beiping",
                "Peiping",
                "Yanjing",
                "Zhongdu",
                "Khanbaliq",
                "BJ",
                "Pekin",
                "Shuntian",
                "Shuntianfu",
                "Shuntian Fu",
                "Pe-king",
                "Pei-p'ing",
                "Pei-ping",
                "Peip'ing",
                "Pei-ching",
                "Yan-ching",
                "Yanking",
                "Chung-tu",
                "Chungtu",
                "Khanbalik",
                "Shun-t'ien",
                "Shun-tien"
            ],
            [
                "New Delhi",
                "Nayi Dilli",
                "New Delhi Municipal Council Area",
                "NDMC area",
                "Nai Dilli"
            ],
            [
                "Islamabad",
                "Isl\u0101m\u0101b\u0101d"
            ],
            [
                "Kathmandu",
                "Kathmandu Metropolitan City",
                "Kathmandu Valley",
                "Khatmandu",
                "City of Temples",
                "Yen",
                "Kasthamandap",
                "Kantipur",
                "Yambu"
            ],
            [
                "Kabul",
                "Cabool",
                "Caubul",
                "Kabol",
                "Cabul"
            ],
            [
                "Thimphu",
                "Thimpu",
                "\u0f50\u0f72\u0f58\u0f0b\u0f55\u0f74\u0f0b"
            ],
            [
                "Naypyidaw",
                "Nay Pyi Taw",
                "Naypyitaw"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all federal chancellors of Germany.",
        "uid": "182",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all federal chancellors of Germany.",
        "sparql_wikidata": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P39> <http://www.wikidata.org/entity/Q4970706> . } ",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q567",
            "http://www.wikidata.org/entity/Q2492",
            "http://www.wikidata.org/entity/Q2496",
            "http://www.wikidata.org/entity/Q2514",
            "http://www.wikidata.org/entity/Q2512",
            "http://www.wikidata.org/entity/Q2518",
            "http://www.wikidata.org/entity/Q2516",
            "http://www.wikidata.org/entity/Q2530",
            "http://www.wikidata.org/entity/Q2571",
            "http://www.wikidata.org/entity/Q61053"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Angela Merkel",
                "Angela Dorothea Merkel",
                "Angela Kasner",
                "Angela Dorothea Kasner"
            ],
            [
                "Konrad Adenauer",
                "Konrad Hermann Joseph Adenauer"
            ],
            [
                "Ludwig Erhard",
                "Ludwig Wilhelm Erhard"
            ],
            [
                "Willy Brandt",
                "Herbert Ernst Karl Frahm",
                "Gunnar Gaasland",
                "Herbert Frahm"
            ],
            [
                "Kurt Georg Kiesinger"
            ],
            [
                "Helmut Kohl",
                "Helmut Josef Michael Kohl",
                "Kohl"
            ],
            [
                "Helmut Schmidt",
                "Helmut Heinrich Waldemar Schmidt"
            ],
            [
                "Gerhard Schr\u00f6der",
                "Gerhard Fritz Kurt Schr\u00f6der"
            ],
            [
                "Walter Scheel"
            ],
            [
                "Olaf Scholz",
                "Chancellor Scholz",
                "Scholz"
            ]
        ]
    },
    {
        "NNQT_question": "Who created Goofy?",
        "uid": "189",
        "subgraph": "",
        "template_index": "",
        "question": "Who created Goofy?",
        "sparql_wikidata": "SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q111135> <http://www.wikidata.org/prop/direct/P170> ?uri . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q2420722"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Art Babbitt",
                "Arthur Babbitt",
                "Arthur Harold Babitsky"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all the TV shows with Neil Patrick Harris.",
        "uid": "192",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all the TV shows with Neil Patrick Harris.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279* wd:Q15416 . ?uri wdt:P161 wd:Q485310 . ?uri wdt:P31 ?type . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q842253",
            "http://www.wikidata.org/entity/Q6988215",
            "http://www.wikidata.org/entity/Q1500187",
            "http://www.wikidata.org/entity/Q1500187",
            "http://www.wikidata.org/entity/Q1964370",
            "http://www.wikidata.org/entity/Q3224576",
            "http://www.wikidata.org/entity/Q6944937",
            "http://www.wikidata.org/entity/Q7548538",
            "http://www.wikidata.org/entity/Q7722777",
            "http://www.wikidata.org/entity/Q4022709",
            "http://www.wikidata.org/entity/Q8907426",
            "http://www.wikidata.org/entity/Q16004491",
            "http://www.wikidata.org/entity/Q937913",
            "http://www.wikidata.org/entity/Q147235",
            "http://www.wikidata.org/entity/Q3063140",
            "http://www.wikidata.org/entity/Q25340369",
            "http://www.wikidata.org/entity/Q104630896",
            "http://www.wikidata.org/entity/Q112417328"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Dr. Horrible's Sing-Along Blog",
                "Dr. Horrible"
            ],
            [
                "Neil's Puppet Dreams"
            ],
            [
                "Joan of Arc"
            ],
            [
                "A Family Torn Apart",
                "Sudden Fury",
                "Family Torn Apart"
            ],
            [
                "The Christmas Blessing",
                "Christmas Blessing"
            ],
            [
                "My Antonia"
            ],
            [
                "Snowbound: The Jim and Jennifer Stolpa Story"
            ],
            [
                "The Christmas Wish",
                "Christmas Wish"
            ],
            [
                "Yes, Virginia",
                "Yes Virginia"
            ],
            [
                "The Wedding Dress",
                "Wedding Dress"
            ],
            [
                "American Horror Story: Freak Show"
            ],
            [
                "Doogie Howser, M.D."
            ],
            [
                "How I Met Your Mother",
                "HIMYM"
            ],
            [
                "Stark Raving Mad"
            ],
            [
                "A Series of Unfortunate Events",
                "Lemony Snicket's A Series of Unfortunate Events"
            ],
            [
                "It's a Sin"
            ],
            [
                "Uncoupled"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all Swedish holidays.",
        "uid": "195",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all Swedish holidays.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q1401522 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q39864",
            "http://www.wikidata.org/entity/Q40317",
            "http://www.wikidata.org/entity/Q1348730"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Pentecost"
            ],
            [
                "Good Friday",
                "Holy Friday"
            ],
            [
                "National Day of Sweden",
                "Sveriges nationaldag"
            ]
        ]
    }
]