[
    {
        "NNQT_question": "Who killed Caesar?",
        "uid": "2",
        "subgraph": "",
        "template_index": "",
        "question": "Who killed Caesar?",
        "sparql_wikidata": "SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q1048>  <http://www.wikidata.org/prop/direct/P157>  ?o1 .  }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1228715",
            "http://www.wikidata.org/entity/Q1243545",
            "http://www.wikidata.org/entity/Q172248",
            "http://www.wikidata.org/entity/Q207370",
            "http://www.wikidata.org/entity/Q294846"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Tillius Cimber",
            "Publius Servilius Casca",
            "Marcus Junius Brutus",
            "Gaius Cassius Longinus",
            "Decimus Junius Brutus Albinus"
        ]
    },
    {
        "NNQT_question": "What is Angela Merkel\u2019s birth name?",
        "uid": "9",
        "subgraph": "",
        "template_index": "",
        "question": "What is Angela Merkel\u2019s birth name?",
        "sparql_wikidata": "SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q567> <http://www.wikidata.org/prop/direct/P1477>  ?o1 .  }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "Angela Dorothea Kasner"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Angela Dorothea Kasner"
        ]
    },
    {
        "NNQT_question": "Give me the homepage of Forbes.",
        "uid": "20",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the homepage of Forbes.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q25161472 wdt:P856 ?uri } ",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://forbes.com",
            "https://www.forbes.com"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "http://forbes.com",
            "https://www.forbes.com"
        ]
    },
    {
        "NNQT_question": "Give me all spacecrafts that flew to Mars.",
        "uid": "54",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all spacecrafts that flew to Mars.",
        "sparql_wikidata": "SELECT ?s1 where  { ?s1 <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q389459> } ",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q106614244",
            "http://www.wikidata.org/entity/Q176276",
            "http://www.wikidata.org/entity/Q1770537",
            "http://www.wikidata.org/entity/Q193538",
            "http://www.wikidata.org/entity/Q25415685",
            "http://www.wikidata.org/entity/Q3216558",
            "http://www.wikidata.org/entity/Q3445540",
            "http://www.wikidata.org/entity/Q48485",
            "http://www.wikidata.org/entity/Q87749354"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Zhurong",
            "Spirit",
            "Sojourner",
            "Opportunity",
            "Hyperion Rover",
            "LAMA robot - CnAM 44681",
            "Rosalind Franklin",
            "Curiosity",
            "Perseverance"
        ]
    },
    {
        "NNQT_question": "Give me all taikonauts.",
        "uid": "56",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all taikonauts.",
        "sparql_wikidata": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q11631 . ?uri wdt:P27 wd:Q148 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q107258209",
            "http://www.wikidata.org/entity/Q147581",
            "http://www.wikidata.org/entity/Q197135",
            "http://www.wikidata.org/entity/Q235266",
            "http://www.wikidata.org/entity/Q27336250",
            "http://www.wikidata.org/entity/Q28413601",
            "http://www.wikidata.org/entity/Q344892",
            "http://www.wikidata.org/entity/Q461840",
            "http://www.wikidata.org/entity/Q470059",
            "http://www.wikidata.org/entity/Q472683",
            "http://www.wikidata.org/entity/Q5256924",
            "http://www.wikidata.org/entity/Q557082",
            "http://www.wikidata.org/entity/Q704554",
            "http://www.wikidata.org/entity/Q705626",
            "http://www.wikidata.org/entity/Q7129713",
            "http://www.wikidata.org/entity/Q715126",
            "http://www.wikidata.org/entity/Q8070347",
            "http://www.wikidata.org/entity/Q9095339",
            "http://www.wikidata.org/entity/Q9364420"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Tang Hongbo",
            "Yang Liwei",
            "Zhai Zhigang",
            "Liu Yang",
            "Chen Dong",
            "Ye Guangfu",
            "Fei Junlong",
            "Jing Haipeng",
            "Liu Wang",
            "Nie Haisheng",
            "Deng Qingming",
            "Liu Boming",
            "Li Qinglong",
            "Wang Yaping",
            "Pan Zhanchun",
            "Wu Jie",
            "Zhang Xiaoguang",
            "Zhao Chuandong",
            "Chen Quan"
        ]
    },
    {
        "NNQT_question": "Give me all female German chancellors.",
        "uid": "61",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all female German chancellors.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P21 wd:Q6581072 . ?uri wdt:P39 wd:Q4970706 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q567"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Angela Merkel"
        ]
    },
    {
        "NNQT_question": "Who owns Aldi?",
        "uid": "62",
        "subgraph": "",
        "template_index": "",
        "question": "Who owns Aldi?",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q125054 wdt:P355 ?uri }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q15815751"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Hofer KG"
        ]
    },
    {
        "NNQT_question": "List all boardgames by GMT.",
        "uid": "119",
        "subgraph": "",
        "template_index": "",
        "question": "List all boardgames by GMT.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q131436 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1115156",
            "http://www.wikidata.org/entity/Q44571846",
            "http://www.wikidata.org/entity/Q44782145",
            "http://www.wikidata.org/entity/Q4660797",
            "http://www.wikidata.org/entity/Q6020459"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Commands & Colors: Ancients",
            "Thunder Alley",
            "Labyrinth",
            "A World at War",
            "Reds!"
        ]
    },
    {
        "NNQT_question": "Show a list of soccer clubs that play in the Bundesliga.",
        "uid": "157",
        "subgraph": "",
        "template_index": "",
        "question": "Show a list of soccer clubs that play in the Bundesliga.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q476028 ; wdt:P118 wd:Q82595 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q101959",
            "http://www.wikidata.org/entity/Q102720",
            "http://www.wikidata.org/entity/Q104761",
            "http://www.wikidata.org/entity/Q104770",
            "http://www.wikidata.org/entity/Q105844",
            "http://www.wikidata.org/entity/Q105861",
            "http://www.wikidata.org/entity/Q106394",
            "http://www.wikidata.org/entity/Q141971",
            "http://www.wikidata.org/entity/Q142005",
            "http://www.wikidata.org/entity/Q15755",
            "http://www.wikidata.org/entity/Q170117",
            "http://www.wikidata.org/entity/Q22707",
            "http://www.wikidata.org/entity/Q32494",
            "http://www.wikidata.org/entity/Q38245",
            "http://www.wikidata.org/entity/Q41420",
            "http://www.wikidata.org/entity/Q4512",
            "http://www.wikidata.org/entity/Q479351",
            "http://www.wikidata.org/entity/Q51976",
            "http://www.wikidata.org/entity/Q702455"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Borussia M\u00f6nchengladbach",
            "Hertha BSC",
            "Bayer 04 Leverkusen",
            "1. FC K\u00f6ln",
            "Arminia Bielefeld",
            "VfL Bochum",
            "SC Freiburg",
            "1. FC Union Berlin",
            "F.C. Hansa Rostock",
            "FC Augsburg",
            "FC Ingolstadt 04",
            "TSG 1899 Hoffenheim",
            "FC Schalke 04",
            "Eintracht Frankfurt",
            "Borussia Dortmund",
            "VfB Stuttgart",
            "SV Darmstadt 98",
            "SV Werder Bremen",
            "RB Leipzig"
        ]
    },
    {
        "NNQT_question": "Give me all soccer clubs in the Premier League.",
        "uid": "172",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all soccer clubs in the Premier League.",
        "sparql_wikidata": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q476028> . ?uri <http://www.wikidata.org/prop/direct/P118> <http://www.wikidata.org/entity/Q9448> . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1128631",
            "http://www.wikidata.org/entity/Q1130849",
            "http://www.wikidata.org/entity/Q18656",
            "http://www.wikidata.org/entity/Q18708",
            "http://www.wikidata.org/entity/Q18711",
            "http://www.wikidata.org/entity/Q18716",
            "http://www.wikidata.org/entity/Q18732",
            "http://www.wikidata.org/entity/Q18741",
            "http://www.wikidata.org/entity/Q18744",
            "http://www.wikidata.org/entity/Q18747",
            "http://www.wikidata.org/entity/Q19453",
            "http://www.wikidata.org/entity/Q19458",
            "http://www.wikidata.org/entity/Q19467",
            "http://www.wikidata.org/entity/Q19481",
            "http://www.wikidata.org/entity/Q19500",
            "http://www.wikidata.org/entity/Q19571",
            "http://www.wikidata.org/entity/Q19607",
            "http://www.wikidata.org/entity/Q50602",
            "http://www.wikidata.org/entity/Q5794",
            "http://www.wikidata.org/entity/Q9616",
            "http://www.wikidata.org/entity/Q9617"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Leeds United F.C.",
            "Liverpool F.C.",
            "Manchester United F.C.",
            "Fulham F.C.",
            "Aston Villa F.C.",
            "Newcastle United F.C.",
            "Southampton F.C.",
            "Tottenham Hotspur F.C.",
            "West Bromwich Albion F.C.",
            "West Ham United F.C.",
            "Brighton & Hove Albion F.C.",
            "Burnley F.C.",
            "Crystal Palace F.C.",
            "Leicester City F.C.",
            "Wolverhampton Wanderers F.C.",
            "Brentford F.C.",
            "Sheffield United F.C.",
            "Manchester City F.C.",
            "Everton F.C.",
            "Chelsea F.C.",
            "Arsenal F.C."
        ]
    },
    {
        "NNQT_question": "Give me all federal chancellors of Germany.",
        "uid": "182",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all federal chancellors of Germany.",
        "sparql_wikidata": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P39> <http://www.wikidata.org/entity/Q4970706> . } ",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q2492",
            "http://www.wikidata.org/entity/Q2496",
            "http://www.wikidata.org/entity/Q2512",
            "http://www.wikidata.org/entity/Q2514",
            "http://www.wikidata.org/entity/Q2516",
            "http://www.wikidata.org/entity/Q2518",
            "http://www.wikidata.org/entity/Q2530",
            "http://www.wikidata.org/entity/Q2571",
            "http://www.wikidata.org/entity/Q567"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Konrad Adenauer",
            "Ludwig Erhard",
            "Kurt Georg Kiesinger",
            "Willy Brandt",
            "Helmut Schmidt",
            "Helmut Kohl",
            "Gerhard Schr\u00f6der",
            "Walter Scheel",
            "Angela Merkel"
        ]
    },
    {
        "NNQT_question": "Who created Goofy?",
        "uid": "189",
        "subgraph": "",
        "template_index": "",
        "question": "Who created Goofy?",
        "sparql_wikidata": "SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q111135> <http://www.wikidata.org/prop/direct/P170> ?uri . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q2420722"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Art Babbitt"
        ]
    },
    {
        "NNQT_question": "Give me all Swedish holidays.",
        "uid": "195",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all Swedish holidays.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q1401522 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1348730",
            "http://www.wikidata.org/entity/Q39864",
            "http://www.wikidata.org/entity/Q40317"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "National Day of Sweden",
            "Pentecost",
            "Good Friday"
        ]
    },
    {
        "NNQT_question": "List all the musicals with music by Leonard Bernstein.",
        "uid": "197",
        "subgraph": "",
        "template_index": "",
        "question": "List all the musicals with music by Leonard Bernstein.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q2743 ; wdt:P86 wd:Q152505 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1033015",
            "http://www.wikidata.org/entity/Q2306874",
            "http://www.wikidata.org/entity/Q4551092",
            "http://www.wikidata.org/entity/Q4658713",
            "http://www.wikidata.org/entity/Q7759181"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Candide",
            "Wonderful Town",
            "1600 Pennsylvania Avenue",
            "A Party with Betty Comden and Adolph Green",
            "The Race to Urga"
        ]
    },
    {
        "NNQT_question": "Give me all Australian metalcore bands.",
        "uid": "201",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all Australian metalcore bands.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q215380 ; wdt:P495 wd:Q408 ; wdt:P136 wd:Q183862 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q15238671",
            "http://www.wikidata.org/entity/Q1764491",
            "http://www.wikidata.org/entity/Q18353614",
            "http://www.wikidata.org/entity/Q19244922",
            "http://www.wikidata.org/entity/Q19871547",
            "http://www.wikidata.org/entity/Q25387895",
            "http://www.wikidata.org/entity/Q26882710",
            "http://www.wikidata.org/entity/Q31836861",
            "http://www.wikidata.org/entity/Q50306488",
            "http://www.wikidata.org/entity/Q51029232",
            "http://www.wikidata.org/entity/Q5319378"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Hand of Mercy",
            "The Amity Affliction",
            "Totally Unicorn",
            "Feed Her to the Sharks",
            "A Breach of Silence",
            "Dreamkillers",
            "Storm the Sky",
            "Picture the End",
            "Cry Murder",
            "Polaris",
            "Dyscord"
        ]
    },
    {
        "NNQT_question": "Give me all types of eating disorders.",
        "uid": "203",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all types of eating disorders.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279 wd:Q373822 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q11318376",
            "http://www.wikidata.org/entity/Q1134891",
            "http://www.wikidata.org/entity/Q131749",
            "http://www.wikidata.org/entity/Q1334368",
            "http://www.wikidata.org/entity/Q17104923",
            "http://www.wikidata.org/entity/Q180913",
            "http://www.wikidata.org/entity/Q209522",
            "http://www.wikidata.org/entity/Q2303219",
            "http://www.wikidata.org/entity/Q2742106",
            "http://www.wikidata.org/entity/Q331632",
            "http://www.wikidata.org/entity/Q3485506",
            "http://www.wikidata.org/entity/Q357522",
            "http://www.wikidata.org/entity/Q4358147",
            "http://www.wikidata.org/entity/Q492054",
            "http://www.wikidata.org/entity/Q5441238",
            "http://www.wikidata.org/entity/Q5588436",
            "http://www.wikidata.org/entity/Q559538",
            "http://www.wikidata.org/entity/Q56326859",
            "http://www.wikidata.org/entity/Q567713",
            "http://www.wikidata.org/entity/Q653267",
            "http://www.wikidata.org/entity/Q7074872",
            "http://www.wikidata.org/entity/Q7850784",
            "http://www.wikidata.org/entity/Q929963"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Chew and spit",
            "pica",
            "anorexia nervosa",
            "orthorexia nervosa",
            "other specified feeding or eating disorder",
            "bulimia nervosa",
            "Binge eating disorder",
            "binge eating",
            "food addiction",
            "overeating",
            "sitomania",
            "Adipsia",
            "rumination disorder",
            "eating disorder not otherwise specified",
            "Feeding disorder",
            "Gourmand syndrome",
            "night eating syndrome",
            "pregorexia",
            "anorexia mirabilis",
            "polyphagia",
            "social stigma of obesity",
            "Tube dependency",
            "primary polydipsia"
        ]
    },
    {
        "NNQT_question": "Give me all libraries established earlier than 1400.",
        "uid": "208",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all libraries established earlier than 1400.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7075 ; wdt:P571 ?date . FILTER (YEAR(?date) < 1400 ) }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q11680213",
            "http://www.wikidata.org/entity/Q2326916",
            "http://www.wikidata.org/entity/Q24101",
            "http://www.wikidata.org/entity/Q5727966",
            "http://www.wikidata.org/entity/Q667615",
            "http://www.wikidata.org/entity/Q80943782"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Biblioteca de Montserrat",
            "Schaffhausen City Library",
            "Jagiellonian Library",
            "Library of Pantainus",
            "Admont Abbey",
            "Arxiu i Biblioteca de Poblet"
        ]
    },
    {
        "NNQT_question": "Show me all songs from Bruce Springsteen released between 1980 and 1990.",
        "uid": "226",
        "subgraph": "",
        "template_index": "",
        "question": "Show me all songs from Bruce Springsteen released between 1980 and 1990.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7366 ; wdt:P577 ?date ; wdt:P175 wd:Q1225 . BIND(YEAR(?date) as ?year) . FILTER(?year >= 1980 && ?year <= 1990) }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1159364",
            "http://www.wikidata.org/entity/Q14480807",
            "http://www.wikidata.org/entity/Q2011701",
            "http://www.wikidata.org/entity/Q2406167",
            "http://www.wikidata.org/entity/Q3508168",
            "http://www.wikidata.org/entity/Q3508371",
            "http://www.wikidata.org/entity/Q3509558",
            "http://www.wikidata.org/entity/Q522215",
            "http://www.wikidata.org/entity/Q5466942",
            "http://www.wikidata.org/entity/Q5759916",
            "http://www.wikidata.org/entity/Q6015978",
            "http://www.wikidata.org/entity/Q613428",
            "http://www.wikidata.org/entity/Q6266189",
            "http://www.wikidata.org/entity/Q67871006",
            "http://www.wikidata.org/entity/Q7195973",
            "http://www.wikidata.org/entity/Q7207956",
            "http://www.wikidata.org/entity/Q7290094",
            "http://www.wikidata.org/entity/Q7618613",
            "http://www.wikidata.org/entity/Q7769237"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Dancing in the Dark",
            "Wreck on the Highway",
            "Darlington County",
            "The River",
            "Fire",
            "Nebraska",
            "Downbound Train",
            "Born in the U.S.A.",
            "For You",
            "Highway Patrolman",
            "Independence Day",
            "Working on the Highway",
            "Johnny 99",
            "Sherry Darling",
            "Pink Cadillac",
            "Point Blank",
            "Ramrod",
            "Stolen Car",
            "The Ties That Bind"
        ]
    },
    {
        "NNQT_question": "Give me the birthdays of all actors of the television show Charmed.",
        "uid": "230",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the birthdays of all actors of the television show Charmed.",
        "sparql_wikidata": "SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q162371> <http://www.wikidata.org/prop/direct/P161>/<http://www.wikidata.org/prop/direct/P569> ?date . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "1973-12-03T00:00:00Z",
            "1972-12-19T00:00:00Z",
            "1971-04-12T00:00:00Z",
            "1973-09-05T00:00:00Z"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "1973-12-03T00:00:00Z",
            "1972-12-19T00:00:00Z",
            "1971-04-12T00:00:00Z",
            "1973-09-05T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "Show me all English Gothic buildings in Kent.",
        "uid": "234",
        "subgraph": "",
        "template_index": "",
        "question": "Show me all English Gothic buildings in Kent.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279* wd:Q176483 . ?uri wdt:P149 ?type ; wdt:P7959 wd:Q67479626 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q16255286",
            "http://www.wikidata.org/entity/Q17530195",
            "http://www.wikidata.org/entity/Q2323935",
            "http://www.wikidata.org/entity/Q334303",
            "http://www.wikidata.org/entity/Q4729533",
            "http://www.wikidata.org/entity/Q64019243",
            "http://www.wikidata.org/entity/Q23018724",
            "http://www.wikidata.org/entity/Q23018812",
            "http://www.wikidata.org/entity/Q24705034",
            "http://www.wikidata.org/entity/Q27080478",
            "http://www.wikidata.org/entity/Q27080498",
            "http://www.wikidata.org/entity/Q5108664",
            "http://www.wikidata.org/entity/Q5116796",
            "http://www.wikidata.org/entity/Q55886141",
            "http://www.wikidata.org/entity/Q5638005",
            "http://www.wikidata.org/entity/Q17986065",
            "http://www.wikidata.org/entity/Q29265",
            "http://www.wikidata.org/entity/Q7590167",
            "http://www.wikidata.org/entity/Q7592825",
            "http://www.wikidata.org/entity/Q7594320",
            "http://www.wikidata.org/entity/Q7595282",
            "http://www.wikidata.org/entity/Q7595294",
            "http://www.wikidata.org/entity/Q7374508"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "St Ethelbert's church, Ramsgate",
            "St Augustine's Church",
            "St James' Church, Cooling",
            "St Augustine's Abbey",
            "All Saints Church",
            "Victoria Gardens Kiosk",
            "Our Lady of Gillingham Church",
            "St Thomas of Canterbury Church, Canterbury",
            "Church of St Mary the Virgin, Reculver",
            "Church of Holy Trinity",
            "Roman Catholic Church of St Peter",
            "Christ Church, Ashford",
            "Church of All Saints, Murston",
            "St Paul's Church, Dover",
            "Hadlow Castle",
            "St Eanswith's Church, Brenzett",
            "Canterbury Cathedral",
            "St. Mary's Church, Hadlow",
            "St Clement's Church, Knowlton",
            "St Mary's Church, Eastwell",
            "St Peter's Church, Sandwich",
            "St Peter's Church, Swingfield",
            "The Beany"
        ]
    },
    {
        "NNQT_question": "List all episodes of the first season of the HBO television series The Sopranos!",
        "uid": "244",
        "subgraph": "",
        "template_index": "",
        "question": "List all episodes of the first season of the HBO television series The Sopranos!",
        "sparql_wikidata": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT (COUNT(?episode) AS ?count) WHERE { ?episode wdt:P4908 wd:Q5274359 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "13"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "13"
        ]
    },
    {
        "NNQT_question": "List the seven kings of Rome.",
        "uid": "255",
        "subgraph": "",
        "template_index": "",
        "question": "List the seven kings of Rome.",
        "sparql_wikidata": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT * WHERE { ?res wdt:P39 wd:Q55375123 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q192998",
            "http://www.wikidata.org/entity/Q193047",
            "http://www.wikidata.org/entity/Q200031",
            "http://www.wikidata.org/entity/Q200859",
            "http://www.wikidata.org/entity/Q206741",
            "http://www.wikidata.org/entity/Q212671"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Servius Tullius",
            "Lucius Tarquinius Superbus",
            "Numa Pompilius",
            "Tullus Hostilius",
            "Ancus Marcius",
            "Lucius Tarquinius Priscus"
        ]
    }
]