[
    {
        "NNQT_question": "List all the musicals with music by Leonard Bernstein.",
        "uid": "197",
        "subgraph": "",
        "template_index": "",
        "question": "List all the musicals with music by Leonard Bernstein.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q2743 ; wdt:P86 wd:Q152505 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": []
    },
    {
        "NNQT_question": "Give me all Australian metalcore bands.",
        "uid": "201",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all Australian metalcore bands.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q215380 ; wdt:P495 wd:Q408 ; wdt:P136 wd:Q183862 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1764491",
            "http://www.wikidata.org/entity/Q5319378",
            "http://www.wikidata.org/entity/Q15238671",
            "http://www.wikidata.org/entity/Q18353614",
            "http://www.wikidata.org/entity/Q19244922",
            "http://www.wikidata.org/entity/Q19871547",
            "http://www.wikidata.org/entity/Q25387895",
            "http://www.wikidata.org/entity/Q26882710",
            "http://www.wikidata.org/entity/Q31836861",
            "http://www.wikidata.org/entity/Q50306488",
            "http://www.wikidata.org/entity/Q51029232"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "The Amity Affliction"
            ],
            [
                "Dyscord"
            ],
            [
                "Hand of Mercy"
            ],
            [
                "Totally Unicorn"
            ],
            [
                "Feed Her to the Sharks"
            ],
            [
                "A Breach of Silence"
            ],
            [
                "Dreamkillers"
            ],
            [
                "Storm the Sky"
            ],
            [
                "Picture the End"
            ],
            [
                "Cry Murder",
                "Crymurder"
            ],
            [
                "Polaris"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all types of eating disorders.",
        "uid": "203",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all types of eating disorders.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279 wd:Q373822 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q131749",
            "http://www.wikidata.org/entity/Q209522",
            "http://www.wikidata.org/entity/Q357522",
            "http://www.wikidata.org/entity/Q492054",
            "http://www.wikidata.org/entity/Q559538",
            "http://www.wikidata.org/entity/Q567713",
            "http://www.wikidata.org/entity/Q653267",
            "http://www.wikidata.org/entity/Q929963",
            "http://www.wikidata.org/entity/Q1134891",
            "http://www.wikidata.org/entity/Q1334368",
            "http://www.wikidata.org/entity/Q2742106",
            "http://www.wikidata.org/entity/Q3485506",
            "http://www.wikidata.org/entity/Q4358147",
            "http://www.wikidata.org/entity/Q5441238",
            "http://www.wikidata.org/entity/Q5588436",
            "http://www.wikidata.org/entity/Q5735426",
            "http://www.wikidata.org/entity/Q7447762",
            "http://www.wikidata.org/entity/Q17104923",
            "http://www.wikidata.org/entity/Q18554097",
            "http://www.wikidata.org/entity/Q64513386",
            "http://www.wikidata.org/entity/Q108760799",
            "http://www.wikidata.org/entity/Q118958702"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "anorexia nervosa",
                "Anorexia nerviosa",
                "EIN"
            ],
            [
                "Binge eating disorder",
                "BED",
                "binge eating disorder",
                "psychogenic overeating"
            ],
            [
                "Adipsia"
            ],
            [
                "eating disorder not otherwise specified",
                "UFED",
                "unspecified feeding or eating disorder",
                "EDNOS"
            ],
            [
                "night eating syndrome",
                "NES",
                "nocturnal eating syndrome"
            ],
            [
                "anorexia mirabilis"
            ],
            [
                "polyphagia",
                "hyperphagia"
            ],
            [
                "primary polydipsia",
                "psychogenic polydipsia",
                "polydipsia, psychogenic"
            ],
            [
                "pica",
                "pica disease",
                "pica (disease)",
                "pica (disorder)",
                "parorexia",
                "allotriophagy",
                "perverted appetite disorder"
            ],
            [
                "orthorexia nervosa",
                "orthorexia"
            ],
            [
                "food addiction",
                "eating addiction",
                "compulsive overeating"
            ],
            [
                "sitomania"
            ],
            [
                "rumination disorder",
                "Psychogenic rumination (disorder)",
                "Psychogenic rumination",
                "Rumination syndrome",
                "Rumination"
            ],
            [
                "Feeding disorder"
            ],
            [
                "Gourmand syndrome"
            ],
            [
                "bulimarexia"
            ],
            [
                "avoidant/restrictive food intake disorder",
                "Avoidant/Restrictive Food Intake Disorder",
                "ARFID",
                "selective eating disorder"
            ],
            [
                "other specified feeding or eating disorder",
                "eating disorder not otherwise specified",
                "OSFED"
            ],
            [
                "feeding and eating disorders of childhood"
            ],
            [
                "bulimia nervosa",
                "BN",
                "bulimia"
            ],
            [
                "Food avoidance emotional disorder",
                "FAED, ARFID, Avoidant restrictive food intake disorder,"
            ],
            [
                "atypical eating disorder"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all libraries established earlier than 1400.",
        "uid": "208",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all libraries established earlier than 1400.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7075 ; wdt:P571 ?date . FILTER (YEAR(?date) < 1400 ) }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q931577",
            "http://www.wikidata.org/entity/Q2326916",
            "http://www.wikidata.org/entity/Q667615",
            "http://www.wikidata.org/entity/Q24101",
            "http://www.wikidata.org/entity/Q33018",
            "http://www.wikidata.org/entity/Q11680213",
            "http://www.wikidata.org/entity/Q19871811",
            "http://www.wikidata.org/entity/Q5727966",
            "http://www.wikidata.org/entity/Q80943782",
            "http://www.wikidata.org/entity/Q111162711",
            "http://www.wikidata.org/entity/Q120869241"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Franciscan friary and church of St John the Baptist, Kraljeva Sutjeska",
                "Franciscan friary of St John the Baptist, Kraljeva Sutjeska"
            ],
            [
                "Schaffhausen City Library",
                "Stadtbibliothek Schaffhausen",
                "Bibliotheken Schaffhausen"
            ],
            [
                "Admont Abbey"
            ],
            [
                "Jagiellonian Library",
                "Biblioteka Jagiellonska",
                "Biblioteka Jagiello\u0144ska",
                "Jagiellonka",
                "Jagiellon Library"
            ],
            [
                "House of Wisdom",
                "Bayt al-\u1e24ikmah",
                "House of memories",
                "Grand Library of Baghdad",
                "Great Library of Baghdad",
                "Library of Baghdad"
            ],
            [
                "Biblioteca de Montserrat"
            ],
            [
                "Al-Budeiri Library"
            ],
            [
                "Library of Pantainus",
                "Library of Pantainos"
            ],
            [
                "Arxiu i Biblioteca de Poblet"
            ],
            [
                "Library of Makkah Grand Mosque"
            ],
            [
                "Coll\u00e8ge de Sorbonne Biblioth\u00e8que"
            ]
        ]
    },
    {
        "NNQT_question": "Show me all songs from Bruce Springsteen released between 1980 and 1990.",
        "uid": "226",
        "subgraph": "",
        "template_index": "",
        "question": "Show me all songs from Bruce Springsteen released between 1980 and 1990.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7366 ; wdt:P577 ?date ; wdt:P175 wd:Q1225 . BIND(YEAR(?date) as ?year) . FILTER(?year >= 1980 && ?year <= 1990) }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q613428",
            "http://www.wikidata.org/entity/Q2011701",
            "http://www.wikidata.org/entity/Q3508168",
            "http://www.wikidata.org/entity/Q7207956",
            "http://www.wikidata.org/entity/Q7853317"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Working on the Highway"
            ],
            [
                "Darlington County"
            ],
            [
                "Fire"
            ],
            [
                "Point Blank"
            ],
            [
                "Tunnel of Love"
            ]
        ]
    },
    {
        "NNQT_question": "Give me the birthdays of all actors of the television show Charmed.",
        "uid": "230",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the birthdays of all actors of the television show Charmed.",
        "sparql_wikidata": "SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q162371> <http://www.wikidata.org/prop/direct/P161>/<http://www.wikidata.org/prop/direct/P569> ?date . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "1971-04-12T00:00:00Z",
            "1972-12-19T00:00:00Z",
            "1973-09-05T00:00:00Z",
            "1973-12-03T00:00:00Z"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            "1971-04-12T00:00:00Z",
            "1972-12-19T00:00:00Z",
            "1973-09-05T00:00:00Z",
            "1973-12-03T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "Show me all English Gothic buildings in Kent.",
        "uid": "234",
        "subgraph": "",
        "template_index": "",
        "question": "Show me all English Gothic buildings in Kent.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279* wd:Q176483 . ?uri wdt:P149 ?type ; wdt:P7959 wd:Q67479626 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q334303",
            "http://www.wikidata.org/entity/Q2323935",
            "http://www.wikidata.org/entity/Q17530195",
            "http://www.wikidata.org/entity/Q4729533",
            "http://www.wikidata.org/entity/Q16255286",
            "http://www.wikidata.org/entity/Q29265",
            "http://www.wikidata.org/entity/Q7590167",
            "http://www.wikidata.org/entity/Q7592825",
            "http://www.wikidata.org/entity/Q7594320",
            "http://www.wikidata.org/entity/Q7595282",
            "http://www.wikidata.org/entity/Q7595294",
            "http://www.wikidata.org/entity/Q17986065",
            "http://www.wikidata.org/entity/Q64019243"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "St Augustine's Abbey"
            ],
            [
                "St James' Church, Cooling"
            ],
            [
                "St Augustine's Church",
                "St Augustine's Church, Ramsgate",
                "Church of St Augustine of England (Roman Catholic) with Cloisters Attached"
            ],
            [
                "All Saints Church"
            ],
            [
                "St Ethelbert's church, Ramsgate"
            ],
            [
                "Canterbury Cathedral",
                "Cathedral and Metropolitical Church of Christ at Canterbury"
            ],
            [
                "St. Mary's Church, Hadlow",
                "Church Of St Mary"
            ],
            [
                "St Clement's Church, Knowlton"
            ],
            [
                "St Mary's Church, Eastwell",
                "Eastwell Church"
            ],
            [
                "St Peter's Church, Sandwich"
            ],
            [
                "St Peter's Church, Swingfield",
                "Church of St Peter"
            ],
            [
                "St Eanswith's Church, Brenzett",
                "Church Of St Eanswith"
            ],
            [
                "Victoria Gardens Kiosk"
            ]
        ]
    },
    {
        "NNQT_question": "List all episodes of the first season of the HBO television series The Sopranos!",
        "uid": "244",
        "subgraph": "",
        "template_index": "",
        "question": "List all episodes of the first season of the HBO television series The Sopranos!",
        "sparql_wikidata": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT (COUNT(?episode) AS ?count) WHERE { ?episode wdt:P4908 wd:Q5274359 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "13"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            "13"
        ]
    },
    {
        "NNQT_question": "List the seven kings of Rome.",
        "uid": "255",
        "subgraph": "",
        "template_index": "",
        "question": "List the seven kings of Rome.",
        "sparql_wikidata": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT * WHERE { ?res wdt:P39 wd:Q55375123 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q2186",
            "http://www.wikidata.org/entity/Q192998",
            "http://www.wikidata.org/entity/Q193047",
            "http://www.wikidata.org/entity/Q200031",
            "http://www.wikidata.org/entity/Q200859",
            "http://www.wikidata.org/entity/Q206741",
            "http://www.wikidata.org/entity/Q212671"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Romulus"
            ],
            [
                "Servius Tullius",
                "Mastarna"
            ],
            [
                "Lucius Tarquinius Superbus",
                "King of Rome Tarquinio Superbo",
                "King of Rome Tarquinius Superbus Lucius",
                "Tarquin the Proud"
            ],
            [
                "Numa Pompilius"
            ],
            [
                "Tullus Hostilius"
            ],
            [
                "Ancus Marcius"
            ],
            [
                "Lucius Tarquinius Priscus",
                "Tarquin the Elder"
            ]
        ]
    },
    {
        "NNQT_question": "Show me all the breweries in Australia.",
        "uid": "256",
        "subgraph": "",
        "template_index": "",
        "question": "Show me all the breweries in Australia.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q131734 . ?uri wdt:P17 wd:Q408 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1313123",
            "http://www.wikidata.org/entity/Q116318525",
            "http://www.wikidata.org/entity/Q116318998",
            "http://www.wikidata.org/entity/Q122980487",
            "http://www.wikidata.org/entity/Q2426375",
            "http://www.wikidata.org/entity/Q4997484",
            "http://www.wikidata.org/entity/Q4999111",
            "http://www.wikidata.org/entity/Q5374850",
            "http://www.wikidata.org/entity/Q6555401",
            "http://www.wikidata.org/entity/Q6663682",
            "http://www.wikidata.org/entity/Q16899043",
            "http://www.wikidata.org/entity/Q16932183",
            "http://www.wikidata.org/entity/Q19877213",
            "http://www.wikidata.org/entity/Q24190026",
            "http://www.wikidata.org/entity/Q41759163",
            "http://www.wikidata.org/entity/Q48808361",
            "http://www.wikidata.org/entity/Q48816560",
            "http://www.wikidata.org/entity/Q55605458",
            "http://www.wikidata.org/entity/Q55615830",
            "http://www.wikidata.org/entity/Q55623793",
            "http://www.wikidata.org/entity/Q55627422",
            "http://www.wikidata.org/entity/Q55637339",
            "http://www.wikidata.org/entity/Q56747448",
            "http://www.wikidata.org/entity/Q56752734",
            "http://www.wikidata.org/entity/Q60791658"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Foster's Group Limited"
            ],
            [
                "Duckstein Brewery"
            ],
            [
                "Dingo Brewing"
            ],
            [
                "Cheeky Monkey Brewing Company, Wilyabrup"
            ],
            [
                "Coopers Brewery",
                "Coopers Brewery Ltd",
                "Coopers",
                "Coopers Brewery Limited"
            ],
            [
                "Bundaberg Brewed Drinks"
            ],
            [
                "Burleigh Brewing Company"
            ],
            [
                "Emu Brewery",
                "Albion Brewery"
            ],
            [
                "Lion Brewing and Malting Company"
            ],
            [
                "Lobethal Bierhaus"
            ],
            [
                "Queensland Brewery Ltd"
            ],
            [
                "South Australian Brewing Company"
            ],
            [
                "Power's Brewery"
            ],
            [
                "Lion Brewery, Townsville"
            ],
            [
                "Resch's Ltd",
                "Resch's Limited"
            ],
            [
                "Hindmarsh Brewery"
            ],
            [
                "Pirie Street Brewery"
            ],
            [
                "Billson's Brewery"
            ],
            [
                "Kent Town Brewery"
            ],
            [
                "Morphett Street Brewery"
            ],
            [
                "Old Goulburn Brewery"
            ],
            [
                "Walkerville Brewery"
            ],
            [
                "Yorkshire Brewery building"
            ],
            [
                "Victoria Brewery building"
            ],
            [
                "Pirate Life Brewing"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all films produced by Steven Spielberg with a budget of at least $80 million.",
        "uid": "257",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all films produced by Steven Spielberg with a budget of at least $80 million.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P162 wd:Q8877 ; wdt:P31/wdt:P279* wd:Q11424 ; wdt:P2130 ?cost . FILTER(?cost > 80000000)}",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1102220",
            "http://www.wikidata.org/entity/Q3512046",
            "http://www.wikidata.org/entity/Q19689203",
            "http://www.wikidata.org/entity/Q22000542",
            "http://www.wikidata.org/entity/Q24278982",
            "http://www.wikidata.org/entity/Q63643994",
            "http://www.wikidata.org/entity/Q45839",
            "http://www.wikidata.org/entity/Q51416",
            "http://www.wikidata.org/entity/Q980041"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Jurassic Park III",
                "Jurassic Park 3"
            ],
            [
                "Jurassic World",
                "Jurassic World (2015 movie)"
            ],
            [
                "The BFG",
                "Roald Dahl's The BFG"
            ],
            [
                "Ready Player One",
                "Ready Player 1"
            ],
            [
                "Indiana Jones and the Dial of Destiny",
                "Indiana Jones 5",
                "Indiana Jones V",
                "Dial of Destiny"
            ],
            [
                "West Side Story"
            ],
            [
                "Memoirs of a Geisha"
            ],
            [
                "Men in Black",
                "MIB"
            ],
            [
                "The Adventures of Tintin: The Secret of the Unicorn",
                "The Adventures of Tintin",
                "The Secret of the Unicorn"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all breeds of the German Shepherd dog.",
        "uid": "260",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all breeds of the German Shepherd dog.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279* wd:Q38280 FILTER(?uri != wd:Q38280) }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q28442893"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Adel V.Leonberg White German Shepherds",
                "White Cliff Shepherds"
            ]
        ]
    },
    {
        "NNQT_question": "Who created Batman?",
        "uid": "278",
        "subgraph": "",
        "template_index": "",
        "question": "Who created Batman?",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2695156 wdt:P170 ?uri . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q313048",
            "http://www.wikidata.org/entity/Q464282"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Bob Kane",
                "Robert Kahn",
                "Robert Kane"
            ],
            [
                "Bill Finger",
                "Milton \"Bill\" Finger",
                "Milton William Finger",
                "Milton Finger"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all launch pads operated by NASA.",
        "uid": "292",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all launch pads operated by NASA.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q194188 ; wdt:P137 wd:Q23548 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q3510995",
            "http://www.wikidata.org/entity/Q48821"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "White Sands Space Harbor"
            ],
            [
                "Kennedy Space Center",
                "John F. Kennedy Space Center, KSC",
                "KSC",
                "John F. Kennedy Space Center"
            ]
        ]
    },
    {
        "NNQT_question": "List all the musicals with music by Elton John.",
        "uid": "305",
        "subgraph": "",
        "template_index": "",
        "question": "List all the musicals with music by Elton John.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q58483083 ; wdt:P86 wd:Q2808 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q1195106",
            "http://www.wikidata.org/entity/Q3830942",
            "http://www.wikidata.org/entity/Q403810",
            "http://www.wikidata.org/entity/Q2771",
            "http://www.wikidata.org/entity/Q7091479"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "The Lion King",
                "The Lion King Musical",
                "Lion King the musical",
                "Lion King musical",
                "The Lion King (musical)"
            ],
            [
                "Lestat"
            ],
            [
                "Aida"
            ],
            [
                "Billy Elliot the Musical",
                "Billy Elliot: The Musical"
            ],
            [
                "On the Record",
                "Disney's On the Record"
            ]
        ]
    },
    {
        "NNQT_question": "Give me the runtime of Toy Story.",
        "uid": "314",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the runtime of Toy Story.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?val WHERE { wd:Q171048 wdt:P2047 ?val . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "81"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            "81"
        ]
    },
    {
        "NNQT_question": "List the children of Margaret Thatcher.",
        "uid": "321",
        "subgraph": "",
        "template_index": "",
        "question": "List the children of Margaret Thatcher.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7416 wdt:P40 ?uri . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q713468",
            "http://www.wikidata.org/entity/Q2449855"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Mark Thatcher",
                "Sir Mark Thatcher, 2nd Bt.",
                "Sir Mark Thatcher, 2nd Baronet"
            ],
            [
                "Carol Thatcher",
                "Hon. Carol Thatcher",
                "Carol Jane Thatcher"
            ]
        ]
    },
    {
        "NNQT_question": "List all games by GMT.",
        "uid": "334",
        "subgraph": "",
        "template_index": "",
        "question": "List all games by GMT.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11410 ; wdt:P123 wd:Q928726 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q2697993",
            "http://www.wikidata.org/entity/Q44571846",
            "http://www.wikidata.org/entity/Q1115156",
            "http://www.wikidata.org/entity/Q4660797",
            "http://www.wikidata.org/entity/Q5412155",
            "http://www.wikidata.org/entity/Q6020459",
            "http://www.wikidata.org/entity/Q36899015",
            "http://www.wikidata.org/entity/Q44782145",
            "http://www.wikidata.org/entity/Q65245245"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Twilight Struggle"
            ],
            [
                "Thunder Alley"
            ],
            [
                "Commands & Colors: Ancients"
            ],
            [
                "A World at War",
                "World at War"
            ],
            [
                "Europe Engulfed"
            ],
            [
                "Reds!",
                "Reds! The Russian Civil War 1918-1921"
            ],
            [
                "Dominant Species"
            ],
            [
                "Labyrinth",
                "Labyrinth: The War on Terror, 2001 \u2013 ?"
            ],
            [
                "Space Empires 4X"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all members of Prodigy.",
        "uid": "339",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all members of Prodigy.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P463 wd:Q7256860 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q388259",
            "http://www.wikidata.org/entity/Q1776781",
            "http://www.wikidata.org/entity/Q1776790",
            "http://www.wikidata.org/entity/Q12054176"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Liam Howlett",
                "Liam Paris Howlett",
                "Liam Paul Paris Howlett"
            ],
            [
                "Maxim Reality",
                "Keith Palmer",
                "Maxim"
            ],
            [
                "Keith Flint",
                "Keith Charles Flint"
            ],
            [
                "Sharky"
            ]
        ]
    }
]