[
    {
        "NNQT_question": "Give me the birth place of Frank Sinatra.",
        "uid": "353",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the birth place of Frank Sinatra.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q40912 wdt:P19 ?uri }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q138578"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Hoboken",
                "Hoboken, New Jersey",
                "Hoboken, NJ"
            ]
        ]
    },
    {
        "NNQT_question": "Show me all books in Asimov's Foundation series.",
        "uid": "371",
        "subgraph": "",
        "template_index": "",
        "question": "Show me all books in Asimov's Foundation series.",
        "sparql_wikidata": "SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1564644> <http://www.wikidata.org/prop/direct/P527> ?uri }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q753894",
            "http://www.wikidata.org/entity/Q783533",
            "http://www.wikidata.org/entity/Q839800",
            "http://www.wikidata.org/entity/Q853927",
            "http://www.wikidata.org/entity/Q932592",
            "http://www.wikidata.org/entity/Q938629",
            "http://www.wikidata.org/entity/Q1050014"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Foundation"
            ],
            [
                "Prelude to Foundation"
            ],
            [
                "Foundation and Empire",
                "The Man Who Upset the Universe"
            ],
            [
                "Second Foundation"
            ],
            [
                "Foundation\u2019s Edge"
            ],
            [
                "Forward the Foundation"
            ],
            [
                "Foundation and Earth"
            ]
        ]
    },
    {
        "NNQT_question": "Give me the grandchildren of Elvis Presley.",
        "uid": "385",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the grandchildren of Elvis Presley.",
        "sparql_wikidata": " SELECT DISTINCT ?o2 WHERE { <http://www.wikidata.org/entity/Q303>  <http://www.wikidata.org/prop/direct/P40>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P40> ?o2 }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q254947",
            "http://www.wikidata.org/entity/Q17385637"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Riley Keough",
                "Danielle Riley Keough"
            ],
            [
                "Benjamin Keough"
            ]
        ]
    },
    {
        "NNQT_question": "Show me Hemingway's autobiography.",
        "uid": "397",
        "subgraph": "",
        "template_index": "",
        "question": "Show me Hemingway's autobiography.",
        "sparql_wikidata": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q23434> . ?uri <http://www.wikidata.org/prop/direct/P136> <http://www.wikidata.org/entity/Q4184> . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q2052363"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "A Moveable Feast"
            ]
        ]
    },
    {
        "NNQT_question": "Give me the currency of China.",
        "uid": "404",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the currency of China.",
        "sparql_wikidata": "SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q148>  <http://www.wikidata.org/prop/direct/P38>  ?o1 .  } ",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q39099"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "renminbi",
                "CNY",
                "\u00a5",
                "yuan",
                "Chinese Yuan",
                "RMB"
            ]
        ]
    },
    {
        "NNQT_question": "Give me all Swedish oceanographers.",
        "uid": "405",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all Swedish oceanographers.",
        "sparql_wikidata": "SELECT ?s1 WHERE {   ?s1  <http://www.wikidata.org/prop/direct/P27>  <http://www.wikidata.org/entity/Q34> .   ?s1  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q3546255> .  }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q60293",
            "http://www.wikidata.org/entity/Q377822",
            "http://www.wikidata.org/entity/Q2039914",
            "http://www.wikidata.org/entity/Q3121039",
            "http://www.wikidata.org/entity/Q4940077",
            "http://www.wikidata.org/entity/Q5630564",
            "http://www.wikidata.org/entity/Q24708160",
            "http://www.wikidata.org/entity/Q26927185"
        ],
        "template_id": "",
        "simplified_query": "",
        "solved_answer": [
            [
                "Carl-Gustaf Rossby",
                "Carl-Gustaf Arvid Rossby"
            ],
            [
                "Per Teodor Cleve",
                "Per Theodor Cleve",
                "Per Cleve",
                "Cleve",
                "Per T. Cleve"
            ],
            [
                "Otto Martin Torell",
                "Torell",
                "O.T."
            ],
            [
                "Gustaf Arrhenius"
            ],
            [
                "Karin Boren\u00e4s"
            ],
            [
                "Gustaf Ekman"
            ],
            [
                "Anna W\u00e5hlin",
                "Anna Wahlin"
            ],
            [
                "Bj\u00f6rn Kjerfve"
            ]
        ]
    }
]