[
    {
        "NNQT_question": "Give me the grandchildren of Bruce Lee.",
        "uid": "13",
        "subgraph": "",
        "template_index": "",
        "question": "Give me the grandchildren of Bruce Lee.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q16397 wdt:P40 ?children . ?children wdt:P40 ?uri . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": []
    },
    {
        "NNQT_question": "Give me all world heritage sites designated within the past two years.",
        "uid": "68",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all world heritage sites designated within the past two years.",
        "sparql_wikidata": "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q9259 ; wdt:P575 ?date . BIND(xsd:integer(YEAR(?date)) as ?year) . BIND(xsd:integer(YEAR(NOW())) as ?currentYear) . FILTER(?year < ?currentYear && ?year < (?currentYear - 2)) . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": []
    },
    {
        "NNQT_question": "List all the musicals with music by Leonard Bernstein.",
        "uid": "96",
        "subgraph": "",
        "template_index": "",
        "question": "List all the musicals with music by Leonard Bernstein.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q2743 ; wdt:P86 wd:Q152505 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": []
    },
    {
        "NNQT_question": "Give me all Australian metalcore bands.",
        "uid": "101",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all Australian metalcore bands.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q215380 ; wdt:P495 wd:Q408 ; wdt:P136 wd:Q183862 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q5319378",
            "http://www.wikidata.org/entity/Q1764491",
            "http://www.wikidata.org/entity/Q15238671",
            "http://www.wikidata.org/entity/Q18353614",
            "http://www.wikidata.org/entity/Q19244922",
            "http://www.wikidata.org/entity/Q19871547",
            "http://www.wikidata.org/entity/Q25387895",
            "http://www.wikidata.org/entity/Q26882710",
            "http://www.wikidata.org/entity/Q31836861",
            "http://www.wikidata.org/entity/Q50306488",
            "http://www.wikidata.org/entity/Q51029232"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Dyscord",
            "The Amity Affliction",
            "Hand of Mercy",
            "Totally Unicorn",
            "Feed Her to the Sharks",
            "A Breach of Silence",
            "Dreamkillers",
            "Storm the Sky",
            "Picture the End",
            "Cry Murder",
            "Polaris"
        ]
    },
    {
        "NNQT_question": "Give me all types of eating disorders.",
        "uid": "103",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all types of eating disorders.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279 wd:Q373822 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q131749",
            "http://www.wikidata.org/entity/Q209522",
            "http://www.wikidata.org/entity/Q331632",
            "http://www.wikidata.org/entity/Q357522",
            "http://www.wikidata.org/entity/Q492054",
            "http://www.wikidata.org/entity/Q559538",
            "http://www.wikidata.org/entity/Q567713",
            "http://www.wikidata.org/entity/Q653267",
            "http://www.wikidata.org/entity/Q929963",
            "http://www.wikidata.org/entity/Q1134891",
            "http://www.wikidata.org/entity/Q1334368",
            "http://www.wikidata.org/entity/Q2303219",
            "http://www.wikidata.org/entity/Q2742106",
            "http://www.wikidata.org/entity/Q3485506",
            "http://www.wikidata.org/entity/Q4358147",
            "http://www.wikidata.org/entity/Q5441238",
            "http://www.wikidata.org/entity/Q5588436",
            "http://www.wikidata.org/entity/Q7074872",
            "http://www.wikidata.org/entity/Q7850784",
            "http://www.wikidata.org/entity/Q11318376",
            "http://www.wikidata.org/entity/Q17104923",
            "http://www.wikidata.org/entity/Q56326859"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "anorexia nervosa",
            "Binge eating disorder",
            "overeating",
            "Adipsia",
            "eating disorder not otherwise specified",
            "night eating syndrome",
            "anorexia mirabilis",
            "polyphagia",
            "primary polydipsia",
            "pica",
            "orthorexia nervosa",
            "binge eating",
            "food addiction",
            "sitomania",
            "rumination disorder",
            "Feeding disorder",
            "Gourmand syndrome",
            "social stigma of obesity",
            "Tube dependency",
            "Chew and spit",
            "other specified feeding or eating disorder",
            "pregorexia"
        ]
    },
    {
        "NNQT_question": "Give me all books written by Danielle Steel.",
        "uid": "109",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all books written by Danielle Steel.",
        "sparql_wikidata": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q72653> . } ",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": []
    },
    {
        "NNQT_question": "Give me all libraries established earlier than 1400.",
        "uid": "113",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all libraries established earlier than 1400.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7075 ; wdt:P571 ?date . FILTER (YEAR(?date) < 1400 ) }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q2326916",
            "http://www.wikidata.org/entity/Q667615",
            "http://www.wikidata.org/entity/Q24101",
            "http://www.wikidata.org/entity/Q11680213",
            "http://www.wikidata.org/entity/Q5727966",
            "http://www.wikidata.org/entity/Q80943782"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Schaffhausen City Library",
            "Admont Abbey",
            "Jagiellonian Library",
            "Biblioteca de Montserrat",
            "Library of Pantainus",
            "Arxiu i Biblioteca de Poblet"
        ]
    },
    {
        "NNQT_question": "Show me all songs from Bruce Springsteen released between 1980 and 1990.",
        "uid": "136",
        "subgraph": "",
        "template_index": "",
        "question": "Show me all songs from Bruce Springsteen released between 1980 and 1990.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7366 ; wdt:P577 ?date ; wdt:P175 wd:Q1225 . BIND(YEAR(?date) as ?year) . FILTER(?year >= 1980 && ?year <= 1990) }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q522215",
            "http://www.wikidata.org/entity/Q613428",
            "http://www.wikidata.org/entity/Q2011701",
            "http://www.wikidata.org/entity/Q2406167",
            "http://www.wikidata.org/entity/Q3508168",
            "http://www.wikidata.org/entity/Q7207956"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Born in the U.S.A.",
            "Working on the Highway",
            "Darlington County",
            "The River",
            "Fire",
            "Point Blank"
        ]
    },
    {
        "NNQT_question": "Give me all B-sides of the Ramones.",
        "uid": "175",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all B-sides of the Ramones.",
        "sparql_wikidata": "PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { ?res wdt:P175 wd:Q483407 . ?res p:P1433 _:a ._:a pq:P2868 wd:Q13432985 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q91353165"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Havana Affair"
        ]
    },
    {
        "NNQT_question": "Is Darth Vader Luke\u2019s father?",
        "uid": "180",
        "subgraph": "",
        "template_index": "",
        "question": "Is Darth Vader Luke\u2019s father?",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12206942 wdt:P40 wd:Q51746 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            true
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "Give me all films produced by Steven Spielberg with a budget of at least $80 million.",
        "uid": "182",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all films produced by Steven Spielberg with a budget of at least $80 million.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P162 wd:Q8877 ; wdt:P31/wdt:P279* wd:Q11424 ; wdt:P2130 ?cost . FILTER(?cost > 80000000)}",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q3512046",
            "http://www.wikidata.org/entity/Q19689203",
            "http://www.wikidata.org/entity/Q22000542",
            "http://www.wikidata.org/entity/Q63643994"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Jurassic World",
            "The BFG",
            "Ready Player One",
            "West Side Story"
        ]
    },
    {
        "NNQT_question": "Is Cola a beverage?",
        "uid": "193",
        "subgraph": "",
        "template_index": "",
        "question": "Is Cola a beverage?",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q134041 wdt:P279+ wd:Q40050 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            true
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "Give me all launch pads operated by NASA.",
        "uid": "231",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all launch pads operated by NASA.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q194188 ; wdt:P137 wd:Q23548 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q845774",
            "http://www.wikidata.org/entity/Q48821"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Kennedy Space Center Launch Complex 39",
            "Kennedy Space Center"
        ]
    },
    {
        "NNQT_question": "List all the musicals with music by Elton John.",
        "uid": "249",
        "subgraph": "",
        "template_index": "",
        "question": "List all the musicals with music by Elton John.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q58483083 ; wdt:P86 wd:Q2808 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q403810",
            "http://www.wikidata.org/entity/Q3830942",
            "http://www.wikidata.org/entity/Q1195106",
            "http://www.wikidata.org/entity/Q7091479"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Aida",
            "Lestat",
            "The Lion King",
            "On the Record"
        ]
    },
    {
        "NNQT_question": "List the children of Margaret Thatcher.",
        "uid": "275",
        "subgraph": "",
        "template_index": "",
        "question": "List the children of Margaret Thatcher.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7416 wdt:P40 ?uri . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q713468",
            "http://www.wikidata.org/entity/Q2449855"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Mark Thatcher",
            "Carol Thatcher"
        ]
    },
    {
        "NNQT_question": "List all games by GMT.",
        "uid": "290",
        "subgraph": "",
        "template_index": "",
        "question": "List all games by GMT.",
        "sparql_wikidata": "PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11410 ; wdt:P123 wd:Q928726 . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [
            "http://www.wikidata.org/entity/Q44571846",
            "http://www.wikidata.org/entity/Q1115156",
            "http://www.wikidata.org/entity/Q4660797",
            "http://www.wikidata.org/entity/Q5412155",
            "http://www.wikidata.org/entity/Q6020459",
            "http://www.wikidata.org/entity/Q36899015",
            "http://www.wikidata.org/entity/Q44782145"
        ],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": [
            "Thunder Alley",
            "Commands & Colors: Ancients",
            "A World at War",
            "Europe Engulfed",
            "Reds!",
            "Dominant Species",
            "Labyrinth"
        ]
    },
    {
        "NNQT_question": "List all episodes of the first season of the HBO television series The Sopranos.",
        "uid": "331",
        "subgraph": "",
        "template_index": "",
        "question": "List all episodes of the first season of the HBO television series The Sopranos.",
        "sparql_wikidata": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q21191270> . ?uri <http://www.wikidata.org/prop/direct/P361> <http://www.wikidata.org/entity/Q5274359> } ",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": []
    },
    {
        "NNQT_question": "Show me the book that Muhammad Ali wrote.",
        "uid": "383",
        "subgraph": "",
        "template_index": "",
        "question": "Show me the book that Muhammad Ali wrote.",
        "sparql_wikidata": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q36107> . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": []
    },
    {
        "NNQT_question": "Give me all Canadian Grunge record labels.",
        "uid": "394",
        "subgraph": "",
        "template_index": "",
        "question": "Give me all Canadian Grunge record labels.",
        "sparql_wikidata": " SELECT ?s1 WHERE { ?s1  wdt:P136  <http://www.wikidata.org/entity/Q11365> . ?s1  wdt:P31  <http://www.wikidata.org/entity/Q18127> . ?s1  wdt:P17 <http://www.wikidata.org/entity/Q16> . }",
        "sparql_dbpedia18": "",
        "template": "",
        "answer": [],
        "template_id": "",
        "paraphrased_question": "",
        "simplified_query": "",
        "solved_answer": []
    }
]