[
    {
        "NNQT_question": "what is the {start time} for {La Plata} has {named after} as {Eva Per\u00f3n} ?",
        "uid": 8894,
        "subgraph": "statement_property",
        "template_index": 5339,
        "question": "When does La Plata?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q44059 p:P138 ?s . ?s ps:P138 wd:Q40933 . ?s pq:P580 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q44059> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P138> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q40933> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1952-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "La Plata is when?",
        "simplified_query": "SELECT ?z WHERE { ?y property:start_time ?z . ?y property:named_after resource:Eva_Per\u00f3n . resource:La_Plata property:named_after ?y }",
        "solved_answer": [
            "1952-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {Revised Hepburn romanization} for {Morning Musume} has {name in kana} as {\u30e2\u30fc\u30cb\u30f3\u30b0\u3080\u3059\u3081} ?",
        "uid": 7403,
        "subgraph": "statement_property",
        "template_index": 3848,
        "question": "What is the Revised Hepburn romanization for Morning Musume with its name in kana \u30e2\u30fc\u30cb\u30f3\u30b0\u3080\u3059\u3081?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q174291 p:P1814 ?s . ?s ps:P1814 ?x filter(contains(?x,'\u30e2\u30fc\u30cb\u30f3\u30b0\u3080\u3059\u3081')) . ?s pq:P2125 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q174291> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1814> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <\u30e2\u30fc\u30cb\u30f3\u30b0\u3080\u3059\u3081> .\n?statement <http://www.wikidata.org/entity/P2125> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "M\u014dningu Musume"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "How do you apply a Revised Hepburn romanization for Morning Musume with its name in kana...",
        "simplified_query": "SELECT ?e WHERE { resource:Morning_Musume property:name_in_kana ?z . ?z property:Revised_Hepburn_romanization ?e . FILTER ( CONTAINS ( ?q , '\u30e2\u30fc\u30cb\u30f3\u30b0\u3080\u3059\u3081' ) ) . ?z property:name_in_kana ?q }",
        "solved_answer": [
            "M\u014dningu Musume"
        ]
    },
    {
        "NNQT_question": "what is the {point in time} for {Tom\u00e1\u0161 Garrigue Masaryk} has {nominated for} as {Nobel Peace Prize} ?",
        "uid": 6554,
        "subgraph": "statement_property",
        "template_index": 2999,
        "question": "When was Tomas Garrigue masaryk nominated for Nobel peace prize award?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q78492 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P585 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q78492> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q35637> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1929-01-01T00:00:00Z",
            "1928-01-01T00:00:00Z",
            "1930-01-01T00:00:00Z",
            "1936-01-01T00:00:00Z",
            "1913-01-01T00:00:00Z",
            "1914-01-01T00:00:00Z",
            "1915-01-01T00:00:00Z",
            "1923-01-01T00:00:00Z",
            "1921-01-01T00:00:00Z",
            "1937-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "Tomas Garrique Masaryk nomination for the Nobel peace prize occured in what year?",
        "simplified_query": "SELECT ?f WHERE { ?q property:nominated_for resource:Nobel_Peace_Prize . ?q property:point_in_time ?f . resource:Tom\u00e1\u0161_Garrigue_Masaryk property:nominated_for ?q }",
        "solved_answer": [
            "1929-01-01T00:00:00Z",
            "1928-01-01T00:00:00Z",
            "1930-01-01T00:00:00Z",
            "1936-01-01T00:00:00Z",
            "1913-01-01T00:00:00Z",
            "1914-01-01T00:00:00Z",
            "1915-01-01T00:00:00Z",
            "1923-01-01T00:00:00Z",
            "1921-01-01T00:00:00Z",
            "1937-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {start time} for {Saint-\u00c9tienne} has {twinned administrative body} as {Fes} ?",
        "uid": 4806,
        "subgraph": "statement_property",
        "template_index": 1251,
        "question": "When was Saint-\u00c9tienne twinned with Fes?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q42716 p:P190 ?s . ?s ps:P190 wd:Q80985 . ?s pq:P580 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q42716> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q80985> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "2006-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "In what year did Saint-\u00c9tienne become coupled with Fes?",
        "simplified_query": "SELECT ?w WHERE { resource:Saint-\u00c9tienne property:twinned_administrative_body ?d . ?d property:twinned_administrative_body resource:Fez . ?d property:start_time ?w }",
        "solved_answer": [
            "2006-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {point in time} for {Thomas Hardy} has {nominated for} as {Nobel Prize in Literature} ?",
        "uid": 8354,
        "subgraph": "statement_property",
        "template_index": 4799,
        "question": "When was Thomas Hardy nominated for the Nobel Prize in Literature?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q132805 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q132805> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q37922> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1913-01-01T00:00:00Z",
            "1914-01-01T00:00:00Z",
            "1922-01-01T00:00:00Z",
            "1920-01-01T00:00:00Z",
            "1911-01-01T00:00:00Z",
            "1910-01-01T00:00:00Z",
            "1927-01-01T00:00:00Z",
            "1924-01-01T00:00:00Z",
            "1926-01-01T00:00:00Z",
            "1912-01-01T00:00:00Z",
            "1923-01-01T00:00:00Z",
            "1925-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "Thomas Hardy was nominated for the Nobel Prize in Literature in what year?",
        "simplified_query": "SELECT ?n WHERE { ?r property:nominated_for resource:Nobel_Prize_in_Literature . ?r property:point_in_time ?n . resource:Thomas_Hardy property:nominated_for ?r }",
        "solved_answer": [
            "1913-01-01T00:00:00Z",
            "1914-01-01T00:00:00Z",
            "1922-01-01T00:00:00Z",
            "1920-01-01T00:00:00Z",
            "1911-01-01T00:00:00Z",
            "1910-01-01T00:00:00Z",
            "1927-01-01T00:00:00Z",
            "1924-01-01T00:00:00Z",
            "1926-01-01T00:00:00Z",
            "1912-01-01T00:00:00Z",
            "1923-01-01T00:00:00Z",
            "1925-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {start time} for {PayPal} has {parent organization} as {eBay} ?",
        "uid": 8365,
        "subgraph": "statement_property",
        "template_index": 4810,
        "question": "When did eBay take over as the parent organization for PayPal?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q483959 p:P749 ?s . ?s ps:P749 wd:Q58024 . ?s pq:P580 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q483959> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P749> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q58024> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "2002-10-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "When did eBay become the parent organization for PayPal?",
        "simplified_query": "SELECT ?d WHERE { ?s property:parent_organization resource:eBay . ?s property:start_time ?d . resource:PayPal property:parent_organization ?s }",
        "solved_answer": [
            "2002-10-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {point in time} for {Linus Pauling} has {nominated for} as {Nobel Prize in Chemistry} ?",
        "uid": 8340,
        "subgraph": "statement_property",
        "template_index": 4785,
        "question": "when was Linus Pauling nominated for a Nobel Prize in Chemistry",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q48983 p:P1411 ?s . ?s ps:P1411 wd:Q44585 . ?s pq:P585 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q48983> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q44585> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1941-01-01T00:00:00Z",
            "1946-01-01T00:00:00Z",
            "1943-01-01T00:00:00Z",
            "1955-01-01T00:00:00Z",
            "1940-01-01T00:00:00Z",
            "1949-01-01T00:00:00Z",
            "1944-01-01T00:00:00Z",
            "1948-01-01T00:00:00Z",
            "1954-01-01T00:00:00Z",
            "1953-01-01T00:00:00Z",
            "1950-01-01T00:00:00Z",
            "1952-01-01T00:00:00Z",
            "1951-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "The nomination for a Nobel Prize in Chemistry was received by Linus Pauling on which date?",
        "simplified_query": "SELECT ?q WHERE { ?v property:point_in_time ?q . ?v property:nominated_for resource:Nobel_Prize_in_Chemistry . resource:Linus_Pauling property:nominated_for ?v }",
        "solved_answer": [
            "1941-01-01T00:00:00Z",
            "1946-01-01T00:00:00Z",
            "1943-01-01T00:00:00Z",
            "1955-01-01T00:00:00Z",
            "1940-01-01T00:00:00Z",
            "1949-01-01T00:00:00Z",
            "1944-01-01T00:00:00Z",
            "1948-01-01T00:00:00Z",
            "1954-01-01T00:00:00Z",
            "1953-01-01T00:00:00Z",
            "1950-01-01T00:00:00Z",
            "1952-01-01T00:00:00Z",
            "1951-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {end time} for {Nazareth} has {country} as {Ottoman Empire} ?",
        "uid": 7369,
        "subgraph": "statement_property",
        "template_index": 3814,
        "question": "When did the Ottoman Empire lose control over Nazareth?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q430776 p:P17 ?s . ?s ps:P17 wd:Q12560 . ?s pq:P582 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q430776> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P17> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q12560> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1917-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "When did Nazareth break away from the Ottoman Empire?",
        "simplified_query": "SELECT ?a WHERE { resource:Nazareth property:country ?y . ?y property:end_time ?a . ?y property:country resource:Ottoman_Empire }",
        "solved_answer": [
            "1917-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {start time} for {Innsbruck} has {twinned administrative body} as {Krak\u00f3w} ?",
        "uid": 4082,
        "subgraph": "statement_property",
        "template_index": 527,
        "question": "When was Innsbruck twinned with Krak\u00f3w?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q1735 p:P190 ?s . ?s ps:P190 wd:Q31487 . ?s pq:P580 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1735> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q31487> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1998-08-19T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "When was Innsbruck paired with Krak\u00f3w?",
        "simplified_query": "SELECT ?r WHERE { ?m property:start_time ?r . resource:Innsbruck property:twinned_administrative_body ?m . ?m property:twinned_administrative_body resource:Krak\u00f3w }",
        "solved_answer": [
            "1998-08-19T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {point in time} for {Tallahassee} has {population} as {181376} ?",
        "uid": 8225,
        "subgraph": "statement_property",
        "template_index": 4670,
        "question": "When did Tallahassee have a population of 181376?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q37043 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'181376')) . ?s pq:P585 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q37043> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <181376> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "2010-01-01T00:00:00Z",
            "2010-04-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "When did Tallahassee grow to 181376 people?",
        "simplified_query": "SELECT ?n WHERE { ?t property:population ?f . ?t property:point_in_time ?n . FILTER ( CONTAINS ( ?f , '181376' ) ) . resource:Tallahassee property:population ?t }",
        "solved_answer": [
            "2010-01-01T00:00:00Z",
            "2010-04-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {point in time} for {Dakahlia Governorate} has {population} as {6492381} ?",
        "uid": 6939,
        "subgraph": "statement_property",
        "template_index": 3384,
        "question": "When did the Dakahlia Governorate have the population 6492381?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q31068 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'6492381')) . ?s pq:P585 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q31068> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <6492381> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "2017-03-28T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "The population of 6492381 in Dakahlia Governorate happened when?",
        "simplified_query": "SELECT ?q WHERE { ?y property:population ?g . resource:Dakahlia_Governorate property:population ?y . FILTER ( ?g = 6492381 ) . ?y property:point_in_time ?q }",
        "solved_answer": [
            "2017-03-28T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {end time} for {Ptolemy I Soter} has {noble title} as {pharaoh} ?",
        "uid": 5123,
        "subgraph": "statement_property",
        "template_index": 1568,
        "question": "When was the end of Ptolemy I Soter's reign as pharaoh?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q168261 p:P97 ?s . ?s ps:P97 wd:Q37110 . ?s pq:P582 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q168261> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P97> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q37110> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "-0282-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "What year did Ptolemy I Soter's rule expire?",
        "simplified_query": "SELECT ?g WHERE { ?j property:end_time ?g . ?j property:noble_title resource:Pharaoh . resource:Ptolemy_I_Soter property:noble_title ?j }",
        "solved_answer": [
            "-0282-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {statement is subject of} for {Kuwait} has {diplomatic relation} as {Mexico} ?",
        "uid": 8856,
        "subgraph": "statement_property",
        "template_index": 5301,
        "question": "what is the statement for subject of Kuwait which has diplomatic relation as Mexico?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q817 p:P530 ?s . ?s ps:P530 wd:Q96 . ?s pq:P805 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q817> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P530> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q96> .\n?statement <http://www.wikidata.org/entity/P805> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "http://www.wikidata.org/entity/Q28155563"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "what is the explanation for subject of Kuwait which has conciliatory connection as Mexico?",
        "simplified_query": "SELECT ?n WHERE { resource:Kuwait property:diplomatic_relation ?n . ?n property:diplomatic_relation resource:Mexico . ?n property:statement_is_subject_of ?n }",
        "solved_answer": [
            "Kuwait\u2013Mexico relations"
        ]
    },
    {
        "NNQT_question": "what is the {start time} for {\u00c6thelred the Unready} has {position held} as {monarch of England} ?",
        "uid": 6642,
        "subgraph": "statement_property",
        "template_index": 3087,
        "question": "what is the start time for Aethelred the unready has position held  monarch of England?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q183499 p:P39 ?s . ?s ps:P39 wd:Q18810062 . ?s pq:P580 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q183499> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P39> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q18810062> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "0978-01-01T00:00:00Z",
            "1014-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "When did Aethrlred the Unread start his position as the Monarch of England?",
        "simplified_query": "SELECT ?b WHERE { resource:\u00c6thelred_the_Unready property:position_held ?f . ?f property:position_held resource:monarch_of_England . ?f property:start_time ?b }",
        "solved_answer": [
            "0978-01-01T00:00:00Z",
            "1014-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {start time} for {Paul Erd\u0151s} has {residence} as {Manchester} ?",
        "uid": 9021,
        "subgraph": "statement_property",
        "template_index": 5466,
        "question": "When did Paul Erd\u0151s live in Manchester?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q173746 p:P551 ?s . ?s ps:P551 wd:Q18125 . ?s pq:P580 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q173746> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P551> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q18125> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1934-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "Paul Erdos lived in Manchester during what years?",
        "simplified_query": "SELECT ?y WHERE { resource:Paul_Erd\u0151s property:residence ?y . ?y property:residence resource:Manchester . ?y property:start_time ?y }",
        "solved_answer": [
            "1934-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {end time} for {Ottoman Empire} has {capital} as {Bursa} ?",
        "uid": 5090,
        "subgraph": "statement_property",
        "template_index": 1535,
        "question": "When was did Bursa cease being the capital of the Ottoman Empire?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q12560 p:P36 ?s . ?s ps:P36 wd:Q40738 . ?s pq:P582 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q12560> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P36> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q40738> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1365-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "When was Bursa no longer the capital of the Ottoman Empire?",
        "simplified_query": "SELECT ?y WHERE { ?y property:capital resource:Bursa . ?y property:end_time ?y . resource:Ottoman_Empire property:capital ?y }",
        "solved_answer": [
            "1365-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {Wylie transliteration} for {Abhidharma} has {native label} as {\u0f58\u0f5b\u0f7c\u0f51\u0f0b\u0f55\u0f74\u0f42} ?",
        "uid": 4411,
        "subgraph": "statement_property",
        "template_index": 856,
        "question": "What is the Wylie transliteration for Abhidharma, that is labelled as \u0f58\u0f5b\u0f7c\u0f51\u0f0b\u0f55\u0f74\u0f42?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q612405 p:P1705 ?s . ?s ps:P1705 ?x filter(contains(?x,'\u0f58\u0f5b\u0f7c\u0f51\u0f0b\u0f55\u0f74\u0f42')) . ?s pq:P4187 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q612405> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1705> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <\u0f58\u0f5b\u0f7c\u0f51\u0f0b\u0f55\u0f74\u0f42> .\n?statement <http://www.wikidata.org/entity/P4187> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "mdzod phug"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "Labelled as \u0f58\u0f5b\u0f7c\u0f51\u0f0b\u0f55\u0f74\u0f42, what is the Wylie transliteration for Abhidharma?",
        "simplified_query": "SELECT ?k WHERE { FILTER ( CONTAINS ( ?n , '\u0f58\u0f5b\u0f7c\u0f51\u0f0b\u0f55\u0f74\u0f42' ) ) . ?u property:native_label ?n . ?u property:Wylie_transliteration ?k . resource:Abhidharma property:native_label ?u }",
        "solved_answer": [
            "mdzod phug"
        ]
    },
    {
        "NNQT_question": "what is the {country} for {John Barrymore} has {place of death} as {Los Angeles} ?",
        "uid": 5162,
        "subgraph": "statement_property",
        "template_index": 1607,
        "question": "What country did John Barrymore die in if the city was Los Angeles?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q95034 p:P20 ?s . ?s ps:P20 wd:Q65 . ?s pq:P17 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q95034> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q65> .\n?statement <http://www.wikidata.org/entity/P17> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "http://www.wikidata.org/entity/Q30"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "If John Barrymore died in Los Angeles, what country did he die in?",
        "simplified_query": "SELECT ?a WHERE { ?h property:country ?a . resource:John_Barrymore property:place_of_death ?h . ?h property:place_of_death resource:Los_Angeles }",
        "solved_answer": [
            "United States of America"
        ]
    },
    {
        "NNQT_question": "what is the {point in time} for {Special Region of Yogyakarta} has {population} as {3542078} ?",
        "uid": 4636,
        "subgraph": "statement_property",
        "template_index": 1081,
        "question": "When was the population of Special Region of Yogyakarta 3,542,078?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q3741 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'3542078')) . ?s pq:P585 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3741> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <3542078> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "2015-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "The Special Region of Yogyakarta had a population of 3,542,078 during what years?",
        "simplified_query": "SELECT ?p WHERE { FILTER ( CONTAINS ( ?l , '3542078' ) ) . ?s property:point_in_time ?p . ?s property:population ?l . resource:Yogyakarta property:population ?s }",
        "solved_answer": [
            "2015-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {platform} for {Doom} has {publication date} as {1996-0-0} ?",
        "uid": 4775,
        "subgraph": "statement_property",
        "template_index": 1220,
        "question": "What platform was Doom released on in 1996?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q189784 p:P577 ?s . ?s ps:P577 ?x filter(contains(YEAR(?x),'1996')) . ?s pq:P400 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q189784> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P577> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1996-0-0> .\n?statement <http://www.wikidata.org/entity/P400> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "http://www.wikidata.org/entity/Q183259",
            "http://www.wikidata.org/entity/Q229429",
            "http://www.wikidata.org/entity/Q10677",
            "http://www.wikidata.org/entity/Q1406"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "doom came out on what platform in 1996?",
        "simplified_query": "SELECT ?m WHERE { FILTER ( CONTAINS ( YEAR ( ?c ) , '1996' ) ) . resource:Doom property:publication_date ?t . ?t property:platform ?m . ?t property:publication_date ?c }",
        "solved_answer": [
            "Super Nintendo Entertainment System",
            "3DO Interactive Multiplayer",
            "PlayStation",
            "Microsoft Windows"
        ]
    }
]