[
    {
        "NNQT_question": "What is {makes use of} of {sport played} of {Mariano Rivera} ?",
        "uid": 15361,
        "subgraph": "right-subgraph",
        "template_index": 1216,
        "question": "How does Mariano Rivera make use of the sport he plays?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q382303 wdt:P641 ?X . ?X wdt:P2283 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q382303> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P641>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2283> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q791187",
            "http://www.wikidata.org/entity/Q809889",
            "http://www.wikidata.org/entity/Q809910"
        ],
        "template_id": "2",
        "paraphrased_question": "How does Mariano Rivera make utilize of the wear he plays?",
        "simplified_query": "SELECT ?a WHERE { resource:Mariano_Rivera property:sport ?t . ?t property:uses ?a }",
        "solved_answer": [
            "baseball",
            "baseball field",
            "baseball bat"
        ]
    },
    {
        "NNQT_question": "What is {bordered by} of {is in the administrative unit} of {Vancouver Island} ?",
        "uid": 14645,
        "subgraph": "right-subgraph",
        "template_index": 612,
        "question": "What is Vancouver Island bordered by in administrative units?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q170479 wdt:P131 ?X . ?X wdt:P47 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q170479> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P131>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P47> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q797",
            "http://www.wikidata.org/entity/Q1212",
            "http://www.wikidata.org/entity/Q1221",
            "http://www.wikidata.org/entity/Q1223",
            "http://www.wikidata.org/entity/Q1951",
            "http://www.wikidata.org/entity/Q2007",
            "http://www.wikidata.org/entity/Q2009"
        ],
        "template_id": "2",
        "paraphrased_question": "What is Vancouver Island bordered by in regulatory units?",
        "simplified_query": "SELECT ?r WHERE { ?i property:shares_border_with ?r . resource:Vancouver_Island property:located_in_the_administrative_territorial_entity ?i }",
        "solved_answer": [
            "Alaska",
            "Montana",
            "Idaho",
            "Washington",
            "Alberta",
            "Northwest Territories",
            "Yukon"
        ]
    },
    {
        "NNQT_question": "What is {human population} of {originates} of {Mind} ?",
        "uid": 14709,
        "subgraph": "right-subgraph",
        "template_index": 227,
        "question": "what is the human population from the originates of Mind?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1936338 wdt:P495 ?X . ?X wdt:P1082 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1936338> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P495>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "67326569"
        ],
        "template_id": "2",
        "paraphrased_question": "what is the human populace from the begins of Mind?",
        "simplified_query": "SELECT ?t WHERE { resource:Mind property:country_of_origin ?b . ?b property:population ?t }",
        "solved_answer": [
            "67326569"
        ]
    },
    {
        "NNQT_question": "What is {formed in} of {burial place} of {William IV, Prince of Orange} ?",
        "uid": 17474,
        "subgraph": "right-subgraph",
        "template_index": 1659,
        "question": "What is formed in burial place of William IV, Prince of Orange ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q380949 wdt:P119 ?X . ?X wdt:P571 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q380949> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P119>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P571> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "1496-01-01T00:00:00Z"
        ],
        "template_id": "2",
        "paraphrased_question": "What is shaped in burial put of William IV, Sovereign of Orange ?",
        "simplified_query": "SELECT ?w WHERE { ?a property:inception ?w . resource:William_IV,_Prince_of_Orange property:place_of_burial ?a }",
        "solved_answer": [
            "1496-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "Give me {paradox} that starts with {'u'}",
        "uid": 24511,
        "subgraph": "string matching simple contains word",
        "template_index": 2420,
        "question": "What are the paradox which start with the letter u",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q483372 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q483372>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q1142663"
        ],
        "template_id": "2",
        "paraphrased_question": "What are the conundrum which begin with the letter u",
        "simplified_query": "SELECT DISTINCT ?o WHERE { ?o rdf:type ontology:paradox . FILTER ( STRSTARTS ( LCASE ( ?o ) , 'u' ) ) }",
        "solved_answer": [
            "unexpected hanging paradox"
        ]
    },
    {
        "NNQT_question": "What is {instrument played} of {plays} of {Darrell Pace} ?",
        "uid": 15506,
        "subgraph": "right-subgraph",
        "template_index": 1061,
        "question": "What instrument does Darrell Pace play?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1166597 wdt:P641 ?X . ?X wdt:P2283 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1166597> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P641>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2283> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q45922",
            "http://www.wikidata.org/entity/Q46311",
            "http://www.wikidata.org/entity/Q222560"
        ],
        "template_id": "2",
        "paraphrased_question": "Darrell Pace plays what instrument?",
        "simplified_query": "SELECT ?h WHERE { resource:Darrell_Pace property:sport ?s . ?s property:uses ?h }",
        "solved_answer": [
            "arrow",
            "bow",
            "quiver"
        ]
    },
    {
        "NNQT_question": "Did {Venice} {twinned administrative body} {Sarajevo} and {Tallinn} ?",
        "uid": 904,
        "subgraph": "boolean double one_hop right subgraph",
        "template_index": 404,
        "question": "Was Venice administratively intertwinned with Sarajevo and Tallinn?",
        "sparql_wikidata": "ASK WHERE { wd:Q641 wdt:P190 wd:Q11194 . wd:Q641 wdt:P190 wd:Q1770 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q641> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q11194>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q641> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1770>. } ",
        "template": "Ask (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            true
        ],
        "template_id": "2",
        "paraphrased_question": "Is it true that Venice was administratively intertwinned with both Tallinn and Sarajevo?",
        "simplified_query": "ASK WHERE { resource:Venice property:twinned_administrative_body resource:Tallinn . resource:Venice property:twinned_administrative_body resource:Sarajevo }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "What is {built out of} of {operates} of {Air China} ?",
        "uid": 17919,
        "subgraph": "right-subgraph",
        "template_index": 2141,
        "question": "What does Air China build?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q51747 wdt:P121 ?X . ?X wdt:P186 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q51747> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P121>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P186> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q181790",
            "http://www.wikidata.org/entity/Q716",
            "http://www.wikidata.org/entity/Q11427",
            "http://www.wikidata.org/entity/Q447440",
            "http://www.wikidata.org/entity/Q663"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the construction of Air China?",
        "simplified_query": "SELECT ?v WHERE { resource:Air_China property:item_operated ?b . ?b property:made_from_material ?v }",
        "solved_answer": [
            "composite material",
            "titanium",
            "steel",
            "Al-Li",
            "aluminium"
        ]
    },
    {
        "NNQT_question": "What is {type of government} of {state} of {Norfolk} ?",
        "uid": 14621,
        "subgraph": "right-subgraph",
        "template_index": 1074,
        "question": "What is the type of government in the state of Norfolk?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q23109 wdt:P17 ?X . ?X wdt:P122 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q23109> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P17>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P122> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q41614"
        ],
        "template_id": "2",
        "paraphrased_question": "The state of Norfolk has what type of government?",
        "simplified_query": "SELECT ?w WHERE { resource:Norfolk property:country ?k . ?k property:basic_form_of_government ?w }",
        "solved_answer": [
            "constitutional monarchy"
        ]
    },
    {
        "NNQT_question": "What is {number of out of school children} of {planetary system} of {Moon} ?",
        "uid": 15946,
        "subgraph": "right-subgraph",
        "template_index": 459,
        "question": "What is the number of out of school children in the planetary system of the Moon?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q405 wdt:P397 ?X . ?X wdt:P2573 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q405> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P397>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2573> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "263000000",
            "264000000",
            "265000000",
            "266000000",
            "274000000",
            "281000000",
            "291000000",
            "294000000",
            "305000000",
            "324000000",
            "333000000",
            "336000000",
            "343000000",
            "360000000",
            "371000000",
            "374000000",
            "379000000"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the variety of out of school youngsters in the planetary gadget of the Moon?",
        "simplified_query": "SELECT ?k WHERE { ?e property:number_of_out-of-school_children ?k . resource:Moon property:parent_astronomical_body ?e }",
        "solved_answer": [
            "263000000",
            "264000000",
            "265000000",
            "266000000",
            "274000000",
            "281000000",
            "291000000",
            "294000000",
            "305000000",
            "324000000",
            "333000000",
            "336000000",
            "343000000",
            "360000000",
            "371000000",
            "374000000",
            "379000000"
        ]
    },
    {
        "NNQT_question": "What is {prime minister} of {admin HQ} of {International Ice Hockey Federation} ?",
        "uid": 16247,
        "subgraph": "right-subgraph",
        "template_index": 902,
        "question": "Who is the prime minister at admin HQ of the International Ice Hockey Federation?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q190173 wdt:P159 ?X . ?X wdt:P6 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q190173> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P159>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P6> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q123363"
        ],
        "template_id": "2",
        "paraphrased_question": "Who is prime minister of IIHF HQ?",
        "simplified_query": "SELECT ?p WHERE { ?c property:head_of_government ?p . resource:International_Ice_Hockey_Federation property:headquarters_location ?c }",
        "solved_answer": [
            "Corine Mauch"
        ]
    },
    {
        "NNQT_question": "Give me {steroid hormone} that starts with {'t'}",
        "uid": 24028,
        "subgraph": "string matching simple contains word",
        "template_index": 365,
        "question": "tell me steroid hormone that starts with t",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q422137 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q422137>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q28132025",
            "http://www.wikidata.org/entity/Q28131923",
            "http://www.wikidata.org/entity/Q28132024",
            "http://www.wikidata.org/entity/Q28132037",
            "http://www.wikidata.org/entity/Q28132034"
        ],
        "template_id": "2",
        "paraphrased_question": "let me know steroid hormone that begins with t",
        "simplified_query": "SELECT DISTINCT ?w WHERE { FILTER ( STRSTARTS ( LCASE ( ?w ) , 't' ) ) . ?w rdf:type ontology:steroid_hormone }",
        "solved_answer": [
            "Testosterone isovalerate",
            "Testosterone hexyloxyphenylpropionate",
            "Testosterone phenylbutyrate",
            "testosterone acetate propionate",
            "Testosterone diacetate"
        ]
    },
    {
        "NNQT_question": "What is {employment} of {spouses} of {Jussi Bj\u00f6rling} ?",
        "uid": 16150,
        "subgraph": "right-subgraph",
        "template_index": 264,
        "question": "What kind of employment do the spouses of Jussi Bj\u00f6rling do?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q56157 wdt:P26 ?X . ?X wdt:P106 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q56157> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q33999",
            "http://www.wikidata.org/entity/Q2865819"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the job of Jussi Bj\u00f6rling's  spouse?",
        "simplified_query": "SELECT ?e WHERE { ?c property:occupation ?e . resource:Jussi_Bj\u00f6rling property:spouse ?c }",
        "solved_answer": [
            "actor",
            "opera singer"
        ]
    },
    {
        "NNQT_question": "Give me {writing system} that starts with {'w'}",
        "uid": 24323,
        "subgraph": "string matching simple contains word",
        "template_index": 1657,
        "question": "What are the writing system which start with the letter W",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8192 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q8192>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q115408273",
            "http://www.wikidata.org/entity/Q33713728",
            "http://www.wikidata.org/entity/Q844833"
        ],
        "template_id": "2",
        "paraphrased_question": "What are the composing framework which begin with the letter W",
        "simplified_query": "SELECT DISTINCT ?w WHERE { ?w rdf:type ontology:writing_system . FILTER ( STRSTARTS ( LCASE ( ?w ) , 'w' ) ) }",
        "solved_answer": [
            "Writing system of Mienic languages",
            "Wancho",
            "Wylie transliteration"
        ]
    },
    {
        "NNQT_question": "Give me {doctrine} that starts with {'t'}",
        "uid": 24654,
        "subgraph": "string matching simple contains word",
        "template_index": 2399,
        "question": "which doctrine starts with the letter t",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q117850 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q117850>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q288205",
            "http://www.wikidata.org/entity/Q7691336",
            "http://www.wikidata.org/entity/Q16210828",
            "http://www.wikidata.org/entity/Q7751242",
            "http://www.wikidata.org/entity/Q7687188",
            "http://www.wikidata.org/entity/Q498382",
            "http://www.wikidata.org/entity/Q2478791",
            "http://www.wikidata.org/entity/Q2451408"
        ],
        "template_id": "2",
        "paraphrased_question": "which tenet begins with the letter t",
        "simplified_query": "SELECT DISTINCT ?p WHERE { FILTER ( STRSTARTS ( LCASE ( ?p ) , 't' ) ) . ?p rdf:type ontology:doctrine }",
        "solved_answer": [
            "Two Whatevers",
            "teachings of the B\u00e1b",
            "The Hillary Doctrine",
            "The Michael Teachings",
            "tashbih",
            "theistic evolution",
            "total depravity",
            "Trenchard doctrine"
        ]
    },
    {
        "NNQT_question": "What is {principle office} of {label} of {Girls' Generation} ?",
        "uid": 17205,
        "subgraph": "right-subgraph",
        "template_index": 163,
        "question": "Is principle office Girls' Generation new label?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q20153 wdt:P264 ?X . ?X wdt:P159 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q20153> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P264>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P159> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q2681469",
            "http://www.wikidata.org/entity/Q193638"
        ],
        "template_id": "2",
        "paraphrased_question": "Is the Generation New Label of Girls ' Principal Office?",
        "simplified_query": "SELECT ?r WHERE { resource:Girls'_Generation property:record_label ?e . ?e property:headquarters_location ?r }",
        "solved_answer": [
            "Seongsu-dong",
            "Shibuya-ku"
        ]
    },
    {
        "NNQT_question": "What is {style of architecture} of {correspondence at} of {Geraldine Page} ?",
        "uid": 16588,
        "subgraph": "right-subgraph",
        "template_index": 2838,
        "question": "What style of architecture is Geraldine Page?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q228650 wdt:P485 ?X . ?X wdt:P149 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q228650> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P485>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P149> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q245188"
        ],
        "template_id": "2",
        "paraphrased_question": "What is Geraldine Page's architectural style?",
        "simplified_query": "SELECT ?t WHERE { resource:Geraldine_Page property:archives_at ?n . ?n property:architectural_style ?t }",
        "solved_answer": [
            "modern architecture"
        ]
    },
    {
        "NNQT_question": "What is {chef-lieu of} of {chef-lieu} of {Deccan sultanates} ?",
        "uid": 16132,
        "subgraph": "right-subgraph",
        "template_index": 114,
        "question": "Who is the chef-lieu of the Deccan sultanates?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1183649 wdt:P36 ?X . ?X wdt:P1376 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1183649> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P36>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1376> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q400998",
            "http://www.wikidata.org/entity/Q401744",
            "http://www.wikidata.org/entity/Q1183649"
        ],
        "template_id": "2",
        "paraphrased_question": "Who is the chef-lieu of the Deccan sultanates?",
        "simplified_query": "SELECT ?h WHERE { ?n property:capital_of ?h . resource:Deccan_sultanates property:capital ?n }",
        "solved_answer": [
            "Ahmadnagar Sultanate",
            "Ahilyanagar district",
            "Deccan sultanates"
        ]
    },
    {
        "NNQT_question": "What is {year established} of {developed by} of {Grand Theft Auto} ?",
        "uid": 16042,
        "subgraph": "right-subgraph",
        "template_index": 2608,
        "question": "In what year was Grand Theft Auto developed?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q132730 wdt:P178 ?X . ?X wdt:P571 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q132730> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P178>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P571> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "1984-01-01T00:00:00Z",
            "1997-01-01T00:00:00Z",
            "1992-01-01T00:00:00Z",
            "1980-01-01T00:00:00Z"
        ],
        "template_id": "2",
        "paraphrased_question": "In what year did they develop Grand Theft Auto?",
        "simplified_query": "SELECT ?t WHERE { resource:Grand_Theft_Auto property:developer ?k . ?k property:inception ?t }",
        "solved_answer": [
            "1984-01-01T00:00:00Z",
            "1997-01-01T00:00:00Z",
            "1992-01-01T00:00:00Z",
            "1980-01-01T00:00:00Z"
        ]
    }
]