[
    {
        "NNQT_question": "What is {chronology of topic} of {continent} of {Western Asia} ?",
        "uid": 15319,
        "subgraph": "right-subgraph",
        "template_index": 311,
        "question": "who chronology of topic  of continent of western asia?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q27293 wdt:P30 ?X . ?X wdt:P2184 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q27293> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P30>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2184> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q627531"
        ],
        "template_id": "2",
        "paraphrased_question": "who chronology of point of landmass of western asia?",
        "simplified_query": "SELECT ?n WHERE { resource:Western_Asia property:continent ?j . ?j property:history_of_topic ?n }",
        "solved_answer": [
            "history of Asia"
        ]
    },
    {
        "NNQT_question": "What is {notable work} of {Christopher Hitchens} and {publisher}",
        "uid": 11278,
        "subgraph": [],
        "template_index": 580,
        "question": "Tell me the most notable work of Christopher Hitchens and also the publisher.",
        "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P123 ?value1 . }",
        "sparql_dbpedia18": "select distinct ?dataprop1 ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q49081> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P800> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?statement <http://www.wikidata.org/entity/P580> ?dataprop1 . } ",
        "template": [],
        "answer": [
            "http://www.wikidata.org/entity/Q1567078",
            "http://www.wikidata.org/entity/Q24596",
            "http://www.wikidata.org/entity/Q4010248",
            "http://www.wikidata.org/entity/Q7044696",
            "http://www.wikidata.org/entity/Q6914395",
            "http://www.wikidata.org/entity/Q4034881",
            "http://www.wikidata.org/entity/Q3237057",
            "http://www.wikidata.org/entity/Q2699045",
            "http://www.wikidata.org/entity/Q3138625"
        ],
        "template_id": "3",
        "paraphrased_question": "Tell me the most high-quality work of Christopher Hitchens and additionally the publisher.",
        "simplified_query": "SELECT ?j ?e WHERE { resource:Christopher_Hitchens property:notable_work ?m . ?m property:publisher ?j . . ?m property:notable_work ?e }",
        "solved_answer": [
            "Hachette Book Group",
            "God Is Not Great",
            "Verso Books",
            "No One Left to Lie To",
            "Mortality",
            "Basic Books",
            "Letters to a Young Contrarian",
            "The Missionary Position: Mother Teresa in Theory and Practice",
            "Hitch-22"
        ]
    },
    {
        "NNQT_question": "Does the {PPP GDP per capita} of the {Lithuania} {less than} {22148.8}",
        "uid": 18025,
        "subgraph": "boolean with filter",
        "template_index": 43,
        "question": "Is the PPP GDP per capita of Lithuania less than 22148.8",
        "sparql_wikidata": "ASK WHERE { wd:Q37 wdt:P2299 ?obj filter(?obj < 22148.8) } ",
        "sparql_dbpedia18": "ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q37> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2299>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj. filter(?obj < 22148.8) }",
        "template": "ASK ?sbj ?pred ?obj filter ?obj = num",
        "answer": [
            false
        ],
        "template_id": "3",
        "paraphrased_question": "Is the PPP GDP per capita of Lithuania less than 22148.8",
        "simplified_query": "ASK WHERE { FILTER ( ?z < 22148.8 ) . resource:Lithuania property:PPP_GDP_per_capita ?z }",
        "solved_answer": [
            false
        ]
    },
    {
        "NNQT_question": "What is {noble title} of {Louis the Pious} and {followed by}",
        "uid": 11197,
        "subgraph": [],
        "template_index": 423,
        "question": "What is the royal title of Louis the Pious and who followed his reign.",
        "sparql_wikidata": "SELECT ?value1 ?obj WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P156 ?value1 . }",
        "sparql_dbpedia18": "select distinct ?dataprop1 ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q43974> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P97> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?statement <http://www.wikidata.org/entity/P580> ?dataprop1 . } ",
        "template": [],
        "answer": [
            "http://www.wikidata.org/entity/Q23931012",
            "http://www.wikidata.org/entity/Q333356",
            "http://www.wikidata.org/entity/Q271148",
            "http://www.wikidata.org/entity/Q150735",
            "http://www.wikidata.org/entity/Q22923081",
            "http://www.wikidata.org/entity/Q71231",
            "http://www.wikidata.org/entity/Q152463",
            "http://www.wikidata.org/entity/Q23906200"
        ],
        "template_id": "3",
        "paraphrased_question": "What is Louis the Pious's royal title and who followed his reign.",
        "simplified_query": "SELECT ?j ?t WHERE { resource:Louis_the_Pious property:noble_title ?h . ?h property:followed_by ?j . . ?h property:noble_title ?t }",
        "solved_answer": [
            "king of Aquitaine",
            "Pepin I of Aquitaine",
            "monarch of Italy",
            "Lothair I",
            "king of Franks",
            "Charles the Bald",
            "Louis the German",
            "emperor of the Occident"
        ]
    },
    {
        "NNQT_question": "Does the {number of out-of-school children} of the {Earth} {equals} {411600000.0}",
        "uid": 18060,
        "subgraph": "boolean with filter",
        "template_index": 78,
        "question": "Are there 411600000.0 children on Earth out of school",
        "sparql_wikidata": "ASK WHERE { wd:Q2 wdt:P2573 ?obj filter(?obj = 411600000.0) } ",
        "sparql_dbpedia18": "ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2573>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj. filter(?obj = 411600000.0) }",
        "template": "ASK ?sbj ?pred ?obj filter ?obj = num",
        "answer": [
            false
        ],
        "template_id": "3",
        "paraphrased_question": "Are there 411600000.0 children on Soil out of school",
        "simplified_query": "ASK WHERE { FILTER ( ?s = 411600000.0 ) . resource:Earth property:number_of_out-of-school_children ?s }",
        "solved_answer": [
            false
        ]
    },
    {
        "NNQT_question": "Give me {gas giant} that {child astronomical body} {Enceladus} and which that starts with {'s'}",
        "uid": 25377,
        "subgraph": "string matching type + relation contains word",
        "template_index": 1162,
        "question": "What what is gas giant child astronomical body by Enceladus and also which starts with letter s",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q121750 . ?sbj wdt:P398 wd:Q3303 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q121750>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P398> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3303>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q193"
        ],
        "template_id": "4",
        "paraphrased_question": "What what is gas giant infant astronomical body by using Enceladus and additionally which starts with letter s",
        "simplified_query": "SELECT DISTINCT ?v WHERE { FILTER ( STRSTARTS ( LCASE ( ?v ) , 's' ) ) . ?v rdf:type ontology:gas_giant . ?v property:child_astronomical_body resource:Enceladus }",
        "solved_answer": [
            "Saturn"
        ]
    },
    {
        "NNQT_question": "Give me {mantra} that {facet of} {Hinduism} and which that starts with {'g'}",
        "uid": 25676,
        "subgraph": "string matching type + relation contains word",
        "template_index": 219,
        "question": "WHICH IS THE MANTRA THAT IS THE FACET OF HINDUISM AND WHICH STARTS WITH G",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131510 . ?sbj wdt:P1269 wd:Q9089 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q131510>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1269> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q9089>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q728880"
        ],
        "template_id": "4",
        "paraphrased_question": "WHICH IS THE MANTRA THAT IS THE FACET OF HINDUISM AND WHICH STARTS WITH G",
        "simplified_query": "SELECT DISTINCT ?d WHERE { FILTER ( STRSTARTS ( LCASE ( ?d ) , 'g' ) ) . ?d property:facet_of resource:Hinduism . ?d rdf:type ontology:mantra }",
        "solved_answer": [
            "Gayatri Mantra"
        ]
    },
    {
        "NNQT_question": "Give me {province of China} that {capital} {Chengdu} and which that starts with {'s'}",
        "uid": 25427,
        "subgraph": "string matching type + relation contains word",
        "template_index": 1647,
        "question": "tell  me province of China that capital Chengdu  starts with letter s",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1615742 . ?sbj wdt:P36 wd:Q30002 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1615742>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P36> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q30002>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q19770"
        ],
        "template_id": "4",
        "paraphrased_question": "tell me province of China that capital Chengdu starts with letter s",
        "simplified_query": "SELECT DISTINCT ?y WHERE { ?y rdf:type ontology:province_of_China . ?y property:capital resource:Chengdu . FILTER ( STRSTARTS ( LCASE ( ?y ) , 's' ) ) }",
        "solved_answer": [
            "Sichuan"
        ]
    },
    {
        "NNQT_question": "Give me {song} that {producer} {Quincy Jones} and which that starts with {'w'}",
        "uid": 25457,
        "subgraph": "string matching type + relation contains word",
        "template_index": 3598,
        "question": "Name a song produced by Quincy Jones that starts with letter W",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7366 . ?sbj wdt:P162 wd:Q193645 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q7366>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P162> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q193645>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q308895",
            "http://www.wikidata.org/entity/Q713287"
        ],
        "template_id": "4",
        "paraphrased_question": "Title a melody created by Quincy Jones that begins with letter W",
        "simplified_query": "SELECT DISTINCT ?h WHERE { ?h property:producer resource:Quincy_Jones . ?h rdf:type ontology:song . FILTER ( STRSTARTS ( LCASE ( ?h ) , 'w' ) ) }",
        "solved_answer": [
            "We Are the World",
            "We Are the World 25 for Haiti"
        ]
    },
    {
        "NNQT_question": "Give me {country} that {official language} {English} and which that starts with {'z'}",
        "uid": 25459,
        "subgraph": "string matching type + relation contains word",
        "template_index": 74,
        "question": "Name a country where people speak english and that starts with letter z",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6256 . ?sbj wdt:P37 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6256>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P37> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1860>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'z')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q953",
            "http://www.wikidata.org/entity/Q954"
        ],
        "template_id": "4",
        "paraphrased_question": "Name a united states of america where humans speak english and that starts with letter z",
        "simplified_query": "SELECT DISTINCT ?f WHERE { ?f property:official_language resource:English . ?f rdf:type ontology:country . FILTER ( STRSTARTS ( LCASE ( ?f ) , 'z' ) ) }",
        "solved_answer": [
            "Zambia",
            "Zimbabwe"
        ]
    },
    {
        "NNQT_question": "Give me {concept} that {studied by} {sociology} and which that starts with {'s'}",
        "uid": 25616,
        "subgraph": "string matching type + relation contains word",
        "template_index": 3980,
        "question": "Name a concept studied by sociology that starts with letter S",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q151885 . ?sbj wdt:P2579 wd:Q21201 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q151885>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2579> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q21201>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q8425",
            "http://www.wikidata.org/entity/Q65089846",
            "http://www.wikidata.org/entity/Q517966",
            "http://www.wikidata.org/entity/Q214693"
        ],
        "template_id": "4",
        "paraphrased_question": "Name a notion studied with the aid of sociology that starts offevolved with letter S",
        "simplified_query": "SELECT DISTINCT ?i WHERE { FILTER ( STRSTARTS ( LCASE ( ?i ) , 's' ) ) . ?i property:studied_by resource:sociology . ?i rdf:type ontology:concept }",
        "solved_answer": [
            "society",
            "Symbolic violence",
            "structure",
            "social capital"
        ]
    },
    {
        "NNQT_question": "Give me {radio network} that {language used} {English} and which that starts with {'n'}",
        "uid": 25381,
        "subgraph": "string matching type + relation contains word",
        "template_index": 2046,
        "question": "Name an English spoken radio network that starts with letter N",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1061197 . ?sbj wdt:P2936 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1061197>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2936> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1860>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'n')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q110597350",
            "http://www.wikidata.org/entity/Q13974"
        ],
        "template_id": "4",
        "paraphrased_question": "Name an English spoken radio network that starts with letter N",
        "simplified_query": "SELECT DISTINCT ?x WHERE { ?x rdf:type ontology:radio_network . ?x property:language_used resource:English . FILTER ( STRSTARTS ( LCASE ( ?x ) , 'n' ) ) }",
        "solved_answer": [
            "Navahang",
            "NBC"
        ]
    },
    {
        "NNQT_question": "Give me {ice giant} that {parent astronomical body} {Sun} and which that starts with {'u'}",
        "uid": 25622,
        "subgraph": "string matching type + relation contains word",
        "template_index": 962,
        "question": "What what is ice giant parent astronomical body Sun which that starts with letters u",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1319599 . ?sbj wdt:P397 wd:Q525 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1319599>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P397> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q525>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q324"
        ],
        "template_id": "4",
        "paraphrased_question": "What what is ice massive father or mother astronomical body Sun which that begins with letters u",
        "simplified_query": "SELECT DISTINCT ?a WHERE { ?a property:parent_astronomical_body resource:Sun . ?a rdf:type ontology:ice_giant . FILTER ( STRSTARTS ( LCASE ( ?a ) , 'u' ) ) }",
        "solved_answer": [
            "Uranus"
        ]
    },
    {
        "NNQT_question": "Give me {therapy} that {author} {Sigmund Freud} and which that starts with {'p'}",
        "uid": 25593,
        "subgraph": "string matching type + relation contains word",
        "template_index": 3792,
        "question": "What therapy is written by Sigmund Freud that starts with the letter \"p\"?",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179661 . ?sbj wdt:P50 wd:Q9215 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q179661>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P50> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q9215>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q41630"
        ],
        "template_id": "4",
        "paraphrased_question": "Which therapy is written by Sigmund Freud that starts with letter \"p\"?",
        "simplified_query": "SELECT DISTINCT ?a WHERE { FILTER ( STRSTARTS ( LCASE ( ?a ) , 'p' ) ) . ?a rdf:type ontology:treatment . ?a property:author resource:Sigmund_Freud }",
        "solved_answer": [
            "psychoanalysis"
        ]
    },
    {
        "NNQT_question": "Give me {Christian Church} that {office held by head of the organisation} {pope} and which that starts with {'c'}",
        "uid": 25630,
        "subgraph": "string matching type + relation contains word",
        "template_index": 2951,
        "question": "What what is Christian Church office held by head of the organisation pope and which that starts with c",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34651 . ?sbj wdt:P2388 wd:Q19546 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q34651>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2388> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q19546>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'c')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q9592"
        ],
        "template_id": "4",
        "paraphrased_question": "What what is Christian Church workplace held by way of head of the business enterprise pope and which that starts with c",
        "simplified_query": "SELECT DISTINCT ?a WHERE { FILTER ( STRSTARTS ( LCASE ( ?a ) , 'c' ) ) . ?a rdf:type ontology:Christian_Church . ?a property:office_held_by_head_of_the_organization resource:pope }",
        "solved_answer": [
            "Catholic Church"
        ]
    },
    {
        "NNQT_question": "Give me {band} that {location of formation} {London} and which that starts with {'y'}",
        "uid": 25443,
        "subgraph": "string matching type + relation contains word",
        "template_index": 2431,
        "question": "What is the nae of the band, who started in London, and name begins with Y",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215380 . ?sbj wdt:P740 wd:Q84 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q215380>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P740> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q84>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q184386",
            "http://www.wikidata.org/entity/Q2683245",
            "http://www.wikidata.org/entity/Q18608591"
        ],
        "template_id": "4",
        "paraphrased_question": "What is the nae of the band, who commenced in London, and title starts offevolved with Y",
        "simplified_query": "SELECT DISTINCT ?v WHERE { ?v property:location_of_formation resource:London . ?v rdf:type ontology:musical_group . FILTER ( STRSTARTS ( LCASE ( ?v ) , 'y' ) ) }",
        "solved_answer": [
            "Yes",
            "Yuck",
            "Years & Years"
        ]
    },
    {
        "NNQT_question": "Give me {space observatory} that {objective of project or mission} {space exploration} and which that starts with {'j'}",
        "uid": 25497,
        "subgraph": "string matching type + relation contains word",
        "template_index": 3364,
        "question": "Name a space observatory that starts with letter J",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q148578 . ?sbj wdt:P3712 wd:Q180046 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'j')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q148578>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3712> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q180046>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'j')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q186447"
        ],
        "template_id": "4",
        "paraphrased_question": "Title a space observatory that begins with letter J",
        "simplified_query": "SELECT DISTINCT ?n WHERE { FILTER ( STRSTARTS ( LCASE ( ?n ) , 'j' ) ) . ?n property:objective_of_project_or_action resource:space_exploration . ?n rdf:type ontology:space_observatory }",
        "solved_answer": [
            "James Webb Space Telescope"
        ]
    }
]