[
    {
        "NNQT_question": "What is {same} of {assault}, that has {distinct from} is {homicide} ?",
        "uid": 13204,
        "subgraph": "right-subgraph",
        "template_index": 9,
        "question": "What is synonymous with assault but unlike murder?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q365680 wdt:P460 ?answer . ?answer wdt:P1889 wd:Q149086}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q365680> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P460>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1889> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q149086> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q81672"
        ],
        "template_id": "1",
        "paraphrased_question": "What is synonymous with ambush but not at all like murder?",
        "simplified_query": "SELECT ?n WHERE { resource:assault property:said_to_be_the_same_as ?n . ?n property:different_from resource:homicide }",
        "solved_answer": [
            "attempted murder"
        ]
    },
    {
        "NNQT_question": "What is {husband} of {Madhuri Dixit}, that has {gender identity} is {male} ?",
        "uid": 11898,
        "subgraph": "right-subgraph",
        "template_index": 637,
        "question": "Who is the husband of Madhuri Dixit, who has gender identity as male?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q232451 wdt:P26 ?answer . ?answer wdt:P21 wd:Q6581097}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q232451> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P21> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6581097> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q22676853"
        ],
        "template_id": "1",
        "paraphrased_question": "Who is Madhuri Dixit's husband,  as a male gender identity",
        "simplified_query": "SELECT ?q WHERE { resource:Madhuri_Dixit property:spouse ?q . ?q property:sex_or_gender resource:male }",
        "solved_answer": [
            "Shriram Madhav Nene"
        ]
    },
    {
        "NNQT_question": "What is {developer of} of {gunpowder}, that has {birthdate} is {1318-0-0} ?",
        "uid": 13961,
        "subgraph": "right-subgraph",
        "template_index": 77,
        "question": "What gunpowder developer has a 1318-0-0 birthdate?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q12861 wdt:P61 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1318'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q12861> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P569> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1318-0-0> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q64236"
        ],
        "template_id": "1",
        "paraphrased_question": "What explosive designer includes a 1318-0-0 birthdate? ?",
        "simplified_query": "SELECT ?o WHERE { resource:gunpowder property:discoverer_or_inventor ?o . FILTER ( CONTAINS ( YEAR ( ?f ) , '1318' ) ) . ?o property:date_of_birth ?f }",
        "solved_answer": [
            "Berthold Schwarz"
        ]
    },
    {
        "NNQT_question": "What is the {anatomical location} and the {connects with} of {Brain} ?",
        "uid": 9644,
        "subgraph": "two intentions right subgraph",
        "template_index": 234,
        "question": "where is the anatomical location and connects with Brain?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q1073 wdt:P927 ?ans_1 . wd:Q1073 wdt:P2789 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1073> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P927> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1073> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2789> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q1710207",
            "http://www.wikidata.org/entity/Q9606",
            "http://www.wikidata.org/entity/Q186029",
            "http://www.wikidata.org/entity/Q28947902"
        ],
        "template_id": "1",
        "paraphrased_question": "What and where is the connection to the brain?",
        "simplified_query": "SELECT ?k ?f WHERE { resource:brain property:anatomical_location ?k . resource:brain property:connects_with ?f }",
        "solved_answer": [
            "cranial cavity",
            "spinal cord",
            "optic nerve",
            "cranium"
        ]
    },
    {
        "NNQT_question": "What is {is in the administrative unit} of {Victoria}, that has {diplomatic relation} is {Canada} ?",
        "uid": 13447,
        "subgraph": "right-subgraph",
        "template_index": 16917,
        "question": "What diplomatic relation to Canada is in the administrative unit of Victoria?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q36687 wdt:P131 ?answer . ?answer wdt:P530 wd:Q16}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q36687> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P131>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P530> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q16> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q408"
        ],
        "template_id": "1",
        "paraphrased_question": "What political connection to Canada is within the authoritative unit of Victoria?",
        "simplified_query": "SELECT ?i WHERE { ?i property:diplomatic_relation resource:Canada . resource:Victoria property:located_in_the_administrative_territorial_entity ?i }",
        "solved_answer": [
            "Australia"
        ]
    },
    {
        "NNQT_question": "What is the {health specialty} and the {medical examinations} of {Hepatitis_C} ?",
        "uid": 10153,
        "subgraph": "two intentions right subgraph",
        "template_index": 470,
        "question": "What is Hepatitis C's health specialty and medical examinations\"",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q154869 wdt:P1995 ?ans_1 . wd:Q154869 wdt:P923 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q154869> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1995> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q154869> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P923> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q788926",
            "http://www.wikidata.org/entity/Q176996",
            "http://www.wikidata.org/entity/Q332126",
            "http://www.wikidata.org/entity/Q360841",
            "http://www.wikidata.org/entity/Q886837"
        ],
        "template_id": "1",
        "paraphrased_question": "What are the health specialty and medical examinations for Hepatitis C?",
        "simplified_query": "SELECT ?t ?h WHERE { resource:hepatitis_C property:medical_examinations ?h . resource:hepatitis_C property:health_specialty ?t }",
        "solved_answer": [
            "infectious diseases",
            "polymerase chain reaction",
            "ELISEA",
            "liver biopsy",
            "blood test"
        ]
    },
    {
        "NNQT_question": "What is the {student of} and the {student} of {Pablo_Picasso} ?",
        "uid": 10021,
        "subgraph": "two intentions right subgraph",
        "template_index": 60,
        "question": "Who are the students of Pablo Picasso?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q5593 wdt:P1066 ?ans_1 . wd:Q5593 wdt:P802 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5593> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1066> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5593> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P802> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q26993515",
            "http://www.wikidata.org/entity/Q2901542",
            "http://www.wikidata.org/entity/Q3296153",
            "http://www.wikidata.org/entity/Q20535072"
        ],
        "template_id": "1",
        "paraphrased_question": "Who are Pablo Picasso's students?",
        "simplified_query": "SELECT ?z ?i WHERE { resource:Pablo_Picasso property:student_of ?z . resource:Pablo_Picasso property:student ?i }",
        "solved_answer": [
            "Kulo Green",
            "Jos\u00e9 Ruiz y Blanco",
            "Antonio Mu\u00f1oz Degrain",
            "Isidoro Brocos"
        ]
    },
    {
        "NNQT_question": "What is the {has cause} and the {drug used for treatment} of {Anthrax} ?",
        "uid": 9848,
        "subgraph": "two intentions right subgraph",
        "template_index": 59,
        "question": "What causes Anthrax and what drug is used for treatment?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q129104 wdt:P828 ?ans_1 . wd:Q129104 wdt:P2176 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q129104> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P828> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q129104> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2176> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q614156",
            "http://www.wikidata.org/entity/Q192717",
            "http://www.wikidata.org/entity/Q1935986",
            "http://www.wikidata.org/entity/Q213511",
            "http://www.wikidata.org/entity/Q256602",
            "http://www.wikidata.org/entity/Q415336",
            "http://www.wikidata.org/entity/Q422442",
            "http://www.wikidata.org/entity/Q13026783"
        ],
        "template_id": "1",
        "paraphrased_question": "how is Anthrax produced, and how can it be treated?",
        "simplified_query": "SELECT ?i ?w WHERE { resource:Anthrax property:drug_used_for_treatment ?w . resource:Anthrax property:has_cause ?i }",
        "solved_answer": [
            "Bacillus anthracis",
            "streptomycin",
            "anthrax toxin",
            "erythromycin",
            "ciprofloxacin",
            "minocycline",
            "doxycycline",
            "penicillin G procaine hydrate"
        ]
    },
    {
        "NNQT_question": "What is the {genetic association} and the {drug used for treatment} of {Cardiovascular_disease} ?",
        "uid": 9970,
        "subgraph": "two intentions right subgraph",
        "template_index": 482,
        "question": "What is the genetic association of Cardiovascular disease, and what drugs are used for treatment?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q389735 wdt:P2293 ?ans_1 . wd:Q389735 wdt:P2176 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q389735> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2293> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q389735> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2176> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q139347",
            "http://www.wikidata.org/entity/Q14872724",
            "http://www.wikidata.org/entity/Q14890615",
            "http://www.wikidata.org/entity/Q14890978",
            "http://www.wikidata.org/entity/Q14913510",
            "http://www.wikidata.org/entity/Q17916070",
            "http://www.wikidata.org/entity/Q18025635",
            "http://www.wikidata.org/entity/Q18033174",
            "http://www.wikidata.org/entity/Q18035395",
            "http://www.wikidata.org/entity/Q18036152",
            "http://www.wikidata.org/entity/Q18039854",
            "http://www.wikidata.org/entity/Q18042703",
            "http://www.wikidata.org/entity/Q20970115"
        ],
        "template_id": "1",
        "paraphrased_question": "What is the genetic association of Cardiovascular disease, and what drugs are used for treatment?",
        "simplified_query": "SELECT ?e ?j WHERE { resource:cardiovascular_disease property:drug_used_for_treatment ?j . resource:cardiovascular_disease property:genetic_association ?e }",
        "solved_answer": [
            "cholecalciferol",
            "LDLR",
            "APOB",
            "HFE",
            "BCHE",
            "CELSR2",
            "GCKR",
            "OASL",
            "TOMM40",
            "IL1RAPL1",
            "IRX4",
            "MEPE",
            "SLC17A4"
        ]
    },
    {
        "NNQT_question": "What is the {country of citizenship} and the {occupation} of {Alice_Cooper} ?",
        "uid": 9728,
        "subgraph": "two intentions right subgraph",
        "template_index": 354,
        "question": "What is the nationality and occupation of Alice Cooper?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q332032 wdt:P27 ?ans_1 . wd:Q332032 wdt:P106 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q332032> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P27> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q332032> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q30",
            "http://www.wikidata.org/entity/Q33999",
            "http://www.wikidata.org/entity/Q36834",
            "http://www.wikidata.org/entity/Q177220",
            "http://www.wikidata.org/entity/Q2643890",
            "http://www.wikidata.org/entity/Q29017403"
        ],
        "template_id": "1",
        "paraphrased_question": "What are Alice Cooper's nationality and occupation ?",
        "simplified_query": "SELECT ?q ?g WHERE { resource:Alice_Cooper property:country_of_citizenship ?q . resource:Alice_Cooper property:occupation ?g }",
        "solved_answer": [
            "United States of America",
            "actor",
            "composer",
            "singer",
            "vocalist",
            "rock musician"
        ]
    },
    {
        "NNQT_question": "What is {type locality (geology)} of {diopside}, that has {total area} is {11.14} ?",
        "uid": 14203,
        "subgraph": "right-subgraph",
        "template_index": 52,
        "question": "What is the geological locality having diopside with the total area of 11.14?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q316671 wdt:P2695 ?answer . ?answer wdt:P2046 ?x FILTER(contains(?x,'11.14'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q316671> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2695>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2046> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <11.14> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q9084"
        ],
        "template_id": "1",
        "paraphrased_question": "What is the topographical region having diopside with the whole range of 11.14?",
        "simplified_query": "SELECT ?s WHERE { ?s property:area ?n . FILTER ( ?n = 11.14 ) . resource:diopside property:type_locality_(geology) ?s }",
        "solved_answer": [
            "Brosso"
        ]
    },
    {
        "NNQT_question": "What is the {owner of} and the {owned by} of {CNN} ?",
        "uid": 9831,
        "subgraph": "two intentions right subgraph",
        "template_index": 628,
        "question": "Who owns CNN is owned and who is CNN owned by?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q48340 wdt:P1830 ?ans_1 . wd:Q48340 wdt:P127 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q48340> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1830> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q48340> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P127> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q12217473",
            "http://www.wikidata.org/entity/Q107074885"
        ],
        "template_id": "1",
        "paraphrased_question": "Who is CNN owned by and who owns CNN?",
        "simplified_query": "SELECT ?a ?y WHERE { resource:CNN property:owned_by ?y . resource:CNN property:owner_of ?a }",
        "solved_answer": [
            "CNN.com",
            "Warner Bros. Discovery"
        ]
    },
    {
        "NNQT_question": "Did {Absinthe} {country of origin} {Switzerland}?",
        "uid": 196,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 196,
        "question": "Did Absinthe come from Switzerland?",
        "sparql_wikidata": "ASK WHERE { wd:Q170210 wdt:P495 wd:Q39 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q170210> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P495> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q39>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            true
        ],
        "template_id": "1",
        "paraphrased_question": "Was Switzerland the home of Absinthe?",
        "simplified_query": "ASK WHERE { resource:absinthe property:country_of_origin resource:Switzerland }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "What is {county seat of} of {Taipei}, that has {diplomatic relation} is {Mali} ?",
        "uid": 13314,
        "subgraph": "right-subgraph",
        "template_index": 25,
        "question": "Who has the country seat of Taipei, who also has diplomatic relations with the country of Mali?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1867 wdt:P1376 ?answer . ?answer wdt:P530 wd:Q912}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1867> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1376>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P530> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q912> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q865"
        ],
        "template_id": "1",
        "paraphrased_question": "Who has the nation situate of Taipei, who too has discretionary relations with the nation of Mali?",
        "simplified_query": "SELECT ?h WHERE { ?h property:diplomatic_relation resource:Mali . resource:Taipei property:capital_of ?h }",
        "solved_answer": [
            "Taiwan"
        ]
    },
    {
        "NNQT_question": "What is {location of death} of {Kang Sheng}, that has {sister town} is {Tokyo} ?",
        "uid": 12258,
        "subgraph": "right-subgraph",
        "template_index": 1139,
        "question": "Where did Kang Sheng die that is near Tokoyo?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q544432 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1490}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q544432> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1490> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q956"
        ],
        "template_id": "1",
        "paraphrased_question": "Where did Kang Sheng kick the bucket that's close Tokoyo?",
        "simplified_query": "SELECT ?h WHERE { resource:Kang_Sheng property:place_of_death ?h . ?h property:twinned_administrative_body resource:Tokyo }",
        "solved_answer": [
            "Beijing"
        ]
    },
    {
        "NNQT_question": "What is {toponym} of {thorium}, that has {parent} is {Odin} ?",
        "uid": 11879,
        "subgraph": "right-subgraph",
        "template_index": 240,
        "question": "Who is the toponym of thorium, and has a parent named Odin?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1115 wdt:P138 ?answer . ?answer wdt:P22 wd:Q43610}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1115> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P138>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P22> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q43610> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q42952"
        ],
        "template_id": "1",
        "paraphrased_question": "Who is the toponym of thorium, and encompasses a parent named Odin?",
        "simplified_query": "SELECT ?k WHERE { resource:thorium property:named_after ?k . ?k property:father resource:Odin }",
        "solved_answer": [
            "Thor"
        ]
    },
    {
        "NNQT_question": "Did {Jane_Fonda} {father} {Henry Fonda}?",
        "uid": 292,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 292,
        "question": "Is Jane Fonda's father Henry Fonda?",
        "sparql_wikidata": "ASK WHERE { wd:Q41142 wdt:P22 wd:Q19155 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q41142> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P22> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q19155>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            true
        ],
        "template_id": "1",
        "paraphrased_question": "Is it true that the father of Jane Fonda is Henry Fonda?",
        "simplified_query": "ASK WHERE { resource:Jane_Fonda property:father resource:Henry_Fonda }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "What is the {partner} and the {spouse} of {Neil_Young} ?",
        "uid": 9485,
        "subgraph": "two intentions right subgraph",
        "template_index": 474,
        "question": "Who is Neil Young's spouse?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q633 wdt:P451 ?ans_1 . wd:Q633 wdt:P26 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q633> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P451> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q633> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q266425",
            "http://www.wikidata.org/entity/Q207596",
            "http://www.wikidata.org/entity/Q3374257"
        ],
        "template_id": "1",
        "paraphrased_question": "Who is married to Neil Young?",
        "simplified_query": "SELECT ?q ?n WHERE { resource:Neil_Young property:spouse ?n . resource:Neil_Young property:unmarried_partner ?q }",
        "solved_answer": [
            "Carrie Snodgress",
            "Daryl Hannah",
            "Pegi Young"
        ]
    },
    {
        "NNQT_question": "What is {preceeds} of {Watership Down}, that has {date released} is {1996-0-0} ?",
        "uid": 12050,
        "subgraph": "right-subgraph",
        "template_index": 123,
        "question": "Released in 1996, what is the prequel to \"Watership Down\"?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q936801 wdt:P156 ?answer . ?answer wdt:P577 ?x FILTER(contains(YEAR(?x),'1996'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q936801> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P156>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P577> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1996-0-0> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q2120111"
        ],
        "template_id": "1",
        "paraphrased_question": "Discharged in 1996, what is the prequel to \"Watership Down\"?",
        "simplified_query": "SELECT ?n WHERE { FILTER ( CONTAINS ( YEAR ( ?q ) , '1996' ) ) . resource:Watership_Down property:followed_by ?n . ?n property:publication_date ?q }",
        "solved_answer": [
            "Tales from Watership Down"
        ]
    }
]