[
    {
        "NNQT_question": "What is {developed by} of {death location} of {Margaret Thatcher} ?",
        "uid": 14281,
        "subgraph": "left-subgraph",
        "template_index": 4,
        "question": "Where did Margaret Thatcher die?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7416 wdt:P20 ?X . ?X wdt:P178 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7416> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P178> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q114347"
        ],
        "template_id": "5",
        "paraphrased_question": "Where did Margaret Thatcher die?",
        "simplified_query": "SELECT ?r WHERE { ?m property:developer ?r . resource:Margaret_Thatcher property:place_of_death ?m }",
        "solved_answer": [
            "C\u00e9sar Ritz"
        ]
    },
    {
        "NNQT_question": "What is {motif} of {notable books} of {Salvador Dali} ?",
        "uid": 14864,
        "subgraph": "left-subgraph",
        "template_index": 0,
        "question": "Why are books writen about Salvador Dali",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q5577 wdt:P800 ?X . ?X wdt:P180 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5577> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P800>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P180> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q107679",
            "http://www.wikidata.org/entity/Q178794",
            "http://www.wikidata.org/entity/Q115705859",
            "http://www.wikidata.org/entity/Q302",
            "http://www.wikidata.org/entity/Q8441",
            "http://www.wikidata.org/entity/Q51636",
            "http://www.wikidata.org/entity/Q51633",
            "http://www.wikidata.org/entity/Q10859",
            "http://www.wikidata.org/entity/Q58",
            "http://www.wikidata.org/entity/Q467",
            "http://www.wikidata.org/entity/Q506",
            "http://www.wikidata.org/entity/Q608",
            "http://www.wikidata.org/entity/Q7364",
            "http://www.wikidata.org/entity/Q7559",
            "http://www.wikidata.org/entity/Q10884",
            "http://www.wikidata.org/entity/Q83931",
            "http://www.wikidata.org/entity/Q198763"
        ],
        "template_id": "5",
        "paraphrased_question": "Why are books writen almost Salvador Dali",
        "simplified_query": "SELECT ?l WHERE { ?t property:depicts ?l . resource:Salvador_Dal\u00ed property:notable_work ?t }",
        "solved_answer": [
            "cliff",
            "watch",
            "ant",
            "Jesus",
            "man",
            "Crucifixion of Jesus",
            "Last Supper",
            "Spanish Civil War",
            "penis",
            "woman",
            "flower",
            "human sexual behavior",
            "eye",
            "dragon",
            "tree",
            "locust",
            "undergarment"
        ]
    },
    {
        "NNQT_question": "What is {trend} of {professor} of {Aratus} ?",
        "uid": 16967,
        "subgraph": "left-subgraph",
        "template_index": 8,
        "question": "What is the trend  of the professor  of Aratus ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q180671 wdt:P1066 ?X . ?X wdt:P135 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q180671> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1066>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P135> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q1395219"
        ],
        "template_id": "5",
        "paraphrased_question": "Name the professor of Aratus' trend.",
        "simplified_query": "SELECT ?u WHERE { resource:Aratus property:student_of ?l . ?l property:movement ?u }",
        "solved_answer": [
            "skepticism"
        ]
    },
    {
        "NNQT_question": "What is {alma mater} of {film crew member} of {The Lion King} ?",
        "uid": 15553,
        "subgraph": "left-subgraph",
        "template_index": 4763,
        "question": "EDITION",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q36479 wdt:P3092 ?X . ?X wdt:P69 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q36479> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3092>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q5948783",
            "http://www.wikidata.org/entity/Q5105452",
            "http://www.wikidata.org/entity/Q4614",
            "http://www.wikidata.org/entity/Q597236",
            "http://www.wikidata.org/entity/Q1026827",
            "http://www.wikidata.org/entity/Q4802350",
            "http://www.wikidata.org/entity/Q6364655",
            "http://www.wikidata.org/entity/Q1411093",
            "http://www.wikidata.org/entity/Q4318523"
        ],
        "template_id": "5",
        "paraphrased_question": "Which edition is this?",
        "simplified_query": "SELECT ?w WHERE { resource:The_Lion_King property:film_crew_member ?k . ?k property:educated_at ?w }",
        "solved_answer": [
            "Hurtwood House",
            "Chouinard Art Institute",
            "University of Southern California",
            "Washington State University",
            "California Institute of the Arts",
            "Arvada West High School",
            "Kansas City Art Institute",
            "St. Lawrence University",
            "Sheridan College"
        ]
    },
    {
        "NNQT_question": "How many {founded by} are for {Oprah Winfrey} ?",
        "uid": 1105,
        "subgraph": "statement_property",
        "template_index": 105,
        "question": "How many things are founded by Oprah Winfrey?",
        "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q55800 wdt:P112 ?obj }",
        "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q55800> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P112> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
        "template": "Count Obj (ent-pred-obj)",
        "answer": [
            "0"
        ],
        "template_id": "Count_1",
        "paraphrased_question": "Tell me how many things are founded by Oprah Winfrey.",
        "simplified_query": "SELECT ( COUNT ( ?n ) AS ?h ) { resource:Oprah_Winfrey property:founded_by ?n }",
        "solved_answer": [
            "0"
        ]
    },
    {
        "NNQT_question": "How many {publication date} are for {Forrest Gump} ?",
        "uid": 1058,
        "subgraph": "statement_property",
        "template_index": 58,
        "question": "When was Forrest Gump publication date",
        "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q134773 wdt:P577 ?obj }",
        "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q134773> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P577> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
        "template": "Count Obj (ent-pred-obj)",
        "answer": [
            "6"
        ],
        "template_id": "Count_1",
        "paraphrased_question": "In what year did Forrest Gump come out?",
        "simplified_query": "SELECT ( COUNT ( ?z ) AS ?p ) { resource:Forrest_Gump property:publication_date ?z }",
        "solved_answer": [
            "6"
        ]
    },
    {
        "NNQT_question": "How many {airline hub} are for {All Nippon Airways} ?",
        "uid": 1107,
        "subgraph": "statement_property",
        "template_index": 107,
        "question": "How many airline hub are done by All Nippon Airways",
        "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q204284 wdt:P113 ?obj }",
        "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q204284> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P113> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
        "template": "Count Obj (ent-pred-obj)",
        "answer": [
            "4"
        ],
        "template_id": "Count_1",
        "paraphrased_question": "What are the airports used as hubs by All Nippon Airways?",
        "simplified_query": "SELECT ( COUNT ( ?v ) AS ?k ) { resource:All_Nippon_Airways_(ANA) property:airline_hub ?v }",
        "solved_answer": [
            "4"
        ]
    },
    {
        "NNQT_question": "How many {facet of} are to/by {Suriname} ?",
        "uid": 2409,
        "subgraph": "statement_property",
        "template_index": 1753,
        "question": "How many people have a facet of their Suriname?",
        "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1269 wd:Q730 }",
        "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1269> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q730 .\n} \n",
        "template": "Count ent (ent-pred-obj)",
        "answer": [
            "93"
        ],
        "template_id": "Count_2",
        "paraphrased_question": "Suriname face how many people have this face?\n\u00a0",
        "simplified_query": "SELECT ( COUNT ( ?j ) AS ?o ) { ?j property:facet_of resource:Suriname }",
        "solved_answer": [
            "93"
        ]
    },
    {
        "NNQT_question": "How many {position held} are to/by {lieutenant general} ?",
        "uid": 1890,
        "subgraph": "statement_property",
        "template_index": 1234,
        "question": "How many position held are by the lieutenant general?",
        "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P39 wd:Q152951 }",
        "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P39> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q152951 .\n} \n",
        "template": "Count ent (ent-pred-obj)",
        "answer": [
            "32"
        ],
        "template_id": "Count_2",
        "paraphrased_question": "What is the total number of ranks that the Lieutenant General has accomplished?",
        "simplified_query": "SELECT ( COUNT ( ?j ) AS ?p ) { ?j property:position_held resource:lieutenant_general }",
        "solved_answer": [
            "32"
        ]
    },
    {
        "NNQT_question": "How many {honorific prefix} are to/by {Dame} ?",
        "uid": 1993,
        "subgraph": "statement_property",
        "template_index": 1337,
        "question": "how many honors does dame have?",
        "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P511 wd:Q901407 }",
        "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P511> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q901407 .\n} \n",
        "template": "Count ent (ent-pred-obj)",
        "answer": [
            "27"
        ],
        "template_id": "Count_2",
        "paraphrased_question": "How many honors has Madame received?",
        "simplified_query": "SELECT ( COUNT ( ?r ) AS ?d ) { ?r property:honorific_prefix resource:dame }",
        "solved_answer": [
            "27"
        ]
    },
    {
        "NNQT_question": "How many {league} are to/by {National Hockey League} ?",
        "uid": 1773,
        "subgraph": "statement_property",
        "template_index": 1117,
        "question": "How many leagues are in the National Hockey League?",
        "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P118 wd:Q1215892 }",
        "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P118> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q1215892 .\n} \n",
        "template": "Count ent (ent-pred-obj)",
        "answer": [
            "7623"
        ],
        "template_id": "Count_2",
        "paraphrased_question": "how many leagues are in natinal hockey league?",
        "simplified_query": "SELECT ( COUNT ( ?w ) AS ?b ) { ?w property:league resource:National_Hockey_League }",
        "solved_answer": [
            "7623"
        ]
    },
    {
        "NNQT_question": "How many {sports discipline competed in} are to/by {foil} ?",
        "uid": 1914,
        "subgraph": "statement_property",
        "template_index": 1258,
        "question": "Foil is used in what type of sports competition?",
        "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P2416 wd:Q471447 }",
        "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2416> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q471447 .\n} \n",
        "template": "Count ent (ent-pred-obj)",
        "answer": [
            "15"
        ],
        "template_id": "Count_2",
        "paraphrased_question": "What type of sports competition uses foil?",
        "simplified_query": "SELECT ( COUNT ( ?o ) AS ?i ) { ?o property:sports_discipline_competed_in resource:foil }",
        "solved_answer": [
            "15"
        ]
    },
    {
        "NNQT_question": "How many {discovery method} are to/by {Radial velocity} ?",
        "uid": 1981,
        "subgraph": "statement_property",
        "template_index": 1325,
        "question": "How many discoveries have been made concerning radial velocity?",
        "sparql_wikidata": "SELECT (COUNT(?sub) AS ?value ) { ?sub wdt:P1046 wd:Q240105 }",
        "sparql_dbpedia18": "SELECT (COUNT(?sub) AS ?subs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sub .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1046> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> http://wikidata.dbpedia.org/resource/Q240105 .\n} \n",
        "template": "Count ent (ent-pred-obj)",
        "answer": [
            "0"
        ],
        "template_id": "Count_2",
        "paraphrased_question": "Research concerning radial velocity has been discovered how many times?",
        "simplified_query": "SELECT ( COUNT ( ?g ) AS ?b ) { ?g property:discovery_method resource:radial_velocity }",
        "solved_answer": [
            "0"
        ]
    },
    {
        "NNQT_question": "What is the {port} with the {MAX(production rate)} ?",
        "uid": 2784,
        "subgraph": "rank",
        "template_index": 360,
        "question": "Which port has the highest production rate?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q44782 . ?ent wdt:P2197 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q44782>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2197>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .}\nORDER BY DESC(?obj)\nLIMIT 5",
        "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q32064908"
        ],
        "template_id": "Rank1",
        "paraphrased_question": "Which harbour has the most elevated generation rate?",
        "simplified_query": "SELECT ?e WHERE { ?e property:production_rate ?v . ?e rdf:type ontology:port }",
        "solved_answer": [
            "Kiel Port"
        ]
    },
    {
        "NNQT_question": "What is the {building} with the {MAX(cost)} ?",
        "uid": 2682,
        "subgraph": "rank",
        "template_index": 258,
        "question": "which building has the highest cost?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q41176 . ?ent wdt:P2130 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q41176>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2130>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .}\nORDER BY DESC(?obj)\nLIMIT 5",
        "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q11524341",
            "http://www.wikidata.org/entity/Q10954019",
            "http://www.wikidata.org/entity/Q99476607",
            "http://www.wikidata.org/entity/Q28688138",
            "http://www.wikidata.org/entity/Q98833267"
        ],
        "template_id": "Rank1",
        "paraphrased_question": "What is the most expensive building?",
        "simplified_query": "SELECT ?s WHERE { ?s property:cost ?n . ?s rdf:type ontology:building }",
        "solved_answer": [
            "Tokyo Tower of Babel",
            "FCG Building",
            "Keihanna Open Innovation Center @KYOTO",
            "Happiring",
            "Kyoto Keizai Center"
        ]
    },
    {
        "NNQT_question": "What is the {human} with the {MAX(Elo rating)} ?",
        "uid": 2597,
        "subgraph": "rank",
        "template_index": 173,
        "question": "Who has the highest Elo rating?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1087 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q5>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1087>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .}\nORDER BY DESC(?obj)\nLIMIT 5",
        "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q28614"
        ],
        "template_id": "Rank1",
        "paraphrased_question": "State the player with the highest Elo rating.",
        "simplified_query": "SELECT ?v WHERE { ?v property:Elo_rating ?u . ?v rdf:type ontology:human }",
        "solved_answer": [
            "Garry Kasparov"
        ]
    },
    {
        "NNQT_question": "What is the {taxon} with the {MAX(heart rate)} ?",
        "uid": 2670,
        "subgraph": "rank",
        "template_index": 246,
        "question": "Which taxon has the highest heart rate?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3395 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q16521>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3395>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .}\nORDER BY DESC(?obj)\nLIMIT 5",
        "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q41631",
            "http://www.wikidata.org/entity/Q6573",
            "http://www.wikidata.org/entity/Q780",
            "http://www.wikidata.org/entity/Q79803",
            "http://www.wikidata.org/entity/Q723435"
        ],
        "template_id": "Rank1",
        "paraphrased_question": "Tell me the taxon with the highest heart rate?",
        "simplified_query": "SELECT ?a WHERE { ?a rdf:type ontology:taxon . ?a property:heart_rate ?w }",
        "solved_answer": [
            "Soricidae",
            "Cricetinae",
            "chicken",
            "Guinea-pig",
            "Petaurus breviceps"
        ]
    },
    {
        "NNQT_question": "What is the {taxon} with the {MAX(generation time)} ?",
        "uid": 2438,
        "subgraph": "rank",
        "template_index": 14,
        "question": "Which taxon has the longest generation time?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3337 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q16521>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3337>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .}\nORDER BY DESC(?obj)\nLIMIT 5",
        "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q31713",
            "http://www.wikidata.org/entity/Q31866",
            "http://www.wikidata.org/entity/Q375790",
            "http://www.wikidata.org/entity/Q611324",
            "http://www.wikidata.org/entity/Q843182"
        ],
        "template_id": "Rank1",
        "paraphrased_question": "What taxon had the longest amount of time?",
        "simplified_query": "SELECT ?y WHERE { ?y property:generation_time ?n . ?y rdf:type ontology:taxon }",
        "solved_answer": [
            "House Swift",
            "Fork-tailed Swift",
            "Southern Cassowary",
            "Little Swift",
            "Northern Cassowary"
        ]
    },
    {
        "NNQT_question": "What is the {asteroid} with the {MAX(orbital inclination)} ?",
        "uid": 2487,
        "subgraph": "rank",
        "template_index": 63,
        "question": "Which asteroid has got the most orbital inclination?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2045 ?obj } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q3863>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2045>.\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .}\nORDER BY DESC(?obj)\nLIMIT 5",
        "template": "?E is_a Type, ?E pred Obj  value. MAX/MIN (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q4605025",
            "http://www.wikidata.org/entity/Q25421743",
            "http://www.wikidata.org/entity/Q106640211",
            "http://www.wikidata.org/entity/Q107379302",
            "http://www.wikidata.org/entity/Q107379358"
        ],
        "template_id": "Rank1",
        "paraphrased_question": "Name the asteroid that has got the most orbital inclination",
        "simplified_query": "SELECT ?a WHERE { ?a rdf:type ontology:asteroid . ?a property:orbital_inclination ?f }",
        "solved_answer": [
            "(434620) 2005 VD",
            "2006 LM1",
            "2020 YR3",
            "A/2021 E2",
            "A/2018 V3"
        ]
    },
    {
        "NNQT_question": "What is the {star} with the {MIN(radial velocity)} whose {constellation} is {Centaurus}  ?",
        "uid": 3444,
        "subgraph": "rank",
        "template_index": 666,
        "question": "What start located in the constellation of Centaurus has the least radial velocity?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q523 . ?ent wdt:P2216 ?obj . ?ent wdt:P59 wd:Q8844} ORDER BY ASC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q523>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2216>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P59> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q8844> .\n\n}\nORDER BY ASC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q80025129",
            "http://www.wikidata.org/entity/Q85314172",
            "http://www.wikidata.org/entity/Q88705268",
            "http://www.wikidata.org/entity/Q84506812",
            "http://www.wikidata.org/entity/Q80025342"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "Which star as the least radial velocity in the Centaurus constellation?",
        "simplified_query": "SELECT ?u WHERE { ?u property:constellation resource:Centaurus . ?u rdf:type ontology:star . ?u property:radial_velocity ?v }",
        "solved_answer": [
            "HD 117688",
            "TYC 7789-741-1",
            "IRAS 12225-5136",
            "IRAS 12429-5400",
            "TYC 8991-3663-1"
        ]
    },
    {
        "NNQT_question": "What is the {asteroid} with the {MAX(mean anomaly)} whose {minor planet group} is {asteroid belt}  ?",
        "uid": 3030,
        "subgraph": "rank",
        "template_index": 229,
        "question": "Name the asteroid belonging to an asteroid belt with the highest mean anomaly.",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2325 ?obj . ?ent wdt:P196 wd:Q2179 } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q3863>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2325>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P196> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2179> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q1483177",
            "http://www.wikidata.org/entity/Q6705478",
            "http://www.wikidata.org/entity/Q19625945",
            "http://www.wikidata.org/entity/Q4957464",
            "http://www.wikidata.org/entity/Q1480348"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "Title the space rock having a place to an space rock belt with the most elevated cruel anomaly.",
        "simplified_query": "SELECT ?n WHERE { ?n property:mean_anomaly ?t . ?n rdf:type ontology:asteroid . ?n property:minor_planet_group resource:asteroid_belt }",
        "solved_answer": [
            "(29944) 1999 JF80",
            "(31226) 1998 BZ40",
            "(14742) 2000 EQ56",
            "(20245) 1998 EL5",
            "(12961) 4262 T-2"
        ]
    }
]