[
    {
        "NNQT_question": "what is the {end time} for {Han dynasty} has {capital} as {Chang'an} ?",
        "uid": 7645,
        "subgraph": "statement_property",
        "template_index": 4090,
        "question": "What is the end of time for Han Dynasty has a capital as Chang'an?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q7209 p:P36 ?s . ?s ps:P36 wd:Q6501000 . ?s pq:P582 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7209> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P36> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6501000> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "0195-01-01T00:00:00Z",
            "0009-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "In the Han Dynasty end of time, which had the capital Chang'an?",
        "simplified_query": "SELECT ?l WHERE { ?u property:end_time ?l . ?u property:capital resource:Chang'an . resource:Han_dynasty property:capital ?u }",
        "solved_answer": [
            "0195-01-01T00:00:00Z",
            "0009-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {end time} for {Titian} has {work location} as {Augsburg} ?",
        "uid": 9031,
        "subgraph": "statement_property",
        "template_index": 5476,
        "question": "what is the end time for Titian has a work location as Augsburg ?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q47551 p:P937 ?s . ?s ps:P937 wd:Q2749 . ?s pq:P582 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q47551> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P937> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2749> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1551-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "When does Titian stop working at Augsburg?",
        "simplified_query": "SELECT ?x WHERE { resource:Titian property:work_location ?u . ?u property:work_location resource:Augsburg . ?u property:end_time ?x }",
        "solved_answer": [
            "1551-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {start time} for {Nauru} has {member of} as {Asian Development Bank} ?",
        "uid": 4419,
        "subgraph": "statement_property",
        "template_index": 864,
        "question": "When did Nauru become a member of the Asian Development Bank?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q697 p:P463 ?s . ?s ps:P463 wd:Q188822 . ?s pq:P580 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q697> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P463> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q188822> .\n?statement <http://www.wikidata.org/entity/P580> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1991-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "Nauru joined the Asian Development Bank in what year?",
        "simplified_query": "SELECT ?w WHERE { resource:Nauru property:member_of ?d . ?d property:member_of resource:Asian_Development_Bank . ?d property:start_time ?w }",
        "solved_answer": [
            "1991-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {point in time} for {Dijon} has {population} as {155114} ?",
        "uid": 3769,
        "subgraph": "statement_property",
        "template_index": 214,
        "question": "When did Dijon have a population of 155114?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q7003 p:P1082 ?s . ?s ps:P1082 ?x filter(contains(?x,'155114')) . ?s pq:P585 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7003> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <155114> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "2015-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "What year did Dijon have a population of at least 155k?",
        "simplified_query": "SELECT ?r WHERE { ?i property:point_in_time ?r . FILTER ( ?x = 155114 ) . resource:Dijon property:population ?i . ?i property:population ?x }",
        "solved_answer": [
            "2015-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {point in time} for {Anna Wintour} has {significant event} as {childbirth} ?",
        "uid": 8981,
        "subgraph": "statement_property",
        "template_index": 5426,
        "question": "What significant event happened when Anna Wintour was experiencing childbirth?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q230744 p:P793 ?s . ?s ps:P793 wd:Q34581 . ?s pq:P585 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q230744> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P793> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q34581> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1985-01-01T00:00:00Z",
            "1987-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "What was a big event that occurred when Anna Wintour was experiencing childbirth?",
        "simplified_query": "SELECT ?o WHERE { ?r property:point_in_time ?o . ?r property:significant_event resource:childbirth . resource:Anna_Wintour property:significant_event ?r }",
        "solved_answer": [
            "1985-01-01T00:00:00Z",
            "1987-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {end time} for {Tiraspol} has {country} as {Soviet Union} ?",
        "uid": 5061,
        "subgraph": "statement_property",
        "template_index": 1506,
        "question": "When did Tiraspol leave the Soviet Union?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q132572 p:P17 ?s . ?s ps:P17 wd:Q15180 . ?s pq:P582 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q132572> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P17> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q15180> .\n?statement <http://www.wikidata.org/entity/P582> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1991-01-01T00:00:00Z",
            "1941-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "At what time did Tiraspol leave the Soviet Union?",
        "simplified_query": "SELECT ?q WHERE { ?e property:end_time ?q . ?e property:country resource:Soviet_Union . resource:Tiraspol property:country ?e }",
        "solved_answer": [
            "1991-01-01T00:00:00Z",
            "1941-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "what is the {academic major} for {Larry Page} has {educated at} as {Stanford University} ?",
        "uid": 5475,
        "subgraph": "statement_property",
        "template_index": 1920,
        "question": "What was the academic major of Larry Page who was educated at Stanford University?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q4934 p:P69 ?s . ?s ps:P69 wd:Q41506 . ?s pq:P812 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q4934> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q41506> .\n?statement <http://www.wikidata.org/entity/P812> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "http://www.wikidata.org/entity/Q21198"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "Larry page majored in what subject while at Stanford University?",
        "simplified_query": "SELECT ?b WHERE { ?c property:educated_at resource:Stanford_University . resource:Larry_Page property:educated_at ?c . ?c property:academic_major ?b }",
        "solved_answer": [
            "computer science"
        ]
    },
    {
        "NNQT_question": "what is the {point in time} for {Argentina} has {Human Development Index} as {0.827} ?",
        "uid": 3865,
        "subgraph": "statement_property",
        "template_index": 310,
        "question": "When was the Human Development Index recorded as 0.827 for Argentina?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q414 p:P1081 ?s . ?s ps:P1081 ?x filter(contains(?x,'0.827')) . ?s pq:P585 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q414> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1081> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <0.827> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "2009-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "When the Human Development Index was recorded at 0.827 for Argentina, what was the date?",
        "simplified_query": "SELECT ?i WHERE { ?q property:Human_Development_Index ?r . ?q property:point_in_time ?i . FILTER ( ?r = 0.827 ) . resource:Argentina property:Human_Development_Index ?q }",
        "solved_answer": [
            "2009-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "What is {award received} of {John de Mol} that is {point in time} is {2011-0-0} ?",
        "uid": 5703,
        "subgraph": "statement_property",
        "template_index": 2148,
        "question": "What award did John de Mol receive in 2011?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q470847 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2011')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q470847> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2011-0-0>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q47127131"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "in 2011 John de Mol won which award?",
        "simplified_query": "SELECT ?c WHERE { FILTER ( CONTAINS ( YEAR ( ?w ) , '2011' ) ) . resource:John_de_Mol property:award_received ?q . ?q property:point_in_time ?w . ?q property:award_received ?c }",
        "solved_answer": [
            "Presenter of the Year"
        ]
    },
    {
        "NNQT_question": "What is {award received} of {Gy\u00f6rgy Ligeti} that is {point in time} is {2000-0-0} ?",
        "uid": 7512,
        "subgraph": "statement_property",
        "template_index": 3957,
        "question": "What award did Gyorgy Ligeta receive on 2000-0-0?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q154331 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2000')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q154331> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2000-0-0>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q2569837"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "Gyorgy Ligeta was what award in 2000?",
        "simplified_query": "SELECT ?b WHERE { ?a property:award_received ?b . ?a property:point_in_time ?c . FILTER ( CONTAINS ( YEAR ( ?c ) , '2000' ) ) . resource:Gy\u00f6rgy_Ligeti property:award_received ?a }",
        "solved_answer": [
            "Wihuri Sibelius Prize"
        ]
    },
    {
        "NNQT_question": "What is {award received} of {\u00c1lvaro Siza Vieira} that is {point in time} is {1988-0-0} ?",
        "uid": 6966,
        "subgraph": "statement_property",
        "template_index": 3411,
        "question": "What award did Alvaro Siza Vieira receive in 1988?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q251365 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1988')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q251365> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1988-0-0>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q448315",
            "http://www.wikidata.org/entity/Q918055",
            "http://www.wikidata.org/entity/Q9031018"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "What was Alvaro Siza Viera awarded in 1988?",
        "simplified_query": "SELECT ?z WHERE { ?n property:award_received ?z . FILTER ( CONTAINS ( YEAR ( ?z ) , '1988' ) ) . ?n property:point_in_time ?z . resource:\u00c1lvaro_Siza_Vieira property:award_received ?n }",
        "solved_answer": [
            "Alvar Aalto Medal",
            "European Union Prize for Contemporary Architecture",
            "Gold Medal of Architecture (Spain)"
        ]
    },
    {
        "NNQT_question": "What is {spouse} of {Diane von F\u00fcrstenberg} that is {start time} is {1969-1-1} ?",
        "uid": 5390,
        "subgraph": "statement_property",
        "template_index": 1835,
        "question": "Who did Diane von Furstenberg marry in 1969MacGraw",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q272438 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1969')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q272438> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1969-1-1>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q117329"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "Name the person whom Diane von Furstenberg married during the year 1969.",
        "simplified_query": "SELECT ?t WHERE { ?k property:start_time ?y . ?k property:spouse ?t . resource:Diane_von_F\u00fcrstenberg property:spouse ?k . FILTER ( CONTAINS ( YEAR ( ?y ) , '1969' ) ) }",
        "solved_answer": [
            "Prince Egon von F\u00fcrstenberg"
        ]
    },
    {
        "NNQT_question": "What is {member of} of {Margaret Thatcher} that is {end time} is {2013-4-8} ?",
        "uid": 8139,
        "subgraph": "statement_property",
        "template_index": 4584,
        "question": "Was the period of Margaret Thatcher ended as member ended on 2013-4-8?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q7416 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2013')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7416> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P463> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P582> <2013-4-8>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q683120",
            "http://www.wikidata.org/entity/Q123885"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "Did Margaret Thatcher stop being a member on 2013/4/8?",
        "simplified_query": "SELECT ?y WHERE { ?r property:member_of ?y . resource:Margaret_Thatcher property:member_of ?r . FILTER ( CONTAINS ( YEAR ( ?o ) , '2013' ) ) . ?r property:end_time ?o }",
        "solved_answer": [
            "Privy Council of the United Kingdom",
            "Royal Society"
        ]
    },
    {
        "NNQT_question": "What is {award received} of {Arthur Rubinstein} that is {point in time} is {1961-1-1} ?",
        "uid": 4624,
        "subgraph": "statement_property",
        "template_index": 1069,
        "question": "What award did Arthur Rubinstein win on 1/1/1961?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q183182 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1961')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q183182> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1961-1-1>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q27575234"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "On January 1st, 1961, which award was granted to Arthur Rubinstein?",
        "simplified_query": "SELECT ?h WHERE { ?f property:award_received ?h . FILTER ( CONTAINS ( YEAR ( ?d ) , '1961' ) ) . resource:Arthur_Rubinstein property:award_received ?f . ?f property:point_in_time ?d }",
        "solved_answer": [
            "Royal Philharmonic Society Gold Medal"
        ]
    },
    {
        "NNQT_question": "What is {award received} of {Anne, Princess Royal} that is {point in time} is {1969-0-0} ?",
        "uid": 9390,
        "subgraph": "statement_property",
        "template_index": 5835,
        "question": "What was the award received by Anne, Princess Royal that is point in time was 1969-0-0?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q151754 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1969')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q151754> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1969-0-0>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q23773332",
            "http://www.wikidata.org/entity/Q93960",
            "http://www.wikidata.org/entity/Q17505835"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "Anne, Princess Royal, received which award on 1969-0-0?",
        "simplified_query": "SELECT ?m WHERE { ?n property:point_in_time ?u . ?n property:award_received ?m . FILTER ( CONTAINS ( YEAR ( ?u ) , '1969' ) ) . resource:Anne,_Princess_Royal property:award_received ?n }",
        "solved_answer": [
            "Grand Cross of the Order of the White Rose of Finland",
            "Royal Family Order of Elizabeth II",
            "Great Golden Medal of Honour for Services to the Republic of Austria"
        ]
    },
    {
        "NNQT_question": "What is {award received} of {John Berryman} that is {point in time} is {1969-1-1} ?",
        "uid": 6618,
        "subgraph": "statement_property",
        "template_index": 3063,
        "question": "What award John Berryman received at 1969-1-1?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q522192 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1969')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q522192> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1969-1-1>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q194944",
            "http://www.wikidata.org/entity/Q572316"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "In the year 1969 which award did John Berryman received?",
        "simplified_query": "SELECT ?r WHERE { ?f property:award_received ?r . ?f property:point_in_time ?h . FILTER ( CONTAINS ( YEAR ( ?h ) , '1969' ) ) . resource:John_Berryman property:award_received ?f }",
        "solved_answer": [
            "Bollingen Prize",
            "National Book Award"
        ]
    },
    {
        "NNQT_question": "What is {head of state} of {Georgia} that is {end time} is {2004-1-25} ?",
        "uid": 7547,
        "subgraph": "statement_property",
        "template_index": 3992,
        "question": "Who was the head of State of Georgia on January 25th, 2004?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q230 p:P35 ?s . ?s ps:P35 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2004')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q230> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P35> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P582> <2004-1-25>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q229493"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "On January 25, 2004, who was the head of the State of Georgia?",
        "simplified_query": "SELECT ?v WHERE { FILTER ( CONTAINS ( YEAR ( ?y ) , '2004' ) ) . resource:Georgia property:head_of_state ?s . ?s property:head_of_state ?v . ?s property:end_time ?y }",
        "solved_answer": [
            "Nino Burjanadze"
        ]
    },
    {
        "NNQT_question": "What is {award received} of {Amnesty International} that is {point in time} is {1988-0-0} ?",
        "uid": 4437,
        "subgraph": "statement_property",
        "template_index": 882,
        "question": "What award did Amnesty International receive in 1988?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q42970 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1988')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q42970> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1988-0-0>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q20230026"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "In 1988 Amnesty Intl was given what award?",
        "simplified_query": "SELECT ?k WHERE { FILTER ( CONTAINS ( YEAR ( ?s ) , '1988' ) ) . ?j property:point_in_time ?s . resource:Amnesty_International property:award_received ?j . ?j property:award_received ?k }",
        "solved_answer": [
            "Hans B\u00f6ckler Preis"
        ]
    },
    {
        "NNQT_question": "What is {nominated for} of {Ian McEwan} that is {point in time} is {2007-0-0} ?",
        "uid": 7620,
        "subgraph": "statement_property",
        "template_index": 4065,
        "question": "What was Ian McEwan nominated for in 2007?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q190379 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'2007')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q190379> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <2007-0-0>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q2052291",
            "http://www.wikidata.org/entity/Q160082"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "Ian McEwan was nominated for what in 2007?",
        "simplified_query": "SELECT ?j WHERE { ?j property:point_in_time ?x . resource:Ian_McEwan property:nominated_for ?j . ?j property:nominated_for ?j . FILTER ( CONTAINS ( YEAR ( ?x ) , '2007' ) ) }",
        "solved_answer": [
            "International Booker Prize",
            "Booker Prize"
        ]
    },
    {
        "NNQT_question": "What is {position held} of {Lady Jane Grey} that is {of} is {Kingdom of England} ?",
        "uid": 3707,
        "subgraph": "statement_property",
        "template_index": 152,
        "question": "What position does Lady Jane Grey hold in the Kindom of England?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q162356 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P642 wd:Q179876 }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q162356> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P39> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P642> <http://wikidata.dbpedia.org/resource/Q179876>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q18810062"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "in which position Lady Jane Grey hold in the Kindom of England",
        "simplified_query": "SELECT ?y WHERE { ?a property:position_held ?y . resource:Lady_Jane_Grey property:position_held ?a . ?a property:of resource:Kingdom_of_England }",
        "solved_answer": [
            "monarch of England"
        ]
    },
    {
        "NNQT_question": "What is {spouse} of {Ruby Dee} that is {end time} is {2005-1-1} ?",
        "uid": 5028,
        "subgraph": "statement_property",
        "template_index": 1473,
        "question": "Who was Ruby Dee's spouse when their marriage ended in 2005?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q234360 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter(contains(YEAR(?x),'2005')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q234360> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P582> <2005-1-1>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q515632"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "What was the name of Ruby Dee's spouse when their marriage ended in 2005?",
        "simplified_query": "SELECT ?d WHERE { resource:Ruby_Dee property:spouse ?i . ?i property:spouse ?d . ?i property:end_time ?q . FILTER ( CONTAINS ( YEAR ( ?q ) , '2005' ) ) }",
        "solved_answer": [
            "Ossie Davis"
        ]
    },
    {
        "NNQT_question": "What is {educated at} of {Xi Jinping} that is {start time} is {1975-0-0} ?",
        "uid": 3730,
        "subgraph": "statement_property",
        "template_index": 175,
        "question": "When was Xi Jinping educated in year 1975?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q15031 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1975')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q15031> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1975-0-0>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q16955"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "Was Xi Jinping educated in 1975?",
        "simplified_query": "SELECT ?r WHERE { ?t property:educated_at ?r . resource:Xi_Jinping property:educated_at ?t . ?t property:start_time ?k . FILTER ( CONTAINS ( YEAR ( ?k ) , '1975' ) ) }",
        "solved_answer": [
            "Tsinghua University"
        ]
    }
]