[
    {
        "NNQT_question": "What is the {practiced by} and the {main regulatory text} of {Taoism} ?",
        "uid": 9928,
        "subgraph": "two intentions right subgraph",
        "template_index": 269,
        "question": "What is the practice of Taoism and it's main regulatory text?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q9598 wdt:P3095 ?ans_1 . wd:Q9598 wdt:P92 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q9598> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3095> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q9598> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P92> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q134425",
            "http://www.wikidata.org/entity/Q1165430",
            "http://www.wikidata.org/entity/Q101097348",
            "http://www.wikidata.org/entity/Q116865146"
        ],
        "template_id": "1",
        "paraphrased_question": "What is the main regulatory text and the practice of Taoism",
        "simplified_query": "SELECT ?a ?f WHERE { resource:Taoism property:practiced_by ?a . resource:Taoism property:main_regulatory_text ?f }",
        "solved_answer": [
            "Tao Te Ching",
            "daoshi",
            "Taoist nun",
            "Taoist"
        ]
    },
    {
        "NNQT_question": "What is the {country} for {diplomatic relation} of {Soviet Union}",
        "uid": 20592,
        "subgraph": "simple question right",
        "template_index": 938,
        "question": "Name the country maintaining the diplomatic relationship with Soviet Union",
        "sparql_wikidata": " select distinct ?obj where { wd:Q15180 wdt:P530 ?obj . ?obj wdt:P31 wd:Q6256 } ",
        "sparql_dbpedia18": "select distinct ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q15180> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P530> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?obj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q6256> } ",
        "template": " <S P ?O ; ?O instanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q686",
            "http://www.wikidata.org/entity/Q769",
            "http://www.wikidata.org/entity/Q801",
            "http://www.wikidata.org/entity/Q819",
            "http://www.wikidata.org/entity/Q833",
            "http://www.wikidata.org/entity/Q843",
            "http://www.wikidata.org/entity/Q916",
            "http://www.wikidata.org/entity/Q928",
            "http://www.wikidata.org/entity/Q1008",
            "http://www.wikidata.org/entity/Q16",
            "http://www.wikidata.org/entity/Q17",
            "http://www.wikidata.org/entity/Q20",
            "http://www.wikidata.org/entity/Q30",
            "http://www.wikidata.org/entity/Q35",
            "http://www.wikidata.org/entity/Q43",
            "http://www.wikidata.org/entity/Q148",
            "http://www.wikidata.org/entity/Q183",
            "http://www.wikidata.org/entity/Q218",
            "http://www.wikidata.org/entity/Q241"
        ],
        "template_id": "1",
        "paraphrased_question": "Title the nation keeping up the conciliatory relationship with Soviet Union",
        "simplified_query": "SELECT DISTINCT ?g WHERE { ?g rdf:type ontology:country . resource:Soviet_Union property:diplomatic_relation ?g }",
        "solved_answer": [
            "Vanuatu",
            "Grenada",
            "Israel",
            "Laos",
            "Malaysia",
            "Pakistan",
            "Angola",
            "Philippines",
            "Ivory Coast",
            "Canada",
            "Japan",
            "Norway",
            "United States of America",
            "Denmark",
            "Turkey",
            "People's Republic of China",
            "Germany",
            "Romania",
            "Cuba"
        ]
    },
    {
        "NNQT_question": "What is {work} of {Annibale Carracci}, that has {patron saint} is {Luke the Evangelist} ?",
        "uid": 12702,
        "subgraph": "right-subgraph",
        "template_index": 4631,
        "question": "What is the work of Annibale Carracci, whose patron saint is Luke the Evangelist?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7824 wdt:P106 ?answer . ?answer wdt:P417 wd:Q128538}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7824> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P417> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q128538> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q1028181"
        ],
        "template_id": "1",
        "paraphrased_question": "What is the work of Annibale Carracci, whose buyer saint is Luke the Evangelist?",
        "simplified_query": "SELECT ?n WHERE { ?n property:patron_saint resource:Luke_the_Evangelist . resource:Annibale_Carracci property:occupation ?n }",
        "solved_answer": [
            "painter"
        ]
    },
    {
        "NNQT_question": "What is {confused with} of {semi-trailer truck}, that has {born on} is {1977-2-1} ?",
        "uid": 12003,
        "subgraph": "right-subgraph",
        "template_index": 128,
        "question": "What is confused with semi-trailer truck born on 1977-2-1?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1936841 wdt:P1889 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1977'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1936841> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1889>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P569> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1977-2-1> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q1862004"
        ],
        "template_id": "1",
        "paraphrased_question": "What is confounded with semi-trailer truck born on 1977-2-1?",
        "simplified_query": "SELECT ?a WHERE { ?a property:date_of_birth ?c . FILTER ( CONTAINS ( YEAR ( ?c ) , '1977' ) ) . resource:semi-trailer_truck property:different_from ?a }",
        "solved_answer": [
            "Robert Traylor"
        ]
    },
    {
        "NNQT_question": "What is {isn't} of {Dave Marsh}, that has {biological sex} is {male} ?",
        "uid": 13823,
        "subgraph": "right-subgraph",
        "template_index": 584,
        "question": "What isn't of Dave March's thats biological sex is male?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q753476 wdt:P1889 ?answer . ?answer wdt:P21 wd:Q6581097}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q753476> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1889>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P21> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6581097> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q1173278"
        ],
        "template_id": "1",
        "paraphrased_question": "What isn't of Dave March's thats organic sex is male?",
        "simplified_query": "SELECT ?b WHERE { ?b property:sex_or_gender resource:male . resource:Dave_Marsh property:different_from ?b }",
        "solved_answer": [
            "David Marsh"
        ]
    },
    {
        "NNQT_question": "What is the {located in or next to body of water} and the {located in the administrative territorial entity} of {Glasgow} ?",
        "uid": 9777,
        "subgraph": "two intentions right subgraph",
        "template_index": 278,
        "question": "Where is Glasgow nearest body of water located and where is the administrative territorial entity located?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q4093 wdt:P206 ?ans_1 . wd:Q4093 wdt:P131 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q4093> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P206> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q4093> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P131> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q55934339",
            "http://www.wikidata.org/entity/Q19721",
            "http://www.wikidata.org/entity/Q183161"
        ],
        "template_id": "1",
        "paraphrased_question": "What body of water is nearest to Glasgow and where is the administrative territorial entity located?",
        "simplified_query": "SELECT ?j ?m WHERE { resource:Glasgow property:located_in_or_next_to_body_of_water ?j . resource:Glasgow property:located_in_the_administrative_territorial_entity ?m }",
        "solved_answer": [
            "Glasgow City",
            "River Clyde",
            "River Kelvin"
        ]
    },
    {
        "NNQT_question": "Did {Seattle} {official symbol} {Bald Eagle}?",
        "uid": 393,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 393,
        "question": "Was the official symbol of Seattle the bald eagle?",
        "sparql_wikidata": "ASK WHERE { wd:Q5083 wdt:P2238 wd:Q127216 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5083> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2238> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q127216>. } ",
        "template": "Ask (ent-pred-obj`)",
        "answer": [
            false
        ],
        "template_id": "1",
        "paraphrased_question": "Is the bald eagle the official symbol of Seattle?",
        "simplified_query": "ASK WHERE { resource:Seattle property:official_symbol resource:bald_eagle }",
        "solved_answer": [
            false
        ]
    },
    {
        "NNQT_question": "What is the {native language} and the {languages spoken, written or signed} of {Robert_Plant} ?",
        "uid": 9542,
        "subgraph": "two intentions right subgraph",
        "template_index": 369,
        "question": "What is the native language and languages spoken, written, or signed of Robert Plant?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q428223 wdt:P103 ?ans_1 . wd:Q428223 wdt:P1412 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q428223> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P103> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q428223> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1412> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q1860"
        ],
        "template_id": "1",
        "paraphrased_question": "What is Robert Plant's native language and languages that are spoken, written or signed?",
        "simplified_query": "SELECT ?i ?m WHERE { resource:Robert_Plant property:native_language ?i . resource:Robert_Plant property:languages_spoken,_written_or_signed ?m }",
        "solved_answer": [
            "English"
        ]
    },
    {
        "NNQT_question": "Give me {social networking service} that contains the word {yak} in their name",
        "uid": 23561,
        "subgraph": "string matching simple contains word",
        "template_index": 3693,
        "question": "Tell me social networking service whose name has the word yak in it",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3220391 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yak')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3220391>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'yak')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; contains word >",
        "answer": [
            "http://www.wikidata.org/entity/Q28666316",
            "http://www.wikidata.org/entity/Q18216046"
        ],
        "template_id": "1",
        "paraphrased_question": "Tell me about the social networking service whose name contains the word yak",
        "simplified_query": "SELECT DISTINCT ?q WHERE { ?q rdf:type ontology:social_networking_service . FILTER ( CONTAINS ( LCASE ( ?q ) , 'yak' ) ) }",
        "solved_answer": [
            "YaKlass",
            "Yik Yak"
        ]
    },
    {
        "NNQT_question": "What is {place of grave} of {Makarios III}, that has {founded} is {1001-1-17} ?",
        "uid": 14035,
        "subgraph": "right-subgraph",
        "template_index": 1544,
        "question": "Where is the place of grave of Makarios III, founded in 1001-1-17?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q153509 wdt:P119 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1001'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q153509> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P119>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P571> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1001-1-17> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q225373"
        ],
        "template_id": "1",
        "paraphrased_question": "Where is the area of grave of Makarios III, established in 1001-1-17?",
        "simplified_query": "SELECT ?c WHERE { ?c property:inception ?e . FILTER ( CONTAINS ( YEAR ( ?e ) , '1001' ) ) . resource:Makarios_III property:place_of_burial ?c }",
        "solved_answer": [
            "Kykkos Monastery"
        ]
    },
    {
        "NNQT_question": "What is the {mascot} for {mascot} of {Iron Maiden}",
        "uid": 20644,
        "subgraph": "simple question right",
        "template_index": 990,
        "question": "Name the mascot for Iron Maiden.",
        "sparql_wikidata": " select distinct ?obj where { wd:Q42482 wdt:P822 ?obj . ?obj wdt:P31 wd:Q18670161 } ",
        "sparql_dbpedia18": "select distinct ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q42482> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P822> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?obj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q18670161> } ",
        "template": " <S P ?O ; ?O instanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q259261"
        ],
        "template_id": "1",
        "paraphrased_question": "Title the mascot for Press Maiden.",
        "simplified_query": "SELECT DISTINCT ?w WHERE { resource:Iron_Maiden property:mascot ?w . ?w rdf:type ontology:mascot }",
        "solved_answer": [
            "Eddie the Head"
        ]
    },
    {
        "NNQT_question": "What is {higher taxon} of {budgerigar}, that has {common name} is {Budgerigar} ?",
        "uid": 13488,
        "subgraph": "right-subgraph",
        "template_index": 381,
        "question": "What is the name of the larger taxonomic group that includes budgerigar but is also commonly known and conflated with budgerigar?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q121221 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'Budgerigar'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q121221> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P171>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1843> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <Budgerigar> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q10792667"
        ],
        "template_id": "1",
        "paraphrased_question": "What is the name of the large taxonomic crew that consists of budgerigar but is also commonly regarded and conflated with budgerigar?",
        "simplified_query": "SELECT ?q WHERE { FILTER ( CONTAINS ( ?k , 'Budgerigar' ) ) . resource:budgerigar property:parent_taxon ?q . ?q property:taxon_common_name ?k }",
        "solved_answer": [
            "Melopsittacus"
        ]
    },
    {
        "NNQT_question": "Give me {news magazine} that contains the word {weekly} in their name",
        "uid": 23380,
        "subgraph": "string matching simple contains word",
        "template_index": 1636,
        "question": "Tell me news magazine whose name has the word weekly in it.",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1684600 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'weekly')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1684600>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'weekly')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; contains word >",
        "answer": [
            "http://www.wikidata.org/entity/Q28430973",
            "http://www.wikidata.org/entity/Q17866767"
        ],
        "template_id": "1",
        "paraphrased_question": "Which news magazine has the word weekly in it?W",
        "simplified_query": "SELECT DISTINCT ?j WHERE { FILTER ( CONTAINS ( LCASE ( ?j ) , 'weekly' ) ) . ?j rdf:type ontology:print_news_magazine }",
        "solved_answer": [
            "Weekly",
            "Weekly Register"
        ]
    },
    {
        "NNQT_question": "What is the {residence} and the {occupation} of {Christopher_Walken} ?",
        "uid": 9841,
        "subgraph": "two intentions right subgraph",
        "template_index": 334,
        "question": "Where does Christopher Walken reside and what is his occupation?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q185051 wdt:P551 ?ans_1 . wd:Q185051 wdt:P106 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q185051> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P551> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q185051> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q60",
            "http://www.wikidata.org/entity/Q28389",
            "http://www.wikidata.org/entity/Q33999",
            "http://www.wikidata.org/entity/Q948329",
            "http://www.wikidata.org/entity/Q2259451",
            "http://www.wikidata.org/entity/Q2405480",
            "http://www.wikidata.org/entity/Q2526255",
            "http://www.wikidata.org/entity/Q4610556",
            "http://www.wikidata.org/entity/Q5716684",
            "http://www.wikidata.org/entity/Q10798782",
            "http://www.wikidata.org/entity/Q10800557"
        ],
        "template_id": "1",
        "paraphrased_question": "What does Christopher Walken do and where does he live?",
        "simplified_query": "SELECT ?i ?w WHERE { resource:Christopher_Walken property:occupation ?w . resource:Christopher_Walken property:residence ?i }",
        "solved_answer": [
            "New York City",
            "screenwriter",
            "actor",
            "character actor",
            "stage actor",
            "voice actor",
            "film director",
            "model",
            "dancer",
            "television actor",
            "film actor"
        ]
    },
    {
        "NNQT_question": "What is {employment} of {Jos\u00e9 Mujica}, that has {field of this employment} is {agriculture} ?",
        "uid": 11824,
        "subgraph": "right-subgraph",
        "template_index": 38,
        "question": "What is the employment of Jos\u00e9 Mujica whose field of this employment is agriculture ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q9094 wdt:P106 ?answer . ?answer wdt:P425 wd:Q11451}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q9094> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P425> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q11451> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q131512"
        ],
        "template_id": "1",
        "paraphrased_question": "What is Jos\u00e9 Mujica's job, whose field of work is agriculture?",
        "simplified_query": "SELECT ?f WHERE { resource:Jos\u00e9_Mujica property:occupation ?f . ?f property:field_of_this_occupation resource:agriculture }",
        "solved_answer": [
            "farmer"
        ]
    },
    {
        "NNQT_question": "What is the {Academy Awards} for {nominated for} of {Vanessa Redgrave}",
        "uid": 23004,
        "subgraph": "simple question right",
        "template_index": 2065,
        "question": "Vanessa Redgrave was nominated for the Academy Awards.",
        "sparql_wikidata": " select distinct ?obj where { wd:Q347879 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q19020 } ",
        "sparql_dbpedia18": "select distinct ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q347879> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?obj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q19020> } ",
        "template": " <S P ?O ; ?O instanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q103618",
            "http://www.wikidata.org/entity/Q106301"
        ],
        "template_id": "1",
        "paraphrased_question": "Vanessa Redgrave was assigned for the Foundation Grants.",
        "simplified_query": "SELECT DISTINCT ?c WHERE { resource:Vanessa_Redgrave property:nominated_for ?c . ?c rdf:type ontology:Academy_Awards }",
        "solved_answer": [
            "Academy Award for Best Actress",
            "Academy Award for Best Supporting Actress"
        ]
    },
    {
        "NNQT_question": "What is {family member} of {Luca Signorelli}, that has {profession} is {writer} ?",
        "uid": 13671,
        "subgraph": "right-subgraph",
        "template_index": 873,
        "question": "Which family member of Luca Signorelli is a writer by profession? \n\nName the family member of Luca Signorelli who is a writer by profession. \n\nWhich of Luca Signorelli's relatives has a career in writing? \n\nWho is the relative of Luca Signorelli who has a career in writing?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7031 wdt:P1038 ?answer . ?answer wdt:P106 wd:Q36180}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7031> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1038>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q36180> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q128027"
        ],
        "template_id": "1",
        "paraphrased_question": "Which family member of Luca Signorelli is a creator via profession? Name the household member of Luca Signorelli who is a creator by using profession. Which of Luca Signorelli's household has a career in writing? Who is the relative of Luca Signorelli who has a profession in writing?",
        "simplified_query": "SELECT ?p WHERE { ?p property:occupation resource:writer . resource:Luca_Signorelli property:relative ?p }",
        "solved_answer": [
            "Giorgio Vasari"
        ]
    },
    {
        "NNQT_question": "Did {Marilyn_Monroe} {languages spoken, written or signed} {Romance languages}?",
        "uid": 360,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 360,
        "question": "Did Marilyn Monroe speak Romance languages?",
        "sparql_wikidata": "ASK WHERE { wd:Q4616 wdt:P1412 wd:Q19814 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q4616> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1412> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q19814>. } ",
        "template": "Ask (ent-pred-obj`)",
        "answer": [
            false
        ],
        "template_id": "1",
        "paraphrased_question": "Was Marilyn Monroe a speaker of any of the Romance languages?",
        "simplified_query": "ASK WHERE { resource:Marilyn_Monroe property:languages_spoken,_written_or_signed resource:Romance_languages }",
        "solved_answer": [
            false
        ]
    },
    {
        "NNQT_question": "Did {Kanye_West} {genre} {gangsta rap}?",
        "uid": 411,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 411,
        "question": "Did Kanye West write metal gangsta rap?",
        "sparql_wikidata": "ASK WHERE { wd:Q15935 wdt:P136 wd:Q753679 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q15935> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P136> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q753679>. } ",
        "template": "Ask (ent-pred-obj`)",
        "answer": [
            false
        ],
        "template_id": "1",
        "paraphrased_question": "Was metal gangsta rap written by Kanye West?",
        "simplified_query": "ASK WHERE { resource:Kanye_West property:genre resource:gangsta_rap }",
        "solved_answer": [
            false
        ]
    }
]