[
    {
        "NNQT_question": "What is the {canal} for {terminus location} of {Bruges}",
        "uid": 20868,
        "subgraph": "simple question left",
        "template_index": 1214,
        "question": "Name the terminal point for Bruges.",
        "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P609 wd:Q12994 . ?sbj wdt:P31 wd:Q12284 } ",
        "sparql_dbpedia18": "select distinct ?subj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?subj . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P609> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q12994> . ?subj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q12284> } ",
        "template": "<?S P O ; ?S InstanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q512254",
            "http://www.wikidata.org/entity/Q2111729"
        ],
        "template_id": "2",
        "paraphrased_question": "Title the terminal point for Bruges.",
        "simplified_query": "SELECT DISTINCT ?l WHERE { ?l rdf:type ontology:canal . ?l property:terminus_location resource:Bruges }",
        "solved_answer": [
            "Boudewijnkanaal",
            "Damme Canal"
        ]
    },
    {
        "NNQT_question": "Give me {geographic region} that starts with {'\u0161'}",
        "uid": 24147,
        "subgraph": "string matching simple contains word",
        "template_index": 3116,
        "question": "what is geographic region that starts with s",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q82794 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), '\u0161')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q82794>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), '\u0161')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q261430",
            "http://www.wikidata.org/entity/Q11030537",
            "http://www.wikidata.org/entity/Q899289",
            "http://www.wikidata.org/entity/Q2381527"
        ],
        "template_id": "2",
        "paraphrased_question": "what is geographic area that begins with s",
        "simplified_query": "SELECT DISTINCT ?m WHERE { ?m rdf:type ontology:geographic_region . FILTER ( STRSTARTS ( LCASE ( ?m ) , '\u0161' ) ) }",
        "solved_answer": [
            "\u0160umadija",
            "\u0160ilin\u0117",
            "\u0160ajka\u0161ka",
            "\u0160t\u00fdrsko ji\u017en\u00ed (Rakousko)"
        ]
    },
    {
        "NNQT_question": "Give me {federal state} that starts with {'s'}",
        "uid": 24745,
        "subgraph": "string matching simple contains word",
        "template_index": 1605,
        "question": "Tell me the federal states that starts with the letter s",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43702 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q43702>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q39",
            "http://www.wikidata.org/entity/Q12183911"
        ],
        "template_id": "2",
        "paraphrased_question": "Disclose me the federal states that begins with the letter s",
        "simplified_query": "SELECT DISTINCT ?m WHERE { ?m rdf:type ontology:federation . FILTER ( STRSTARTS ( LCASE ( ?m ) , 's' ) ) }",
        "solved_answer": [
            "Switzerland",
            "Syrian Federation"
        ]
    },
    {
        "NNQT_question": "What is {continues from} of {county seat for} of {Erfurt} ?",
        "uid": 17008,
        "subgraph": "right-subgraph",
        "template_index": 7091,
        "question": "Mention the county seat of Erfurt",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1729 wdt:P1376 ?X . ?X wdt:P1365 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1729> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1376>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1365> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q48054",
            "http://www.wikidata.org/entity/Q48060",
            "http://www.wikidata.org/entity/Q48066",
            "http://www.wikidata.org/entity/Q48079",
            "http://www.wikidata.org/entity/Q48106",
            "http://www.wikidata.org/entity/Q873634"
        ],
        "template_id": "2",
        "paraphrased_question": "Specify the district situate of Erfurt",
        "simplified_query": "SELECT ?r WHERE { resource:Erfurt property:capital_of ?l . ?l property:replaces ?r }",
        "solved_answer": [
            "Erfurt District",
            "Gera District",
            "Halle District",
            "Leipzig District",
            "Suhl District",
            "Thuringia"
        ]
    },
    {
        "NNQT_question": "What is {human population} of {place of origin} of {culinary mustard} ?",
        "uid": 14553,
        "subgraph": "right-subgraph",
        "template_index": 1662,
        "question": "WHAT IS THE HUMAN POPULATION IN PLACE OF ORIGIN OF CULINARY MUSTARD ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q131748 wdt:P495 ?X . ?X wdt:P1082 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q131748> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P495>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "58850717"
        ],
        "template_id": "2",
        "paraphrased_question": "WHAT IS THE HUMAN Populace IN Put OF Root OF CULINARY MUSTARD ?",
        "simplified_query": "SELECT ?h WHERE { resource:mustard property:country_of_origin ?d . ?d property:population ?h }",
        "solved_answer": [
            "58850717"
        ]
    },
    {
        "NNQT_question": "Give me {space observatory} that starts with {'x'}",
        "uid": 24577,
        "subgraph": "string matching simple contains word",
        "template_index": 1133,
        "question": "What are the space observatory which start with the letter x",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q148578 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q148578>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q63992302",
            "http://www.wikidata.org/entity/Q268447",
            "http://www.wikidata.org/entity/Q693861"
        ],
        "template_id": "2",
        "paraphrased_question": "what are the space observatory which begins with  the letter x",
        "simplified_query": "SELECT DISTINCT ?y WHERE { FILTER ( STRSTARTS ( LCASE ( ?y ) , 'x' ) ) . ?y rdf:type ontology:space_observatory }",
        "solved_answer": [
            "XPoSat",
            "XEUS",
            "XMM-Newton"
        ]
    },
    {
        "NNQT_question": "What is {has translation} of {originating source} of {L\u00ea dynasty} ?",
        "uid": 16987,
        "subgraph": "right-subgraph",
        "template_index": 28,
        "question": "What is  translation for originating source of L\u00ea dynasty ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q10800789 wdt:P248 ?X . ?X wdt:P747 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q10800789> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P248>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P747> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q867541",
            "http://www.wikidata.org/entity/Q5375740",
            "http://www.wikidata.org/entity/Q5375741",
            "http://www.wikidata.org/entity/Q5375742",
            "http://www.wikidata.org/entity/Q5375743",
            "http://www.wikidata.org/entity/Q15987490",
            "http://www.wikidata.org/entity/Q19800783",
            "http://www.wikidata.org/entity/Q20096917",
            "http://www.wikidata.org/entity/Q56605362",
            "http://www.wikidata.org/entity/Q84229706",
            "http://www.wikidata.org/entity/Q84234065",
            "http://www.wikidata.org/entity/Q84236396",
            "http://www.wikidata.org/entity/Q84237483",
            "http://www.wikidata.org/entity/Q84246840",
            "http://www.wikidata.org/entity/Q84248963",
            "http://www.wikidata.org/entity/Q84250069",
            "http://www.wikidata.org/entity/Q111972773",
            "http://www.wikidata.org/entity/Q122881796"
        ],
        "template_id": "2",
        "paraphrased_question": "What is interpretation for beginning source of L\u00ea tradition ?",
        "simplified_query": "SELECT ?i WHERE { ?g property:edition ?i . resource:L\u00ea_dynasty property:stated_in ?g }",
        "solved_answer": [
            "Encyclop\u00e6dia Britannica 11th edition",
            "Encyclop\u00e6dia Britannica First Edition",
            "Encyclop\u00e6dia Britannica Online",
            "Encyclop\u00e6dia Britannica Second Edition",
            "Encyclop\u00e6dia Britannica Third Edition",
            "1922 Encyclop\u00e6dia Britannica",
            "Encyclop\u00e6dia Britannica Fifth Edition",
            "Encyclop\u00e6dia Britannica Ninth Edition",
            "Encyclop\u00e6dia Britannica (15th edition, 1974 - 2010)",
            "Encyclop\u00e6dia Britannica Fourth Edition",
            "Encyclop\u00e6dia Britannica Sixth Edition",
            "Encyclop\u00e6dia Britannica Seventh Edition",
            "Encyclop\u00e6dia Britannica Eighth Edition",
            "Encyclop\u00e6dia Britannica Tenth Edition",
            "Encyclop\u00e6dia Britannica Thirteenth Edition",
            "Encyclop\u00e6dia Britannica Fourteenth Edition",
            "Children's Britannica",
            "The New Encyclopedia Britannica (15th Edition)"
        ]
    },
    {
        "NNQT_question": "What is {state headed by} of {is in the town of} of {Caraga} ?",
        "uid": 15295,
        "subgraph": "right-subgraph",
        "template_index": 4013,
        "question": "who state headed by  the town of caraga ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q13704 wdt:P131 ?X . ?X wdt:P35 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q13704> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P131>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P35> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q983324"
        ],
        "template_id": "2",
        "paraphrased_question": "who state headed by the town of caraga ?",
        "simplified_query": "SELECT ?h WHERE { ?r property:head_of_state ?h . resource:Caraga property:located_in_the_administrative_territorial_entity ?r }",
        "solved_answer": [
            "Bongbong Marcos"
        ]
    },
    {
        "NNQT_question": "What is {sister city} of {birth place} of {Lisa Nowak} ?",
        "uid": 15387,
        "subgraph": "right-subgraph",
        "template_index": 3135,
        "question": "Name the sister city of the place where Lisa Nowak was born.",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q49264 wdt:P19 ?X . ?X wdt:P190 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q49264> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q90",
            "http://www.wikidata.org/entity/Q220",
            "http://www.wikidata.org/entity/Q240",
            "http://www.wikidata.org/entity/Q956",
            "http://www.wikidata.org/entity/Q1524",
            "http://www.wikidata.org/entity/Q1861",
            "http://www.wikidata.org/entity/Q2844",
            "http://www.wikidata.org/entity/Q3110",
            "http://www.wikidata.org/entity/Q3624",
            "http://www.wikidata.org/entity/Q3640",
            "http://www.wikidata.org/entity/Q3718",
            "http://www.wikidata.org/entity/Q3761",
            "http://www.wikidata.org/entity/Q3926",
            "http://www.wikidata.org/entity/Q8684",
            "http://www.wikidata.org/entity/Q188304"
        ],
        "template_id": "2",
        "paraphrased_question": "Title the sister city of the put where Lisa Nowak was born.",
        "simplified_query": "SELECT ?s WHERE { ?t property:twinned_administrative_body ?s . resource:Lisa_Nowak property:place_of_birth ?t }",
        "solved_answer": [
            "Paris",
            "Rome",
            "Brussels-Capital Region",
            "Beijing",
            "Athens",
            "Bangkok",
            "Bras\u00edlia",
            "San Salvador",
            "Addis Ababa",
            "Ankara",
            "Dakar",
            "Accra",
            "Pretoria",
            "Seoul",
            "Sunderland"
        ]
    },
    {
        "NNQT_question": "What is {genetic association} of {murder method} of {Alexander Woollcott} ?",
        "uid": 17143,
        "subgraph": "right-subgraph",
        "template_index": 4793,
        "question": "WHICH IS THE GENETIC ASSOCIATION OF MURDER METHOD OF ALEXANDER WOOLLCOTT",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q361859 wdt:P509 ?X . ?X wdt:P2293 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q361859> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P509>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2293> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q18037015",
            "http://www.wikidata.org/entity/Q18042029",
            "http://www.wikidata.org/entity/Q18053521",
            "http://www.wikidata.org/entity/Q18056131"
        ],
        "template_id": "2",
        "paraphrased_question": "WHICH IS THE Hereditary Affiliation OF Kill Strategy OF ALEXANDER WOOLLCOTT",
        "simplified_query": "SELECT ?q WHERE { resource:Alexander_Woollcott property:cause_of_death ?b . ?b property:genetic_association ?q }",
        "solved_answer": [
            "PLCL2",
            "WDR12",
            "PHACTR1",
            "MIA3"
        ]
    },
    {
        "NNQT_question": "Give me {mantra} that starts with {'m'}",
        "uid": 24552,
        "subgraph": "string matching simple contains word",
        "template_index": 3900,
        "question": "What are the mantra which start with the letter M",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131510 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q131510>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'm')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q3047244",
            "http://www.wikidata.org/entity/Q10514119"
        ],
        "template_id": "2",
        "paraphrased_question": "What mantra starts with \"m\"?",
        "simplified_query": "SELECT DISTINCT ?m WHERE { FILTER ( STRSTARTS ( LCASE ( ?m ) , 'm' ) ) . ?m rdf:type ontology:mantra }",
        "solved_answer": [
            "Mantra of Light",
            "Medicine Master's Initiation Mantra"
        ]
    },
    {
        "NNQT_question": "What is {human population} of {county seat for} of {Baghdad} ?",
        "uid": 16439,
        "subgraph": "right-subgraph",
        "template_index": 1898,
        "question": "How are called the people living around Baghdad?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1530 wdt:P1376 ?X . ?X wdt:P1082 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1530> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1376>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "38274618"
        ],
        "template_id": "2",
        "paraphrased_question": "What do you call people living in Baghdad?",
        "simplified_query": "SELECT ?a WHERE { ?s property:population ?a . resource:Baghdad property:capital_of ?s }",
        "solved_answer": [
            "38274618"
        ]
    },
    {
        "NNQT_question": "Give me {natural number} that starts with {'g'}",
        "uid": 24547,
        "subgraph": "string matching simple contains word",
        "template_index": 902,
        "question": "What are the natural number which start with the letter g",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21199 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q21199>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'g')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q507",
            "http://www.wikidata.org/entity/Q733169",
            "http://www.wikidata.org/entity/Q508",
            "http://www.wikidata.org/entity/Q11300950"
        ],
        "template_id": "2",
        "paraphrased_question": "What are the characteristic number which begin with the letter g",
        "simplified_query": "SELECT DISTINCT ?i WHERE { FILTER ( STRSTARTS ( LCASE ( ?i ) , 'g' ) ) . ?i rdf:type ontology:natural_number }",
        "solved_answer": [
            "googol",
            "Graham's number",
            "googolplex",
            "googolplexplex"
        ]
    },
    {
        "NNQT_question": "What is {wikibase:geoLatitude ?min} of {comes from} of {Cornbread} ?",
        "uid": 15113,
        "subgraph": "right-subgraph",
        "template_index": 663,
        "question": "What is wikibase:geoLatitude ?min that comes from Cornbread",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1108866 wdt:P495 ?X . ?X wdt:P1333 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1108866> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P495>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1333> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "Point(-81.8051241 24.5442989)"
        ],
        "template_id": "2",
        "paraphrased_question": "Min that come from Cornbread, would that be geo Latitude in wikibase?",
        "simplified_query": "SELECT ?x WHERE { resource:cornbread property:country_of_origin ?r . ?r property:coordinates_of_southernmost_point ?x }",
        "solved_answer": [
            "Point(-81.8051241 24.5442989)"
        ]
    },
    {
        "NNQT_question": "What is {typology} of {language of expression} of {Wayne Carey} ?",
        "uid": 17210,
        "subgraph": "right-subgraph",
        "template_index": 254,
        "question": "What type of expression does Wayne Carey use?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7976079 wdt:P1412 ?X . ?X wdt:P4132 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7976079> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1412>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4132> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q178435",
            "http://www.wikidata.org/entity/Q318917",
            "http://www.wikidata.org/entity/Q651641",
            "http://www.wikidata.org/entity/Q7200373",
            "http://www.wikidata.org/entity/Q7888721"
        ],
        "template_id": "2",
        "paraphrased_question": "How does Wayne Carey emote?",
        "simplified_query": "SELECT ?o WHERE { resource:Wayne_Carey property:languages_spoken,_written_or_signed ?r . ?r property:linguistic_typology ?o }",
        "solved_answer": [
            "nominative\u2013accusative language",
            "fusional language",
            "subject\u2013verb\u2013object",
            "place\u2013manner\u2013time",
            "stress-timed language"
        ]
    },
    {
        "NNQT_question": "What is {Q48460} of {faith} of {Pala Empire} ?",
        "uid": 16886,
        "subgraph": "right-subgraph",
        "template_index": 2,
        "question": "What is the  Q48460  faith of Pala Empire ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q668412 wdt:P140 ?X . ?X wdt:P1036 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q668412> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P140>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1036> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "294.3"
        ],
        "template_id": "2",
        "paraphrased_question": "What's the meaning of \"Q48460 faith of Pala Empire\"?",
        "simplified_query": "SELECT ?o WHERE { ?m property:Dewey_Decimal_Classification ?o . resource:Pala_Empire property:religion ?m }",
        "solved_answer": [
            "294.3"
        ]
    },
    {
        "NNQT_question": "Give me {condiment} that starts with {'y'}",
        "uid": 24555,
        "subgraph": "string matching simple contains word",
        "template_index": 550,
        "question": "What are the condiment which start with the letter y",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2596997 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2596997>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q16262216"
        ],
        "template_id": "2",
        "paraphrased_question": "What are the condiment which begin with the letter y",
        "simplified_query": "SELECT DISTINCT ?z WHERE { ?z rdf:type ontology:condiment . FILTER ( STRSTARTS ( LCASE ( ?z ) , 'y' ) ) }",
        "solved_answer": [
            "Yondu"
        ]
    },
    {
        "NNQT_question": "What is the {business} for {owner of} of {Barbie}",
        "uid": 21980,
        "subgraph": "simple question left",
        "template_index": 3041,
        "question": "Who is the business owner of Barbie the doll maker",
        "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1830 wd:Q167447 . ?sbj wdt:P31 wd:Q4830453 } ",
        "sparql_dbpedia18": "select distinct ?subj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?subj . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1830> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q167447> . ?subj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q4830453> } ",
        "template": "<?S P O ; ?S InstanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q596139"
        ],
        "template_id": "2",
        "paraphrased_question": "Who is the commerce proprietor of Barbie the doll maker",
        "simplified_query": "SELECT DISTINCT ?x WHERE { ?x rdf:type ontology:business . ?x property:owner_of resource:Barbie }",
        "solved_answer": [
            "Mattel"
        ]
    },
    {
        "NNQT_question": "What is {patron saint} of {active in} of {Innocent III} ?",
        "uid": 17461,
        "subgraph": "right-subgraph",
        "template_index": 1321,
        "question": "Who is the patron saint active in Innocent III?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q128076 wdt:P937 ?X . ?X wdt:P417 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q128076> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P937>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P417> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q9200",
            "http://www.wikidata.org/entity/Q33923"
        ],
        "template_id": "2",
        "paraphrased_question": "In Innocent 3, who is the active patron saint?",
        "simplified_query": "SELECT ?o WHERE { ?x property:patron_saint ?o . resource:Innocent_III property:work_location ?x }",
        "solved_answer": [
            "Paul the Apostle",
            "Peter"
        ]
    }
]