[
    {
        "NNQT_question": "Give me {binary star} that {constellation} {Canis Major} and which that starts with {'s'}",
        "uid": 25696,
        "subgraph": "string matching type + relation contains word",
        "template_index": 353,
        "question": "Tell me the binary star that constellation Canis Major and which that starts with the letter s",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q50053 . ?sbj wdt:P59 wd:Q10538 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q50053>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P59> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q10538>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q3409",
            "http://www.wikidata.org/entity/Q3962041"
        ],
        "template_id": "4",
        "paraphrased_question": "Let me know the parallel star that group of stars Canis Major and which that begins with the letter s",
        "simplified_query": "SELECT DISTINCT ?n WHERE { FILTER ( STRSTARTS ( LCASE ( ?n ) , 's' ) ) . ?n property:constellation resource:Canis_Major . ?n rdf:type ontology:binary_star }",
        "solved_answer": [
            "Sirius",
            "Sirius B"
        ]
    },
    {
        "NNQT_question": "What is {worked at} of {manager/director} of {\u00c9cole Normale Sup\u00e9rieure} ?",
        "uid": 14900,
        "subgraph": "left-subgraph",
        "template_index": 6,
        "question": "Who worked as the manager/director of \u00c9cole Normale Sup\u00e9rieure?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q83259 wdt:P1037 ?X . ?X wdt:P108 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q83259> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1037>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P108> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q83259",
            "http://www.wikidata.org/entity/Q3551621"
        ],
        "template_id": "5",
        "paraphrased_question": "Give me the name of the manager/director of \u00c9cole Normale Sup\u00e9rieure?",
        "simplified_query": "SELECT ?w WHERE { resource:\u00c9cole_normale_sup\u00e9rieure property:director_/_manager ?k . ?k property:employer ?w }",
        "solved_answer": [
            "\u00c9cole Normale Sup\u00e9rieure",
            "University of Lille"
        ]
    },
    {
        "NNQT_question": "What is {architecture firm} of {home water} of {Boston Celtics} ?",
        "uid": 14754,
        "subgraph": "left-subgraph",
        "template_index": 12,
        "question": "what were the architecture  firm of  home water of  boston  celitics/",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q131371 wdt:P115 ?X . ?X wdt:P84 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q131371> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P115>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P84> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q1409553"
        ],
        "template_id": "5",
        "paraphrased_question": "what were the engineering firm of domestic water of boston celitics/",
        "simplified_query": "SELECT ?k WHERE { resource:Boston_Celtics property:home_venue ?w . ?w property:architect ?k }",
        "solved_answer": [
            "Ellerbe Becket"
        ]
    },
    {
        "NNQT_question": "What is {coach} of {player of} of {Simone Biles} ?",
        "uid": 16956,
        "subgraph": "left-subgraph",
        "template_index": 22,
        "question": "who coach of player of Simone Biles ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7520267 wdt:P54 ?X . ?X wdt:P286 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7520267> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P54>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P286> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q8273156"
        ],
        "template_id": "5",
        "paraphrased_question": "who coach of player of Simone Biles ?",
        "simplified_query": "SELECT ?f WHERE { resource:Simone_Biles property:member_of_sports_team ?c . ?c property:head_coach ?f }",
        "solved_answer": [
            "M\u00e1rta K\u00e1rolyi"
        ]
    },
    {
        "NNQT_question": "What is {inverse} of {manufacturing method} of {pasteurization} ?",
        "uid": 17634,
        "subgraph": "left-subgraph",
        "template_index": 3,
        "question": "What is the inverse of the manufacturing method of pasteurization?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q58148 wdt:P2079 ?X . ?X wdt:P461 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q58148> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2079>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P461> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q3929317"
        ],
        "template_id": "5",
        "paraphrased_question": "What is the converse of the fabricating strategy of pasteurization?",
        "simplified_query": "SELECT ?z WHERE { resource:pasteurization property:fabrication_method ?q . ?q property:opposite_of ?z }",
        "solved_answer": [
            "cooling"
        ]
    },
    {
        "NNQT_question": "What is {founders} of {worked at} of {Alexander McQueen} ?",
        "uid": 15568,
        "subgraph": "left-subgraph",
        "template_index": 6,
        "question": "Who is the founder of Alexander McQueen?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q207939 wdt:P108 ?X . ?X wdt:P112 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q207939> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P108>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P112> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q714126",
            "http://www.wikidata.org/entity/Q167318",
            "http://www.wikidata.org/entity/Q207939"
        ],
        "template_id": "5",
        "paraphrased_question": "Who founded Alexander McQueen?",
        "simplified_query": "SELECT ?r WHERE { ?o property:founded_by ?r . resource:Alexander_McQueen property:employer ?o }",
        "solved_answer": [
            "Guccio Gucci",
            "Hubert de Givenchy",
            "Alexander McQueen"
        ]
    },
    {
        "NNQT_question": "What is {museum collection} of {famous books} of {Paul Klee} ?",
        "uid": 14542,
        "subgraph": "left-subgraph",
        "template_index": 9,
        "question": "What is art work of paul klee famous books ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q44007 wdt:P800 ?X . ?X wdt:P195 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q44007> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P800>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P195> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q46815",
            "http://www.wikidata.org/entity/Q262234",
            "http://www.wikidata.org/entity/Q111796449",
            "http://www.wikidata.org/entity/Q188740"
        ],
        "template_id": "5",
        "paraphrased_question": "What is craftsmanship work of paul klee celebrated books ?",
        "simplified_query": "SELECT ?w WHERE { resource:Paul_Klee property:notable_work ?q . ?q property:collection ?w }",
        "solved_answer": [
            "Israel Museum",
            "Lenbachhaus",
            "\"degenerate art\" collection",
            "Museum of Modern Art"
        ]
    },
    {
        "NNQT_question": "What is {fuel type} of {makes} of {Blue Origin} ?",
        "uid": 15971,
        "subgraph": "left-subgraph",
        "template_index": 48,
        "question": "What type of fuel does Blue Origin make?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q885836 wdt:P1056 ?X . ?X wdt:P618 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q885836> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1056>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P618> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q618153",
            "http://www.wikidata.org/entity/Q622779",
            "http://www.wikidata.org/entity/Q109494135"
        ],
        "template_id": "5",
        "paraphrased_question": "what kind of fuel is manufactured by Blue Origin?",
        "simplified_query": "SELECT ?m WHERE { ?x property:source_of_energy ?m . resource:Blue_Origin property:product_or_material_produced ?x }",
        "solved_answer": [
            "liquid oxygen",
            "liquid hydrogen",
            "liquid methane"
        ]
    },
    {
        "NNQT_question": "What is {actress} of {mentioned in} of {Red Skull} ?",
        "uid": 15840,
        "subgraph": "left-subgraph",
        "template_index": 213,
        "question": "Who was the actress that was mentioned in Red Skull?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2034529 wdt:P1441 ?X . ?X wdt:P161 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2034529> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1441>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P161> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q4212",
            "http://www.wikidata.org/entity/Q39989",
            "http://www.wikidata.org/entity/Q121045",
            "http://www.wikidata.org/entity/Q241154",
            "http://www.wikidata.org/entity/Q271883",
            "http://www.wikidata.org/entity/Q515442",
            "http://www.wikidata.org/entity/Q603685",
            "http://www.wikidata.org/entity/Q712670",
            "http://www.wikidata.org/entity/Q748584",
            "http://www.wikidata.org/entity/Q1150547",
            "http://www.wikidata.org/entity/Q1192840",
            "http://www.wikidata.org/entity/Q1289047",
            "http://www.wikidata.org/entity/Q1611179",
            "http://www.wikidata.org/entity/Q1683879",
            "http://www.wikidata.org/entity/Q1974435",
            "http://www.wikidata.org/entity/Q2254492",
            "http://www.wikidata.org/entity/Q3098323",
            "http://www.wikidata.org/entity/Q3182914",
            "http://www.wikidata.org/entity/Q952060",
            "http://www.wikidata.org/entity/Q3371581",
            "http://www.wikidata.org/entity/Q5108470"
        ],
        "template_id": "5",
        "paraphrased_question": "What actress was mentioned in Red Skull?",
        "simplified_query": "SELECT ?y WHERE { ?b property:cast_member ?y . resource:Red_Skull property:present_in_work ?b }",
        "solved_answer": [
            "Ned Beatty",
            "Ronny Cox",
            "Norbert Weisser",
            "Francesca Neri",
            "Melinda Dillon",
            "Antun Nalis",
            "Relja Ba\u0161i\u0107",
            "Michael Nouri",
            "Bill Mumy",
            "Darren McGavin",
            "Carla Cassola",
            "Mustafa Nadarevi\u0107",
            "Wayde Preston",
            "Jason Brooks",
            "Scott Paulin",
            "Kim Gillingham",
            "Garette Ratliff Henson",
            "Matt Salinger",
            "John Vernon",
            "Paul Kligman",
            "Chris Wiggins"
        ]
    },
    {
        "NNQT_question": "What is {incumbent} of {political office held} of {Arthur Drewry} ?",
        "uid": 17493,
        "subgraph": "left-subgraph",
        "template_index": 1388,
        "question": "Who is the incumbent of the political office held by Arthur Drewry?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q312664 wdt:P39 ?X . ?X wdt:P1308 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q312664> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P39>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1308> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q124138"
        ],
        "template_id": "5",
        "paraphrased_question": "Who is Arthur Drewry's incumbent political office?",
        "simplified_query": "SELECT ?m WHERE { resource:Arthur_Drewry property:position_held ?s . ?s property:officeholder ?m }",
        "solved_answer": [
            "Gianni Infantino Riovaldi"
        ]
    },
    {
        "NNQT_question": "What is {had cause} of {death cause} of {Douglas Jardine} ?",
        "uid": 17361,
        "subgraph": "left-subgraph",
        "template_index": 6899,
        "question": "Which is the cause of death of Douglas Jardine?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q3038014 wdt:P509 ?X . ?X wdt:P828 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q3038014> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P509>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P828> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q1133",
            "http://www.wikidata.org/entity/Q131123",
            "http://www.wikidata.org/entity/Q259516",
            "http://www.wikidata.org/entity/Q662860",
            "http://www.wikidata.org/entity/Q664174",
            "http://www.wikidata.org/entity/Q7212330"
        ],
        "template_id": "5",
        "paraphrased_question": "Which is the cause of passing of Douglas Jardine?",
        "simplified_query": "SELECT ?t WHERE { ?a property:has_cause ?t . resource:Douglas_Jardine property:cause_of_death ?a }",
        "solved_answer": [
            "radon",
            "air pollution",
            "passive smoking",
            "smoking",
            "asbestosis",
            "tobacco smoking"
        ]
    },
    {
        "NNQT_question": "What is {brother} of {kids} of {Llywelyn the Great} ?",
        "uid": 16165,
        "subgraph": "left-subgraph",
        "template_index": 138,
        "question": "What is the brother of the kids of Llywelyn the Great?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q467685 wdt:P40 ?X . ?X wdt:P3373 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q467685> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P40>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q727897",
            "http://www.wikidata.org/entity/Q1157156",
            "http://www.wikidata.org/entity/Q1398384",
            "http://www.wikidata.org/entity/Q4763161",
            "http://www.wikidata.org/entity/Q5358951",
            "http://www.wikidata.org/entity/Q449142"
        ],
        "template_id": "5",
        "paraphrased_question": "What's Llywelyn the Great's children's brother?",
        "simplified_query": "SELECT ?e WHERE { resource:Llywelyn_the_Great property:child ?t . ?t property:sibling ?e }",
        "solved_answer": [
            "Gruffydd ap Llywelyn",
            "Dafydd ap Llywelyn",
            "Gruffydd ap Llywelyn Fawr",
            "Angharad ferch Llywelyn",
            "Elen ferch Llywelyn",
            "Gwladus Ddu"
        ]
    },
    {
        "NNQT_question": "What is {river head} of {tributary} of {Yellow River} ?",
        "uid": 17204,
        "subgraph": "left-subgraph",
        "template_index": 4,
        "question": "Is the river head a tributary of the Yellow River?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q7355 wdt:P974 ?X . ?X wdt:P885 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q7355> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P974>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P885> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q10567006",
            "http://www.wikidata.org/entity/Q108799793",
            "http://www.wikidata.org/entity/Q28795506",
            "http://www.wikidata.org/entity/Q28798527",
            "http://www.wikidata.org/entity/Q1202183",
            "http://www.wikidata.org/entity/Q8039339"
        ],
        "template_id": "5",
        "paraphrased_question": "Is the waterway head a tributary of the Yellow River?",
        "simplified_query": "SELECT ?q WHERE { ?r property:origin_of_the_watercourse ?q . resource:Yellow_River property:tributary ?r }",
        "solved_answer": [
            "Niaoshu Mountain",
            "Qingyuanhe",
            "Xiqing Shan",
            "Guancen Mountains",
            "Otog Banner",
            "Wushao Ling Mountain"
        ]
    },
    {
        "NNQT_question": "What is {art collection} of {significance} of {Auguste Rodin} ?",
        "uid": 15216,
        "subgraph": "left-subgraph",
        "template_index": 46,
        "question": "Which of the work of Rodin is significant?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q30755 wdt:P800 ?X . ?X wdt:P195 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q30755> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P800>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P195> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q23402",
            "http://www.wikidata.org/entity/Q2097646",
            "http://www.wikidata.org/entity/Q650519",
            "http://www.wikidata.org/entity/Q188740",
            "http://www.wikidata.org/entity/Q162111",
            "http://www.wikidata.org/entity/Q428765"
        ],
        "template_id": "5",
        "paraphrased_question": "What is the significant work of Rodin?",
        "simplified_query": "SELECT ?d WHERE { ?s property:collection ?d . resource:Auguste_Rodin property:notable_work ?s }",
        "solved_answer": [
            "Mus\u00e9e d'Orsay",
            "Museo Soumaya",
            "Mus\u00e9e Rodin",
            "Museum of Modern Art",
            "Alte Nationalgalerie",
            "Museum of Fine Arts of Nancy"
        ]
    },
    {
        "NNQT_question": "What is {river source} of {tributary} of {Yangtze} ?",
        "uid": 15782,
        "subgraph": "left-subgraph",
        "template_index": 47,
        "question": "who river source of tributary of yangtze ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q5413 wdt:P974 ?X . ?X wdt:P885 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5413> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P974>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P885> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q140712",
            "http://www.wikidata.org/entity/Q619687",
            "http://www.wikidata.org/entity/Q28961145",
            "http://www.wikidata.org/entity/Q7821148"
        ],
        "template_id": "5",
        "paraphrased_question": "What is the source river for the tributary of yangtze?",
        "simplified_query": "SELECT ?z WHERE { resource:Yangtze property:tributary ?q . ?q property:origin_of_the_watercourse ?z }",
        "solved_answer": [
            "Lake Tai",
            "Bayan Har Mountains",
            "Za Qu",
            "Tongtian River"
        ]
    },
    {
        "NNQT_question": "What is {manager/director} of {commands} of {Erich von Manstein} ?",
        "uid": 17170,
        "subgraph": "left-subgraph",
        "template_index": 4,
        "question": "who is manager/director for commands of Erich von Manstein ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q57135 wdt:P598 ?X . ?X wdt:P1037 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q57135> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P598>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1037> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q57135",
            "http://www.wikidata.org/entity/Q57580",
            "http://www.wikidata.org/entity/Q63948",
            "http://www.wikidata.org/entity/Q71718",
            "http://www.wikidata.org/entity/Q75669"
        ],
        "template_id": "5",
        "paraphrased_question": "Who is Erich von Manstein's command manager / manager?",
        "simplified_query": "SELECT ?d WHERE { resource:Erich_von_Manstein property:commander_of_(DEPRECATED) ?k . ?k property:director_/_manager ?d }",
        "solved_answer": [
            "Erich von Manstein",
            "Felix Steiner",
            "Eugen Ritter von Schobert",
            "Walther Lucht",
            "Otto Hitzfeld"
        ]
    },
    {
        "NNQT_question": "What is {represents} of {artwork} of {Donatello} ?",
        "uid": 15469,
        "subgraph": "left-subgraph",
        "template_index": 30,
        "question": "What represents the artwork of Donatello?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q37562 wdt:P800 ?X . ?X wdt:P180 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q37562> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P800>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P180> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q3767901",
            "http://www.wikidata.org/entity/Q8441",
            "http://www.wikidata.org/entity/Q23640",
            "http://www.wikidata.org/entity/Q41370",
            "http://www.wikidata.org/entity/Q80151",
            "http://www.wikidata.org/entity/Q173603",
            "http://www.wikidata.org/entity/Q190868",
            "http://www.wikidata.org/entity/Q192785",
            "http://www.wikidata.org/entity/Q514847",
            "http://www.wikidata.org/entity/Q734844",
            "http://www.wikidata.org/entity/Q1492760",
            "http://www.wikidata.org/entity/Q135106",
            "http://www.wikidata.org/entity/Q302",
            "http://www.wikidata.org/entity/Q20460"
        ],
        "template_id": "5",
        "paraphrased_question": "The artworks of Donatello is represented by what?",
        "simplified_query": "SELECT ?d WHERE { ?f property:depicts ?d . resource:Donatello property:notable_work ?f }",
        "solved_answer": [
            "Giovanni Pecci",
            "man",
            "head",
            "David",
            "hat",
            "helmet",
            "boot",
            "Goliath",
            "contrapposto",
            "laurel wreath",
            "teenager",
            "Habakkuk",
            "Jesus",
            "crucifix"
        ]
    },
    {
        "NNQT_question": "What is {field of study} of {sculptor} of {pressure volume diagram} ?",
        "uid": 17255,
        "subgraph": "left-subgraph",
        "template_index": 459,
        "question": "who study of sculptor of pressure volume diagram ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q311318 wdt:P170 ?X . ?X wdt:P101 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q311318> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P170>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P101> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "C RCD xD . xD RDE ?E",
        "answer": [
            "http://www.wikidata.org/entity/Q12760",
            "http://www.wikidata.org/entity/Q101333",
            "http://www.wikidata.org/entity/Q2341443",
            "http://www.wikidata.org/entity/Q14208553"
        ],
        "template_id": "5",
        "paraphrased_question": "who consider of stone worker of weight volume graph",
        "simplified_query": "SELECT ?s WHERE { resource:pressure\u2013volume_diagram property:creator ?o . ?o property:field_of_work ?s }",
        "solved_answer": [
            "steam engine",
            "mechanical engineering",
            "instrument maker",
            "invention"
        ]
    }
]