[
    {
        "NNQT_question": "What is {opposite} of {led to} of {family} ?",
        "uid": 15805,
        "subgraph": "right-subgraph",
        "template_index": 6,
        "question": "What is the opposite of led to when referencing a family?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q8436 wdt:P1542 ?X . ?X wdt:P461 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q8436> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1542>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P461> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q58702"
        ],
        "template_id": "2",
        "paraphrased_question": "When referencing a family the opposite of led to is?",
        "simplified_query": "SELECT ?f WHERE { ?i property:opposite_of ?f . resource:family property:has_effect ?i }",
        "solved_answer": [
            "mortality rate"
        ]
    },
    {
        "NNQT_question": "What is the {television series} for {executive producer} of {Donald Trump}",
        "uid": 20436,
        "subgraph": "simple question left",
        "template_index": 782,
        "question": "Name a TV show produced by Donald Trump",
        "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1431 wd:Q22686 . ?sbj wdt:P31 wd:Q5398426 } ",
        "sparql_dbpedia18": "select distinct ?subj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?subj . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1431> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q22686> . ?subj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q5398426> } ",
        "template": "<?S P O ; ?S InstanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q863122",
            "http://www.wikidata.org/entity/Q7771201"
        ],
        "template_id": "2",
        "paraphrased_question": "Name a TV show created by Donald Trump",
        "simplified_query": "SELECT DISTINCT ?e WHERE { ?e property:executive_producer resource:Donald_Trump . ?e rdf:type ontology:television_series }",
        "solved_answer": [
            "The Apprentice",
            "The Ultimate Merger"
        ]
    },
    {
        "NNQT_question": "What is {signs} of {result} of {silver} ?",
        "uid": 14677,
        "subgraph": "right-subgraph",
        "template_index": 1,
        "question": "What is the signs of result of silver ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1090 wdt:P1542 ?X . ?X wdt:P780 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1090> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1542>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P780> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q648982",
            "http://www.wikidata.org/entity/Q1799146",
            "http://www.wikidata.org/entity/Q6452285",
            "http://www.wikidata.org/entity/Q18343527"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the signs of result of silver ?",
        "simplified_query": "SELECT ?l WHERE { resource:silver property:has_effect ?i . ?i property:symptoms ?l }",
        "solved_answer": [
            "argyria",
            "irritant dermatitis",
            "ulcer",
            "gastrointestinal distress"
        ]
    },
    {
        "NNQT_question": "What is {examinations} of {consequence} of {alcoholism} ?",
        "uid": 17253,
        "subgraph": "right-subgraph",
        "template_index": 90,
        "question": "What are the examinations of the consequences of alcoholism?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q15326 wdt:P1542 ?X . ?X wdt:P923 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q15326> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1542>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P923> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q32566",
            "http://www.wikidata.org/entity/Q234904",
            "http://www.wikidata.org/entity/Q360841",
            "http://www.wikidata.org/entity/Q886837",
            "http://www.wikidata.org/entity/Q79785",
            "http://www.wikidata.org/entity/Q216933"
        ],
        "template_id": "2",
        "paraphrased_question": "What has been found to be a result of alcoholism?",
        "simplified_query": "SELECT ?e WHERE { resource:alcoholism property:has_effect ?a . ?a property:medical_examinations ?e }",
        "solved_answer": [
            "computed tomography",
            "medical ultrasonography",
            "liver biopsy",
            "blood test",
            "electrocardiography",
            "echocardiography"
        ]
    },
    {
        "NNQT_question": "What is {stable versions} of {language} of {Android} ?",
        "uid": 17713,
        "subgraph": "right-subgraph",
        "template_index": 189,
        "question": "Which language is the stable version of Android?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q94 wdt:P277 ?X . ?X wdt:P348 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q94> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P277>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P348> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "Java SE 21",
            "C++20",
            "1.9.22"
        ],
        "template_id": "2",
        "paraphrased_question": "Which dialect is the steady adaptation of Android?",
        "simplified_query": "SELECT ?a WHERE { resource:Android property:programming_language ?x . ?x property:software_version_identifier ?a }",
        "solved_answer": [
            "Java SE 21",
            "C++20",
            "1.9.22"
        ]
    },
    {
        "NNQT_question": "What is the {film} for {based on} of {Batman}",
        "uid": 19869,
        "subgraph": "simple question left",
        "template_index": 215,
        "question": "Mention the film based on the description of Batman",
        "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P144 wd:Q2695156 . ?sbj wdt:P31 wd:Q11424 } ",
        "sparql_dbpedia18": "select distinct ?subj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?subj . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P144> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2695156> . ?subj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q11424> } ",
        "template": "<?S P O ; ?S InstanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q163872",
            "http://www.wikidata.org/entity/Q166262",
            "http://www.wikidata.org/entity/Q189054",
            "http://www.wikidata.org/entity/Q221345",
            "http://www.wikidata.org/entity/Q276523",
            "http://www.wikidata.org/entity/Q498757",
            "http://www.wikidata.org/entity/Q810857",
            "http://www.wikidata.org/entity/Q810861"
        ],
        "template_id": "2",
        "paraphrased_question": "Give a short summary of the film \"Batman\"",
        "simplified_query": "SELECT DISTINCT ?n WHERE { ?n rdf:type ontology:film . ?n property:based_on resource:Batman }",
        "solved_answer": [
            "The Dark Knight",
            "Batman Begins",
            "Batman Returns",
            "Batman Forever",
            "Batman & Robin",
            "Batman & Mr. Freeze: SubZero",
            "Batman",
            "Batman: Mystery of the Batwoman"
        ]
    },
    {
        "NNQT_question": "What is {outcome} of {antonym of} of {plasma recombination} ?",
        "uid": 17306,
        "subgraph": "right-subgraph",
        "template_index": 31,
        "question": "What is the outcome of  the antonym  of plasma recombination?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q4392902 wdt:P461 ?X . ?X wdt:P1542 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q4392902> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P461>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1542> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q36496",
            "http://www.wikidata.org/entity/Q29148313"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the result of the antonym of plasma recombination?",
        "simplified_query": "SELECT ?r WHERE { ?w property:has_effect ?r . resource:plasma_recombination property:opposite_of ?w }",
        "solved_answer": [
            "ion",
            "plasma state of matter"
        ]
    },
    {
        "NNQT_question": "What is {dimension} of {works} of {Jean Racine} ?",
        "uid": 15866,
        "subgraph": "right-subgraph",
        "template_index": 3848,
        "question": "What is the dimension of works by Jean Racine?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q742 wdt:P800 ?X . ?X wdt:P2043 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q742> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P800>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2043> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "1648",
            "884",
            "1698",
            "1356",
            "1816",
            "1506",
            "1792",
            "1654",
            "1768",
            "1548",
            "1516"
        ],
        "template_id": "2",
        "paraphrased_question": "Mention the dimension of works by Jean Racine?",
        "simplified_query": "SELECT ?h WHERE { resource:Jean_Racine property:notable_work ?p . ?p property:length ?h }",
        "solved_answer": [
            "1648",
            "884",
            "1698",
            "1356",
            "1816",
            "1506",
            "1792",
            "1654",
            "1768",
            "1548",
            "1516"
        ]
    },
    {
        "NNQT_question": "What is {buried in} of {discoverer} of {lutetium} ?",
        "uid": 16795,
        "subgraph": "right-subgraph",
        "template_index": 290,
        "question": "When was lutetium discovered?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1857 wdt:P61 ?X . ?X wdt:P119 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1857> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P119> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q2718154"
        ],
        "template_id": "2",
        "paraphrased_question": "Lutetium was discovered when?",
        "simplified_query": "SELECT ?w WHERE { resource:lutetium property:discoverer_or_inventor ?v . ?v property:place_of_burial ?w }",
        "solved_answer": [
            "Hietzing Cemetery"
        ]
    },
    {
        "NNQT_question": "What is {sequel is} of {temporal range end} of {Iguanodon} ?",
        "uid": 16222,
        "subgraph": "right-subgraph",
        "template_index": 68,
        "question": "What is the name and date of the sequel to Iguanodon?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q130980 wdt:P524 ?X . ?X wdt:P156 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q130980> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P524>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P156> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q301728"
        ],
        "template_id": "2",
        "paraphrased_question": "what is the name of the sequel to Iguanodon and what date was it released on?",
        "simplified_query": "SELECT ?l WHERE { ?m property:followed_by ?l . resource:Iguanodon property:temporal_range_end ?m }",
        "solved_answer": [
            "Albian"
        ]
    },
    {
        "NNQT_question": "What is the {business} for {replaced by} of {Oracle Corporation}",
        "uid": 20333,
        "subgraph": "simple question left",
        "template_index": 679,
        "question": "Who was Oracle Corporation taken over by",
        "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P1366 wd:Q19900 . ?sbj wdt:P31 wd:Q4830453 } ",
        "sparql_dbpedia18": "select distinct ?subj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?subj . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1366> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q19900> . ?subj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q4830453> } ",
        "template": "<?S P O ; ?S InstanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q2456368"
        ],
        "template_id": "2",
        "paraphrased_question": "Who was Prophet Organization taken over by",
        "simplified_query": "SELECT DISTINCT ?l WHERE { ?l rdf:type ontology:business . ?l property:replaced_by resource:Oracle_Corporation }",
        "solved_answer": [
            "JD Edwards"
        ]
    },
    {
        "NNQT_question": "What is {remake of} of {makes use of} of {Roman numerals} ?",
        "uid": 17323,
        "subgraph": "right-subgraph",
        "template_index": 3,
        "question": "how is remake of makes use of Roman numerals?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q38918 wdt:P2283 ?X . ?X wdt:P144 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q38918> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2283>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P144> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q271565"
        ],
        "template_id": "2",
        "paraphrased_question": "How are Roman numerals made?",
        "simplified_query": "SELECT ?j WHERE { ?w property:based_on ?j . resource:Roman_numerals property:uses ?w }",
        "solved_answer": [
            "Etruscan alphabet"
        ]
    },
    {
        "NNQT_question": "Give me {conjecture} that starts with {'p'}",
        "uid": 24361,
        "subgraph": "string matching simple contains word",
        "template_index": 930,
        "question": "What are thewater deity which start with the letter'y",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q319141 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q319141>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q18386040",
            "http://www.wikidata.org/entity/Q17099539",
            "http://www.wikidata.org/entity/Q1402534",
            "http://www.wikidata.org/entity/Q1441904",
            "http://www.wikidata.org/entity/Q7191856",
            "http://www.wikidata.org/entity/Q7250222",
            "http://www.wikidata.org/entity/Q3406234",
            "http://www.wikidata.org/entity/Q3023699"
        ],
        "template_id": "2",
        "paraphrased_question": "Name the water deity that begins with the letter y.",
        "simplified_query": "SELECT DISTINCT ?z WHERE { ?z rdf:type ontology:conjecture . FILTER ( STRSTARTS ( LCASE ( ?z ) , 'p' ) ) }",
        "solved_answer": [
            "Painlev\u00e9 conjecture",
            "Parshin's conjecture",
            "Polignac's conjecture",
            "P\u00f3lya conjecture",
            "Pierce\u2013Birkhoff conjecture",
            "property P conjecture",
            "Pompeiu problem",
            "Pillai's conjecture"
        ]
    },
    {
        "NNQT_question": "What is {human population} of {administrative headquarters} of {French Indochina} ?",
        "uid": 14903,
        "subgraph": "right-subgraph",
        "template_index": 397,
        "question": "What is the human population of the administrative headquarters of French Indochina?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q185682 wdt:P36 ?X . ?X wdt:P1082 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q185682> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P36>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "10380000",
            "8246600"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the human populace of the regulatory central station of French Indochina?",
        "simplified_query": "SELECT ?l WHERE { ?x property:population ?l . resource:French_Indochina property:capital ?x }",
        "solved_answer": [
            "10380000",
            "8246600"
        ]
    },
    {
        "NNQT_question": "What is {size} of {acted by} of {Biblical Magi} ?",
        "uid": 16652,
        "subgraph": "right-subgraph",
        "template_index": 47,
        "question": "How tall is the actor who played of one of the Wise Men?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q51671 wdt:P1299 ?X . ?X wdt:P2048 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q51671> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1299>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2048> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "301.5"
        ],
        "template_id": "2",
        "paraphrased_question": "How tall is the performing artist who played of one of the Astute Men?",
        "simplified_query": "SELECT ?z WHERE { ?f property:height ?z . resource:biblical_Magi property:depicted_by ?f }",
        "solved_answer": [
            "301.5"
        ]
    },
    {
        "NNQT_question": "What is {subsidiary} of {developed by} of {IBM POWER Instruction Set Architecture} ?",
        "uid": 17650,
        "subgraph": "right-subgraph",
        "template_index": 205,
        "question": "What is the subsidiary of IBM Power?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q13637178 wdt:P178 ?X . ?X wdt:P199 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q13637178> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P178>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P199> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q12253",
            "http://www.wikidata.org/entity/Q37592",
            "http://www.wikidata.org/entity/Q3146518",
            "http://www.wikidata.org/entity/Q5969179"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the backup of IBM Power?",
        "simplified_query": "SELECT ?d WHERE { ?b property:business_division ?d . resource:IBM_POWER property:developer ?b }",
        "solved_answer": [
            "Watson",
            "IBM Global Services",
            "IBM Research",
            "IBM jStart"
        ]
    },
    {
        "NNQT_question": "What is {Q48460} of {languages of expression} of {B\u0101\u1e47abha\u1e6d\u1e6da} ?",
        "uid": 14853,
        "subgraph": "right-subgraph",
        "template_index": 783,
        "question": "How many words are in the language B\u0101\u1e47abha\u1e6d\u1e6da?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q171202 wdt:P1412 ?X . ?X wdt:P1036 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q171202> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1412>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1036> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "491.2"
        ],
        "template_id": "2",
        "paraphrased_question": "How numerous words are within the dialect B\u0101\u1e47abha\u1e6d\u1e6da?",
        "simplified_query": "SELECT ?l WHERE { ?i property:Dewey_Decimal_Classification ?l . resource:B\u0101\u1e47abha\u1e6d\u1e6da property:languages_spoken,_written_or_signed ?i }",
        "solved_answer": [
            "491.2"
        ]
    },
    {
        "NNQT_question": "What is {economic branch} of {licensor} of {macOS} ?",
        "uid": 17385,
        "subgraph": "right-subgraph",
        "template_index": 1427,
        "question": "Which is the economic branch licensed by macOS?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q14116 wdt:P3931 ?X . ?X wdt:P452 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q14116> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3931>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P452> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q11650",
            "http://www.wikidata.org/entity/Q11661",
            "http://www.wikidata.org/entity/Q269415",
            "http://www.wikidata.org/entity/Q581105",
            "http://www.wikidata.org/entity/Q638608",
            "http://www.wikidata.org/entity/Q880371",
            "http://www.wikidata.org/entity/Q56598901"
        ],
        "template_id": "2",
        "paraphrased_question": "Which is the financial department authorized by macOS?",
        "simplified_query": "SELECT ?v WHERE { resource:macOS property:copyright_holder ?u . ?u property:industry ?v }",
        "solved_answer": [
            "electronics",
            "information technology",
            "digital distribution",
            "consumer electronics",
            "software development",
            "software industry",
            "mobile phone industry"
        ]
    },
    {
        "NNQT_question": "Give me {language family} that starts with {'q'}",
        "uid": 24121,
        "subgraph": "string matching simple contains word",
        "template_index": 701,
        "question": "tell me about language family starts with the letter q",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25295 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'q')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q25295>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'q')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q5218",
            "http://www.wikidata.org/entity/Q1636765",
            "http://www.wikidata.org/entity/Q20667193",
            "http://www.wikidata.org/entity/Q1468146",
            "http://www.wikidata.org/entity/Q1468128",
            "http://www.wikidata.org/entity/Q3407130",
            "http://www.wikidata.org/entity/Q7271655",
            "http://www.wikidata.org/entity/Q7265246",
            "http://www.wikidata.org/entity/Q12634451"
        ],
        "template_id": "2",
        "paraphrased_question": "let me know approximately dialect family begins with the letter q",
        "simplified_query": "SELECT DISTINCT ?i WHERE { ?i rdf:type ontology:language_family . FILTER ( STRSTARTS ( LCASE ( ?i ) , 'q' ) ) }",
        "solved_answer": [
            "Quechua",
            "Qiangic",
            "Qiong\u2013Lei",
            "Quechua II",
            "Quechua I",
            "Quechumaran",
            "Quichean",
            "Q'anjobalan",
            "Quechuan language family"
        ]
    },
    {
        "NNQT_question": "Did {Apple} {color} {red} and {blue} ?",
        "uid": 830,
        "subgraph": "boolean double one_hop right subgraph",
        "template_index": 330,
        "question": "Are apples red and blue?",
        "sparql_wikidata": "ASK WHERE { wd:Q89 wdt:P462 wd:Q3142 . wd:Q89 wdt:P462 wd:Q1088 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q89> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P462> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3142>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q89> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P462> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1088>. } ",
        "template": "Ask (ent-pred-obj1 . ent-pred-obj2`)",
        "answer": [
            false
        ],
        "template_id": "2",
        "paraphrased_question": "Do apples have a red and blue color?",
        "simplified_query": "ASK WHERE { resource:apple property:color resource:blue . resource:apple property:color resource:red }",
        "solved_answer": [
            false
        ]
    }
]