[
    {
        "NNQT_question": "What is <S\u00e4chsische Biografie> of <Lucas Cranach the Elder> ?",
        "uid": 27327,
        "subgraph": "center",
        "template_index": 1624,
        "question": "What is S\u00e4chsische Biografie of Lucas Cranach the Elder ?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q191748 wdt:P1710 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q191748> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1710> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "118522582"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?l WHERE { resource:Lucas_Cranach_the_Elder property:S\u00e4chsische_Biografie_ID ?l }",
        "solved_answer": [
            "118522582"
        ]
    },
    {
        "NNQT_question": "What is <BDCYL authority ID> of <Jos\u00e9 Echegaray> ?",
        "uid": 29594,
        "subgraph": "center",
        "template_index": 3891,
        "question": "Which is the BDCYL authority ID for Jos\u00e9 Echegaray?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q127349 wdt:P3964 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q127349> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3964> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "2517"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?t WHERE { resource:Jos\u00e9_Echegaray property:BDCYL_authority_ID ?t }",
        "solved_answer": [
            "2517"
        ]
    },
    {
        "NNQT_question": "What is <date of baptism in early childhood> of <Diego Vel\u00e1zquez> ?",
        "uid": 28841,
        "subgraph": "center",
        "template_index": 3138,
        "question": "Which is the date of baptism in early childhood of Diego Vel\u00e1zquez?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q297 wdt:P1636 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q297> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1636> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "1599-06-06T00:00:00Z"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?v WHERE { resource:Diego_Vel\u00e1zquez property:date_of_baptism_in_early_childhood ?v }",
        "solved_answer": [
            "1599-06-06T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "What is <Italian Senate ID> of <Giosu\u00e8 Carducci> ?",
        "uid": 26249,
        "subgraph": "center",
        "template_index": 546,
        "question": "Which is the Italian Senate ID for Giosu\u00e8 Carducci?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q43440 wdt:P3954 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q43440> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3954> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "c710be29d10102b54125646f0059c69c"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?k WHERE { resource:Giosu\u00e8_Carducci property:Italian_Senate_ID ?k }",
        "solved_answer": [
            "c710be29d10102b54125646f0059c69c"
        ]
    },
    {
        "NNQT_question": "What is <capital> of <\u014ctsu> ?",
        "uid": 28746,
        "subgraph": "center",
        "template_index": 3043,
        "question": "What's the capital of \u014ctsu?",
        "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P36 wd:Q202907}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject>  ?answer. ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P36> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q202907>. }",
        "template": "?D RDE E",
        "answer": [
            "http://www.wikidata.org/entity/Q131358",
            "http://www.wikidata.org/entity/Q10863316",
            "http://www.wikidata.org/entity/Q11437356"
        ],
        "template_id": "1.2",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?c WHERE { ?c property:capital resource:\u014ctsu }",
        "solved_answer": [
            "Shiga Prefecture",
            "\u014ctsu Domain",
            "\u014ctsu Prefecture"
        ]
    },
    {
        "NNQT_question": "What is <after a work by> of <Stanis\u0142awa Przybyszewska> ?",
        "uid": 29283,
        "subgraph": "center",
        "template_index": 3580,
        "question": "Which is after a work by Stanis\u0142awa Przybyszewska?",
        "sparql_wikidata": "select distinct ?answer where { ?answer wdt:P1877 wd:Q3067991}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject>  ?answer. ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1877> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3067991>. }",
        "template": "?D RDE E",
        "answer": [
            "http://www.wikidata.org/entity/Q1165071"
        ],
        "template_id": "1.2",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?t WHERE { ?t property:after_a_work_by resource:Stanis\u0142awa_Przybyszewska }",
        "solved_answer": [
            "Danton"
        ]
    },
    {
        "NNQT_question": "What is {students} of {coined} of {Euler\u2013Lagrange equation} ?",
        "uid": 17797,
        "subgraph": "right-subgraph",
        "template_index": 892,
        "question": "Who is the student that coined the Euler-Lagrange equation?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q875744 wdt:P61 ?X . ?X wdt:P802 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q875744> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P802> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q80222",
            "http://www.wikidata.org/entity/Q115664",
            "http://www.wikidata.org/entity/Q447071",
            "http://www.wikidata.org/entity/Q556346",
            "http://www.wikidata.org/entity/Q4141818",
            "http://www.wikidata.org/entity/Q4201322",
            "http://www.wikidata.org/entity/Q4235955",
            "http://www.wikidata.org/entity/Q4400039"
        ],
        "template_id": "2",
        "paraphrased_question": "Who is the understudy that coined the Euler-Lagrange equation?",
        "simplified_query": "SELECT ?m WHERE { ?b property:student ?m . resource:Euler\u2013Lagrange_equation property:discoverer_or_inventor ?b }",
        "solved_answer": [
            "Joseph-Louis Lagrange",
            "Nicolas Fuss",
            "Anders Johan Lexell",
            "Johann Euler",
            "Mikhail Golovin",
            "Petr Inokhodtsev",
            "Semen Kotelnikov",
            "Stepan Rumovsky"
        ]
    },
    {
        "NNQT_question": "What is the {human settlement} for {patron saint} of {Joseph}",
        "uid": 22857,
        "subgraph": "simple question left",
        "template_index": 3918,
        "question": "n/a",
        "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P417 wd:Q128267 . ?sbj wdt:P31 wd:Q486972 } ",
        "sparql_dbpedia18": "select distinct ?subj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?subj . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P417> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q128267> . ?subj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q486972> } ",
        "template": "<?S P O ; ?S InstanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q3471500",
            "http://www.wikidata.org/entity/Q28935701"
        ],
        "template_id": "2",
        "paraphrased_question": "N / A N / A",
        "simplified_query": "SELECT DISTINCT ?t WHERE { ?t property:patron_saint resource:Joseph . ?t rdf:type ontology:human_settlement }",
        "solved_answer": [
            "San Jos\u00e9",
            "El Rancho de San Agust\u00edn"
        ]
    },
    {
        "NNQT_question": "What is the {human} for {doctoral advisor} of {C. V. Raman}",
        "uid": 20802,
        "subgraph": "simple question left",
        "template_index": 1148,
        "question": "Who is C. V. Raman's doctoral advisor?",
        "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P184 wd:Q60429 . ?sbj wdt:P31 wd:Q5 } ",
        "sparql_dbpedia18": "select distinct ?subj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?subj . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P184> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q60429> . ?subj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q5> } ",
        "template": "<?S P O ; ?S InstanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q325470",
            "http://www.wikidata.org/entity/Q910690",
            "http://www.wikidata.org/entity/Q1760743",
            "http://www.wikidata.org/entity/Q6323839"
        ],
        "template_id": "2",
        "paraphrased_question": "",
        "simplified_query": "SELECT DISTINCT ?d WHERE { ?d property:doctoral_advisor resource:C._V._Raman . ?d rdf:type ontology:human }",
        "solved_answer": [
            "Vikram Sarabhai",
            "G. N. Ramachandran",
            "S. Pancharatnam",
            "K. R. Ramanathan"
        ]
    },
    {
        "NNQT_question": "Did {Holy_Roman_Empire} {official language} {Dutch} and {Hungarian} ?",
        "uid": 506,
        "subgraph": "boolean double one_hop right subgraph",
        "template_index": 6,
        "question": "Were Dutch and Hungarian the official languages of the Holy Roman Empire?",
        "sparql_wikidata": "ASK WHERE { wd:Q12548 wdt:P37 wd:Q7411 . wd:Q12548 wdt:P37 wd:Q9067 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q12548> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P37> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q7411>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q12548> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P37> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q9067>. } ",
        "template": "Ask (ent-pred-obj1` . ent-pred-obj2)",
        "answer": [
            false
        ],
        "template_id": "2",
        "paraphrased_question": "Is it true that the official languages of the Holy Roman Empire were Dutch and Hungarian?",
        "simplified_query": "ASK WHERE { resource:Holy_Roman_Empire property:official_language resource:Hungarian . resource:Holy_Roman_Empire property:official_language resource:Dutch }",
        "solved_answer": [
            false
        ]
    },
    {
        "NNQT_question": "What is the {human} for {member of} of {Oracle Corporation}",
        "uid": 21166,
        "subgraph": "simple question left",
        "template_index": 1512,
        "question": "Name a memer of the Oracle Corporation",
        "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P463 wd:Q19900 . ?sbj wdt:P31 wd:Q5 } ",
        "sparql_dbpedia18": "select distinct ?subj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?subj . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P463> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q19900> . ?subj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q5> } ",
        "template": "<?S P O ; ?S InstanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q450628"
        ],
        "template_id": "2",
        "paraphrased_question": "Title a memer of the Prophet Enterprise",
        "simplified_query": "SELECT DISTINCT ?a WHERE { ?a property:member_of resource:Oracle_Corporation . ?a rdf:type ontology:human }",
        "solved_answer": [
            "Safra Catz"
        ]
    },
    {
        "NNQT_question": "Give me {ring system} that starts with {'r'}",
        "uid": 24853,
        "subgraph": "string matching simple contains word",
        "template_index": 3030,
        "question": "What are the ring system  which start with the letter r",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28951811 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q28951811>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'r')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q171473",
            "http://www.wikidata.org/entity/Q3060",
            "http://www.wikidata.org/entity/Q48400"
        ],
        "template_id": "2",
        "paraphrased_question": "Name the ring systems that begin with alphabet R.",
        "simplified_query": "SELECT DISTINCT ?d WHERE { ?d rdf:type ontology:ring_system . FILTER ( STRSTARTS ( LCASE ( ?d ) , 'r' ) ) }",
        "solved_answer": [
            "rings of Uranus",
            "rings of Jupiter",
            "rings of Neptune"
        ]
    },
    {
        "NNQT_question": "What is {is the antonym of} of {profession's field} of {prosecutor} ?",
        "uid": 17010,
        "subgraph": "right-subgraph",
        "template_index": 8,
        "question": "What is the antonym of the profession's field of prosecutor?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q600751 wdt:P425 ?X . ?X wdt:P461 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q600751> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P425>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P461> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q222249"
        ],
        "template_id": "2",
        "paraphrased_question": "Name the antonym of the profession field of prosecutor.",
        "simplified_query": "SELECT ?d WHERE { resource:prosecutor property:field_of_this_occupation ?f . ?f property:opposite_of ?d }",
        "solved_answer": [
            "civil law"
        ]
    },
    {
        "NNQT_question": "What is {number of out of school children} of {continent} of {Eritrea} ?",
        "uid": 17825,
        "subgraph": "right-subgraph",
        "template_index": 16482,
        "question": "How many out of school children are there in Eritrea?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q986 wdt:P30 ?X . ?X wdt:P2573 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q986> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P30>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2573> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "101000000"
        ],
        "template_id": "2",
        "paraphrased_question": "How numerous out of school children are there in Eritrea?",
        "simplified_query": "SELECT ?n WHERE { ?a property:number_of_out-of-school_children ?n . resource:Eritrea property:continent ?a }",
        "solved_answer": [
            "101000000"
        ]
    },
    {
        "NNQT_question": "Give me {political philosophy} that starts with {'w'}",
        "uid": 24782,
        "subgraph": "string matching simple contains word",
        "template_index": 3347,
        "question": "What are the political philosophy which start with the letter w",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179805 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q179805>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'w')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q110849146"
        ],
        "template_id": "2",
        "paraphrased_question": "What are the political logic which begin with the letter w",
        "simplified_query": "SELECT DISTINCT ?t WHERE { ?t rdf:type ontology:political_philosophy . FILTER ( STRSTARTS ( LCASE ( ?t ) , 'w' ) ) }",
        "solved_answer": [
            "Wandel durch Handel"
        ]
    },
    {
        "NNQT_question": "What is {academic major} and {academic degree} of {{Robert J. Shiller} has {educated at} as {Massachusetts Institute of Technology}}",
        "uid": 10210,
        "subgraph": [],
        "template_index": 5,
        "question": "na",
        "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q338151 p:P69 ?s . ?s ps:P69 wd:Q49108 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }",
        "sparql_dbpedia18": "select distinct ?value1 ?value2 where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q338151> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q49108>. ?statement <http://www.wikidata.org/entity/P580> ?value1 . ?statement <http://www.wikidata.org/entity/P2842> ?value2 } ",
        "template": [],
        "answer": [
            "http://www.wikidata.org/entity/Q8134",
            "http://www.wikidata.org/entity/Q752297"
        ],
        "template_id": "2",
        "paraphrased_question": "na",
        "simplified_query": "SELECT ?l ?r WHERE { ?i property:educated_at resource:Massachusetts_Institute_of_Technology . ?i property:academic_degree ?r . resource:Robert_J._Shiller property:educated_at ?i . ?i property:academic_major ?l }",
        "solved_answer": [
            "economics",
            "Doctor of Philosophy"
        ]
    },
    {
        "NNQT_question": "What is the {human} for {notable work} of {The Count of Monte Cristo}",
        "uid": 20952,
        "subgraph": "simple question left",
        "template_index": 1298,
        "question": "n/a",
        "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P800 wd:Q191838 . ?sbj wdt:P31 wd:Q5 } ",
        "sparql_dbpedia18": "select distinct ?subj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?subj . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P800> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q191838> . ?subj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q5> } ",
        "template": "<?S P O ; ?S InstanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q38337"
        ],
        "template_id": "2",
        "paraphrased_question": "n/a",
        "simplified_query": "SELECT DISTINCT ?d WHERE { ?d property:notable_work resource:The_Count_of_Monte_Cristo . ?d rdf:type ontology:human }",
        "solved_answer": [
            "Alexandre Dumas"
        ]
    },
    {
        "NNQT_question": "Give me {integer} that starts with {'1'}",
        "uid": 24549,
        "subgraph": "string matching simple contains word",
        "template_index": 3849,
        "question": "What are the integer which start with the letter i",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12503 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), '1')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q12503>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), '1')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q12772971"
        ],
        "template_id": "2",
        "paraphrased_question": "What are the integer which begin with the letter i",
        "simplified_query": "SELECT DISTINCT ?r WHERE { FILTER ( STRSTARTS ( LCASE ( ?r ) , '1' ) ) . ?r rdf:type ontology:integer }",
        "solved_answer": [
            "10^51"
        ]
    },
    {
        "NNQT_question": "What is {opposite} of {manifestation of} of {figure of the Earth} ?",
        "uid": 16995,
        "subgraph": "right-subgraph",
        "template_index": 0,
        "question": "who opposite of manifestation  of figure of the earth ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q437882 wdt:P1557 ?X . ?X wdt:P461 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q437882> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1557>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P461> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q3297588"
        ],
        "template_id": "2",
        "paraphrased_question": "Which is the opposite of manifestation of figure of the earth?",
        "simplified_query": "SELECT ?e WHERE { ?z property:opposite_of ?e . resource:figure_of_the_Earth property:manifestation_of ?z }",
        "solved_answer": [
            "prolate spheroid"
        ]
    },
    {
        "NNQT_question": "What is {signs} of {has outcome} of {tantalum} ?",
        "uid": 17828,
        "subgraph": "right-subgraph",
        "template_index": 209,
        "question": "Mention the symptoms and the signs resulting from the tantalum",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1123 wdt:P1542 ?X . ?X wdt:P780 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1123> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1542>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P780> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q1799146",
            "http://www.wikidata.org/entity/Q11820606"
        ],
        "template_id": "2",
        "paraphrased_question": "Mention the symptoms and the signs and symptoms ensuing from the tantalum",
        "simplified_query": "SELECT ?b WHERE { ?m property:symptoms ?b . resource:tantalum property:has_effect ?m }",
        "solved_answer": [
            "irritant dermatitis",
            "eye irritation"
        ]
    },
    {
        "NNQT_question": "What is {born in} of {authors} of {M\u00e9moires d'Outre-Tombe} ?",
        "uid": 15087,
        "subgraph": "right-subgraph",
        "template_index": 35,
        "question": "Who created Memoires d'Outre-Tombe?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2263221 wdt:P50 ?X . ?X wdt:P19 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2263221> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P50>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q163108"
        ],
        "template_id": "2",
        "paraphrased_question": "Tell me who created Memoores d'Oure-Tombre.",
        "simplified_query": "SELECT ?g WHERE { resource:M\u00e9moires_d'Outre-Tombe property:author ?a . ?a property:place_of_birth ?g }",
        "solved_answer": [
            "Saint-Malo"
        ]
    },
    {
        "NNQT_question": "Give me {religious denomination} that starts with {'u'}",
        "uid": 24166,
        "subgraph": "string matching simple contains word",
        "template_index": 2745,
        "question": "Tell me the name of a religious denomination which starts with the letter u.",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13414953 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q13414953>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q106687",
            "http://www.wikidata.org/entity/Q3585467",
            "http://www.wikidata.org/entity/Q144905",
            "http://www.wikidata.org/entity/Q7893955",
            "http://www.wikidata.org/entity/Q120868406",
            "http://www.wikidata.org/entity/Q97738262",
            "http://www.wikidata.org/entity/Q671506",
            "http://www.wikidata.org/entity/Q955325",
            "http://www.wikidata.org/entity/Q1657009",
            "http://www.wikidata.org/entity/Q2062042",
            "http://www.wikidata.org/entity/Q1622507"
        ],
        "template_id": "2",
        "paraphrased_question": "Tell me the name of a religious denomination that begins with the letter u.",
        "simplified_query": "SELECT DISTINCT ?c WHERE { ?c rdf:type ontology:religious_denomination . FILTER ( STRSTARTS ( LCASE ( ?c ) , 'u' ) ) }",
        "solved_answer": [
            "Unitarianism",
            "Unified Buddhist Church of Vietnam",
            "United Protestant Church of Alsace and Lorraine",
            "Universal Foundation for Better Living",
            "Union of Baptist Churches of Benin",
            "Unity of the Brethren",
            "Unitarian Universalist Association",
            "United Lodge of Theosophists",
            "Usuli",
            "Unity Church",
            "Unitarian Universalism"
        ]
    }
]