[
    {
        "NNQT_question": "Give me {game of skill} that starts with {'t'}",
        "uid": 24738,
        "subgraph": "string matching simple contains word",
        "template_index": 634,
        "question": "What are the game of skill  which start with the letter t",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1368898 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1368898>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 't')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q14922",
            "http://www.wikidata.org/entity/Q939785",
            "http://www.wikidata.org/entity/Q1603503",
            "http://www.wikidata.org/entity/Q1621398",
            "http://www.wikidata.org/entity/Q3751197",
            "http://www.wikidata.org/entity/Q11701320",
            "http://www.wikidata.org/entity/Q30012386",
            "http://www.wikidata.org/entity/Q110262679",
            "http://www.wikidata.org/entity/Q44579270",
            "http://www.wikidata.org/entity/Q124097570"
        ],
        "template_id": "2",
        "paraphrased_question": "What are the amusement of aptitude which begin with the letter t",
        "simplified_query": "SELECT DISTINCT ?o WHERE { FILTER ( STRSTARTS ( LCASE ( ?o ) , 't' ) ) . ?o rdf:type ontology:game_of_skill }",
        "solved_answer": [
            "table football",
            "Tejo",
            "Tipp Kick",
            "Teetotum",
            "Toad in the hole",
            "Tiddlywinks",
            "The Rolling Witch",
            "Tumblin\u2019 Monkeys",
            "Tri-Ba-Lance",
            "The Fuzzies"
        ]
    },
    {
        "NNQT_question": "What is {antonym of} of {religious affiliation} of {Pol Pot} ?",
        "uid": 15795,
        "subgraph": "right-subgraph",
        "template_index": 1162,
        "question": "What is the antonym of Pol Pot?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q39464 wdt:P140 ?X . ?X wdt:P461 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q39464> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P140>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P461> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q620805"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the antonym of Pol Pot?",
        "simplified_query": "SELECT ?a WHERE { ?i property:opposite_of ?a . resource:Pol_Pot property:religion ?i }",
        "solved_answer": [
            "theism"
        ]
    },
    {
        "NNQT_question": "What is {first language} of {executive power headed by} of {North Rhine-Westphalia} ?",
        "uid": 17340,
        "subgraph": "right-subgraph",
        "template_index": 1030,
        "question": "who first language of executive power headed by of North Rhine-Westphalia?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1198 wdt:P6 ?X . ?X wdt:P103 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1198> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P6>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P103> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q188"
        ],
        "template_id": "2",
        "paraphrased_question": "who to begin with dialect of official control headed by of North Rhine-Westphalia?",
        "simplified_query": "SELECT ?u WHERE { ?b property:native_language ?u . resource:North_Rhine-Westphalia property:head_of_government ?b }",
        "solved_answer": [
            "German"
        ]
    },
    {
        "NNQT_question": "What is {profession} of {first described} of {(225088) 2007 OR10} ?",
        "uid": 15904,
        "subgraph": "right-subgraph",
        "template_index": 30,
        "question": "What is the job description of job posting 225088?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q6587 wdt:P61 ?X . ?X wdt:P106 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q6587> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q11063",
            "http://www.wikidata.org/entity/Q16742203"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the expected set of responsibilities of occupation posting 225088?",
        "simplified_query": "SELECT ?t WHERE { ?k property:occupation ?t . resource:225088_Gonggong property:discoverer_or_inventor ?k }",
        "solved_answer": [
            "astronomer",
            "planetary scientist"
        ]
    },
    {
        "NNQT_question": "Give me {scientific theory} that starts with {'u'}",
        "uid": 24449,
        "subgraph": "string matching simple contains word",
        "template_index": 1015,
        "question": "What are the scientific theory which start with the letter u",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3239681 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q3239681>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'u')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q44746"
        ],
        "template_id": "2",
        "paraphrased_question": "What are the logical hypothesis which begin with the letter u",
        "simplified_query": "SELECT DISTINCT ?w WHERE { FILTER ( STRSTARTS ( LCASE ( ?w ) , 'u' ) ) . ?w rdf:type ontology:scientific_theory }",
        "solved_answer": [
            "uncertainty principle"
        ]
    },
    {
        "NNQT_question": "What is {language official} of {topic of} of {history of Jamaica} ?",
        "uid": 16398,
        "subgraph": "right-subgraph",
        "template_index": 59,
        "question": "What is the official language of the topic of the history of Jamaica?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1994210 wdt:P1269 ?X . ?X wdt:P37 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1994210> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1269>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P37> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q1860"
        ],
        "template_id": "2",
        "paraphrased_question": "Name the official language of the history of Jamaica's topic.",
        "simplified_query": "SELECT ?w WHERE { ?z property:official_language ?w . resource:history_of_Jamaica property:facet_of ?z }",
        "solved_answer": [
            "English"
        ]
    },
    {
        "NNQT_question": "What is {operating profit} of {managed by} of {Taiwan High Speed Rail} ?",
        "uid": 17680,
        "subgraph": "right-subgraph",
        "template_index": 1296,
        "question": "What is the profit for Taiwan High Speed rail?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q706198 wdt:P137 ?X . ?X wdt:P3362 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q706198> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P137>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3362> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "19144964000"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the benefit for Taiwan Tall Speed rail?",
        "simplified_query": "SELECT ?c WHERE { ?b property:operating_income ?c . resource:Taiwan_High_Speed_Rail property:operator ?b }",
        "solved_answer": [
            "19144964000"
        ]
    },
    {
        "NNQT_question": "Did {Heart} {connects with} {artery} and {human body} ?",
        "uid": 921,
        "subgraph": "boolean double one_hop right subgraph",
        "template_index": 421,
        "question": "How does the heart connect with arteries in the human body?",
        "sparql_wikidata": "ASK WHERE { wd:Q1072 wdt:P2789 wd:Q9655 . wd:Q1072 wdt:P2789 wd:Q23852 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1072> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2789> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q9655>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1072> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2789> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q23852>. } ",
        "template": "Ask (ent-pred-obj1 . ent-pred-obj2`)",
        "answer": [
            false
        ],
        "template_id": "2",
        "paraphrased_question": "How do the arteries in the human body connect with the heart?",
        "simplified_query": "ASK WHERE { resource:heart property:connects_with resource:human_body . resource:heart property:connects_with resource:artery }",
        "solved_answer": [
            false
        ]
    },
    {
        "NNQT_question": "What is {depth over terrain} of {presented by} of {Good Morning America} ?",
        "uid": 17432,
        "subgraph": "right-subgraph",
        "template_index": 2003,
        "question": "What was the depth over terrain presented by Good Morning America?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q825946 wdt:P371 ?X . ?X wdt:P2048 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q825946> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P371>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2048> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "196",
            "70"
        ],
        "template_id": "2",
        "paraphrased_question": "Mention the depth over terrain as shown in Good Morning America.",
        "simplified_query": "SELECT ?t WHERE { resource:Good_Morning_America property:presenter ?a . ?a property:height ?t }",
        "solved_answer": [
            "196",
            "70"
        ]
    },
    {
        "NNQT_question": "What is {inhabitants} of {is in the arrondissement of} of {Apulia} ?",
        "uid": 14668,
        "subgraph": "right-subgraph",
        "template_index": 3394,
        "question": "What is the inhabitants of the arrondissement of Apulia ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1447 wdt:P131 ?X . ?X wdt:P1082 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1447> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P131>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1082> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "58850717"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the occupants of the arrondissement of Apulia ?",
        "simplified_query": "SELECT ?k WHERE { resource:Apulia property:located_in_the_administrative_territorial_entity ?j . ?j property:population ?k }",
        "solved_answer": [
            "58850717"
        ]
    },
    {
        "NNQT_question": "What is {national holiday} of {originates} of {The McGuire Sisters} ?",
        "uid": 14277,
        "subgraph": "right-subgraph",
        "template_index": 262,
        "question": "What national holiday references The McGuire Sisters?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q303238 wdt:P495 ?X . ?X wdt:P832 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q303238> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P495>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P832> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q86591",
            "http://www.wikidata.org/entity/Q196627",
            "http://www.wikidata.org/entity/Q367523",
            "http://www.wikidata.org/entity/Q371781",
            "http://www.wikidata.org/entity/Q744159",
            "http://www.wikidata.org/entity/Q751738",
            "http://www.wikidata.org/entity/Q755999",
            "http://www.wikidata.org/entity/Q848352",
            "http://www.wikidata.org/entity/Q2913791"
        ],
        "template_id": "2",
        "paraphrased_question": "What national occasion references The McGuire Sisters?",
        "simplified_query": "SELECT ?k WHERE { ?p property:public_holiday ?k . resource:The_McGuire_Sisters property:country_of_origin ?p }",
        "solved_answer": [
            "Independence Day",
            "New Year's Day",
            "Columbus Day",
            "Memorial Day",
            "Washington's Birthday",
            "Martin Luther King Jr. Day",
            "Veterans Day",
            "Labor Day",
            "Thanksgiving"
        ]
    },
    {
        "NNQT_question": "What is {afflicts} of {treats} of {ibuprofen} ?",
        "uid": 16187,
        "subgraph": "right-subgraph",
        "template_index": 550,
        "question": "Name the afflicts of ibuprofen",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q186969 wdt:P2175 ?X . ?X wdt:P689 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q186969> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2175>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P689> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q5",
            "http://www.wikidata.org/entity/Q8441",
            "http://www.wikidata.org/entity/Q1074",
            "http://www.wikidata.org/entity/Q7886",
            "http://www.wikidata.org/entity/Q9377",
            "http://www.wikidata.org/entity/Q9644",
            "http://www.wikidata.org/entity/Q192398",
            "http://www.wikidata.org/entity/Q193107",
            "http://www.wikidata.org/entity/Q193302",
            "http://www.wikidata.org/entity/Q575064",
            "http://www.wikidata.org/entity/Q7365",
            "http://www.wikidata.org/entity/Q47273"
        ],
        "template_id": "2",
        "paraphrased_question": "Title the harrows of ibuprofen",
        "simplified_query": "SELECT ?d WHERE { resource:ibuprofen property:medical_condition_treated ?h . ?h property:afflicts ?d }",
        "solved_answer": [
            "human",
            "man",
            "skin",
            "lung",
            "kidney",
            "joint",
            "pleural cavity",
            "sclera",
            "pericardium",
            "synovial membrane",
            "muscle",
            "central nervous system"
        ]
    },
    {
        "NNQT_question": "What is {date of commencement} of {role model} of {BASIC} ?",
        "uid": 14506,
        "subgraph": "right-subgraph",
        "template_index": 274,
        "question": "When is the basic commencement date?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q42979 wdt:P737 ?X . ?X wdt:P571 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q42979> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P737>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P571> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "1957-01-01T00:00:00Z",
            "1958-01-01T00:00:00Z",
            "1963-01-01T00:00:00Z"
        ],
        "template_id": "2",
        "paraphrased_question": "which of the towns has endemism of verdant seadragon?",
        "simplified_query": "SELECT ?k WHERE { resource:BASIC property:influenced_by ?a . ?a property:inception ?k }",
        "solved_answer": [
            "1957-01-01T00:00:00Z",
            "1958-01-01T00:00:00Z",
            "1963-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "What is {category of associated people} of {adjacent to} of {Extremadura} ?",
        "uid": 15268,
        "subgraph": "right-subgraph",
        "template_index": 119,
        "question": "How are called the person living next to Extremadura?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q5777 wdt:P47 ?X . ?X wdt:P1792 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5777> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P47>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1792> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q7916059",
            "http://www.wikidata.org/entity/Q7916064",
            "http://www.wikidata.org/entity/Q7905836"
        ],
        "template_id": "2",
        "paraphrased_question": "How are called the individual living following to Extremadura?",
        "simplified_query": "SELECT ?o WHERE { ?i property:category_of_associated_people ?o . resource:Extremadura property:shares_border_with ?i }",
        "solved_answer": [
            "Category:People from Castile and Le\u00f3n",
            "Category:People from Castilla\u2013La Mancha",
            "Category:People from Andalusia"
        ]
    },
    {
        "NNQT_question": "What is {predecessor} of {position held by head of government} of {Tainan} ?",
        "uid": 16735,
        "subgraph": "right-subgraph",
        "template_index": 3044,
        "question": "who is predecessor of position held by head of government of Tainan ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q140631 wdt:P1313 ?X . ?X wdt:P1365 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q140631> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1313>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1365> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q50293073",
            "http://www.wikidata.org/entity/Q65680013"
        ],
        "template_id": "2",
        "paraphrased_question": "Who preceded the position held by Tainan's head of government?",
        "simplified_query": "SELECT ?u WHERE { ?b property:replaces ?u . resource:Tainan property:office_held_by_head_of_government ?b }",
        "solved_answer": [
            "Magistrate of Tainan County",
            "Mayor of Tainan"
        ]
    },
    {
        "NNQT_question": "What is {dedicatee} of {place of interment} of {Jude the Apostle} ?",
        "uid": 17696,
        "subgraph": "right-subgraph",
        "template_index": 1136,
        "question": "Who was the dedicatee at the place of interment for Jude the Apostle?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q43945 wdt:P119 ?X . ?X wdt:P825 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q43945> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P119>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P825> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q33923"
        ],
        "template_id": "2",
        "paraphrased_question": "Who was the dedicatee at the put of interment for Jude the Apostle?",
        "simplified_query": "SELECT ?f WHERE { resource:Jude_the_Apostle property:place_of_burial ?y . ?y property:dedicated_to ?f }",
        "solved_answer": [
            "Peter"
        ]
    },
    {
        "NNQT_question": "What is {start time} and {end time} of {{Abigail Adams} has {spouse} as {John Adams}}",
        "uid": 10592,
        "subgraph": [],
        "template_index": 731,
        "question": "When did Abigail Adams marry John Adams and when did they divorce",
        "sparql_wikidata": "SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P26 ?s . ?s ps:P26 wd:Q11806 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }",
        "sparql_dbpedia18": "select distinct ?value1 ?value2 where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q206191> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P26> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q11806>. ?statement <http://www.wikidata.org/entity/P580> ?value1 . ?statement <http://www.wikidata.org/entity/P2842> ?value2 } ",
        "template": [],
        "answer": [
            "1818-10-28T00:00:00Z",
            "1764-10-25T00:00:00Z"
        ],
        "template_id": "2",
        "paraphrased_question": "Name the marriage and divorce dates of John and Abigail Adams.",
        "simplified_query": "SELECT ?l ?w WHERE { ?e property:end_time ?w . resource:Abigail_Adams property:spouse ?e . ?e property:spouse resource:John_Adams . ?e property:start_time ?l }",
        "solved_answer": [
            "1818-10-28T00:00:00Z",
            "1764-10-25T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "What is {comes from} of {label} of {LCD Soundsystem} ?",
        "uid": 14552,
        "subgraph": "right-subgraph",
        "template_index": 1230,
        "question": "WHAT COMES FROM LABEL OF LCD SOUNDSYSTEM ?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q45752 wdt:P264 ?X . ?X wdt:P495 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q45752> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P264>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P495> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q30"
        ],
        "template_id": "2",
        "paraphrased_question": "WHAT COMES FROM Name OF LCD SOUNDSYSTEM ?",
        "simplified_query": "SELECT ?s WHERE { ?v property:country_of_origin ?s . resource:LCD_Soundsystem property:record_label ?v }",
        "solved_answer": [
            "United States of America"
        ]
    },
    {
        "NNQT_question": "What is {easterly} of {national of} of {Henry Luce} ?",
        "uid": 14452,
        "subgraph": "right-subgraph",
        "template_index": 2590,
        "question": "What is east of Henry Luce's nation?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q516473 wdt:P27 ?X . ?X wdt:P1334 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q516473> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P27>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1334> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "Point(-66.94995403 44.81539337)"
        ],
        "template_id": "2",
        "paraphrased_question": "What is east of Henry Luce's country?",
        "simplified_query": "SELECT ?l WHERE { ?d property:coordinates_of_easternmost_point ?l . resource:Henry_Luce property:country_of_citizenship ?d }",
        "solved_answer": [
            "Point(-66.94995403 44.81539337)"
        ]
    },
    {
        "NNQT_question": "What is the {dwarf elliptical galaxy} for {parent astronomical body} of {Andromeda Galaxy}",
        "uid": 21569,
        "subgraph": "simple question left",
        "template_index": 1915,
        "question": "Which dwarf elliptical galaxy for parent astronomical body of  Andromeda Galaxy",
        "sparql_wikidata": " select distinct ?sbj where { ?sbj wdt:P397 wd:Q2469 . ?sbj wdt:P31 wd:Q234077 } ",
        "sparql_dbpedia18": "select distinct ?subj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?subj . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P397> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2469> . ?subj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q234077> } ",
        "template": "<?S P O ; ?S InstanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q490334",
            "http://www.wikidata.org/entity/Q4662",
            "http://www.wikidata.org/entity/Q13720"
        ],
        "template_id": "2",
        "paraphrased_question": "Which elliptical dwarf galaxy for Andromeda Galaxy's parent astronomical body",
        "simplified_query": "SELECT DISTINCT ?c WHERE { ?c rdf:type ontology:dwarf_elliptical_galaxy . ?c property:parent_astronomical_body resource:Andromeda_Galaxy }",
        "solved_answer": [
            "NGC 185",
            "Messier 110",
            "Messier 32"
        ]
    }
]