[
    {
        "NNQT_question": "What is the {natural number} with the {MAX(numeric value)} whose {instance of} is {natural number}  ?",
        "uid": 3090,
        "subgraph": "rank",
        "template_index": 289,
        "question": "which natural number with the highest numeric value whose instance is natural number?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q21199 . ?ent wdt:P1181 ?obj . ?ent wdt:P31 wd:Q21199 } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q21199>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1181>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q21199> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q67146010",
            "http://www.wikidata.org/entity/Q18449905",
            "http://www.wikidata.org/entity/Q18449908",
            "http://www.wikidata.org/entity/Q18452249",
            "http://www.wikidata.org/entity/Q67174318"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "Which natural number with the highest numeric value has instance being also a natural number?",
        "simplified_query": "SELECT ?q WHERE { ?q rdf:type ontology:natural_number . ?q rdf:type ontology:natural_number . ?q property:numeric_value ?v }",
        "solved_answer": [
            "10\u00b9\u00b2\u2076\u22121",
            "10^123",
            "10^120",
            "10^117",
            "36746043666799590428244633799627952632279158164343087642676032283815739666511279233373417143396810270092798736308917"
        ]
    },
    {
        "NNQT_question": "What is the {taxon} with the {MAX(genome size)} whose {taxon rank} is {species}  ?",
        "uid": 3016,
        "subgraph": "rank",
        "template_index": 215,
        "question": "What is the largest group of species?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P2143 ?obj . ?ent wdt:P105 wd:Q7432 } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q16521>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2143>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P105> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q7432> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q161098"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "Give me the largest group of species",
        "simplified_query": "SELECT ?k WHERE { ?k rdf:type ontology:taxon . ?k property:genome_size ?u . ?k property:taxon_rank resource:species }",
        "solved_answer": [
            "Triticum aestivum"
        ]
    },
    {
        "NNQT_question": "What is the {film} with the {MAX(average shot length)} whose {original language of work} is {English}  ?",
        "uid": 3153,
        "subgraph": "rank",
        "template_index": 352,
        "question": "Which English film has the longest average shot length?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q11424 . ?ent wdt:P2208 ?obj . ?ent wdt:P364 wd:Q1860 } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q11424>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2208>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P364> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1860> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q20649989",
            "http://www.wikidata.org/entity/Q695209",
            "http://www.wikidata.org/entity/Q156608"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "What film has the longest average shot length in England?",
        "simplified_query": "SELECT ?f WHERE { ?f rdf:type ontology:film . ?f property:original_language_of_film_or_TV_show resource:English . ?f property:average_shot_length ?w }",
        "solved_answer": [
            "Too Late",
            "The Mist",
            "The Bourne Supremacy"
        ]
    },
    {
        "NNQT_question": "What is the {extrasolar planet} with the {MIN(radius)} whose {constellation} is {Aquarius}  ?",
        "uid": 3377,
        "subgraph": "rank",
        "template_index": 599,
        "question": "Which extrasolar planet within the constellation Aquarius has the smallest radius?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q44559 . ?ent wdt:P2120 ?obj . ?ent wdt:P59 wd:Q10576} ORDER BY ASC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q44559>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2120>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P59> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q10576> .\n\n}\nORDER BY ASC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q83997082",
            "http://www.wikidata.org/entity/Q114794899",
            "http://www.wikidata.org/entity/Q92688142",
            "http://www.wikidata.org/entity/Q92688127",
            "http://www.wikidata.org/entity/Q27048790"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "What is the name of the extrasolar planet with the smallest radius inside the Aquarius constellation?",
        "simplified_query": "SELECT ?k WHERE { ?k property:radius ?o . ?k rdf:type ontology:extrasolar_planet . ?k property:constellation resource:Aquarius }",
        "solved_answer": [
            "K2-116b",
            "EPIC 246078343 b",
            "K2-303b",
            "K2-300b",
            "K2-72d"
        ]
    },
    {
        "NNQT_question": "What is the {human} with the {MAX(points for)} whose {instance of} is {human}  ?",
        "uid": 2858,
        "subgraph": "rank",
        "template_index": 57,
        "question": "What person has the highest score?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1358 ?obj . ?ent wdt:P31 wd:Q5 } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q5>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1358>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q5> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q9673",
            "http://www.wikidata.org/entity/Q42311",
            "http://www.wikidata.org/entity/Q10514",
            "http://www.wikidata.org/entity/Q2239218",
            "http://www.wikidata.org/entity/Q11192"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "Who has the highest score?",
        "simplified_query": "SELECT ?v WHERE { ?v property:points_for ?a . ?v rdf:type ontology:human . ?v rdf:type ontology:human }",
        "solved_answer": [
            "Lewis Hamilton",
            "Sebastian Vettel",
            "Fernando Alonso",
            "Max Verstappen",
            "Kimi R\u00e4ikk\u00f6nen"
        ]
    },
    {
        "NNQT_question": "What is the {hotel} with the {MIN(angle from vertical)} whose {country} is {Denmark}  ?",
        "uid": 3319,
        "subgraph": "rank",
        "template_index": 541,
        "question": "What Denmark hotel has the least angle from vertical?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q27686 . ?ent wdt:P4183 ?obj . ?ent wdt:P17 wd:Q35} ORDER BY ASC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q27686>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4183>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P17> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q35> .\n\n}\nORDER BY ASC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q545283"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "Name the hotel that has the least angle from vertical located in Denmark.",
        "simplified_query": "SELECT ?q WHERE { ?q property:angle_from_vertical ?c . ?q property:country resource:Denmark . ?q rdf:type ontology:hotel }",
        "solved_answer": [
            "Bella Sky Hotel"
        ]
    },
    {
        "NNQT_question": "What is the {republic} with the {MIN(nominal GDP)} whose {member of} is {International Finance Corporation}  ?",
        "uid": 3305,
        "subgraph": "rank",
        "template_index": 527,
        "question": "Which republic with the a minimal nominal GDP is a member of the International Finance Corporation?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q7270 . ?ent wdt:P2131 ?obj . ?ent wdt:P463 wd:Q656801} ORDER BY ASC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q7270>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2131>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P463> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q656801> .\n\n}\nORDER BY ASC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q695",
            "http://www.wikidata.org/entity/Q1039",
            "http://www.wikidata.org/entity/Q1042"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "Which republic possessing a nominal GDP of minimal is a member of the International Finance Corporation?",
        "simplified_query": "SELECT ?x WHERE { ?x rdf:type ontology:republic . ?x property:nominal_GDP ?s . ?x property:member_of resource:International_Finance_Corporation }",
        "solved_answer": [
            "Palau",
            "S\u00e3o Tom\u00e9 and Pr\u00edncipe",
            "Seychelles"
        ]
    },
    {
        "NNQT_question": "What is the {galaxy} with the {MIN(redshift)} whose {constellation} is {Bo\u00f6tes}  ?",
        "uid": 3350,
        "subgraph": "rank",
        "template_index": 572,
        "question": "What is the galaxy with the lowest redshift whose constellation is Bo\u00f6tes?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q318 . ?ent wdt:P1090 ?obj . ?ent wdt:P59 wd:Q8667} ORDER BY ASC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q318>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1090>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P59> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q8667> .\n\n}\nORDER BY ASC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q78318747",
            "http://www.wikidata.org/entity/Q2483957",
            "http://www.wikidata.org/entity/Q76656060",
            "http://www.wikidata.org/entity/Q81437156",
            "http://www.wikidata.org/entity/Q83898722"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "What is the lowest redshift galaxy with Bo\u00f6tes constellation?",
        "simplified_query": "SELECT ?h WHERE { ?h property:redshift ?v . ?h property:constellation resource:Bo\u00f6tes . ?h rdf:type ontology:galaxy }",
        "solved_answer": [
            "UGC 9324",
            "Bo\u00f6tes II",
            "AGC 233770",
            "2MASX J14073347+1438062",
            "SDSS J143607.76+275558.3"
        ]
    },
    {
        "NNQT_question": "What is the {galaxy} with the {MAX(radial velocity)} whose {constellation} is {Eridanus}  ?",
        "uid": 3067,
        "subgraph": "rank",
        "template_index": 266,
        "question": "Which galaxy with the Eridanus constellation has the fastest radial velocity?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q318 . ?ent wdt:P2216 ?obj . ?ent wdt:P59 wd:Q10433 } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q318>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2216>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P59> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q10433> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q88262483",
            "http://www.wikidata.org/entity/Q78115053",
            "http://www.wikidata.org/entity/Q88262423",
            "http://www.wikidata.org/entity/Q78113470",
            "http://www.wikidata.org/entity/Q88262456"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "Within the Eridanus constellation, what galaxy has the fastest radial velocity?",
        "simplified_query": "SELECT ?d WHERE { ?d rdf:type ontology:galaxy . ?d property:constellation resource:Eridanus . ?d property:radial_velocity ?p }",
        "solved_answer": [
            "[MAC2016] M0416pf 25",
            "[MMD2015] HFF2P-9-2",
            "[MAC2016] M0416pf 19",
            "[MMD2015] HFF2C-9-3",
            "[MAC2016] M0416pf 103"
        ]
    },
    {
        "NNQT_question": "What is the {galaxy} with the {MIN(apparent magnitude)} whose {discoverer or inventor} is {William Herschel}  ?",
        "uid": 3309,
        "subgraph": "rank",
        "template_index": 531,
        "question": "Give the name of galaxy with less apparent magnitude and was discovered by William Herschel?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q318 . ?ent wdt:P1215 ?obj . ?ent wdt:P61 wd:Q14277} ORDER BY ASC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q318>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1215>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q14277> .\n\n}\nORDER BY ASC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MIN (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q1047275",
            "http://www.wikidata.org/entity/Q2085330",
            "http://www.wikidata.org/entity/Q1146976",
            "http://www.wikidata.org/entity/Q1146871",
            "http://www.wikidata.org/entity/Q1149335"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "What galaxy, discovered by William Herschel, has the less apparent magnitude?",
        "simplified_query": "SELECT ?e WHERE { ?e rdf:type ontology:galaxy . ?e property:apparent_magnitude ?m . ?e property:discoverer_or_inventor resource:William_Herschel }",
        "solved_answer": [
            "NGC 2167",
            "NGC 6284",
            "NGC 6664",
            "NGC 6647",
            "NGC 7062"
        ]
    },
    {
        "NNQT_question": "What is the {human} with the {MAX(EGF rating)} whose {country of citizenship} is {Romania}  ?",
        "uid": 3065,
        "subgraph": "rank",
        "template_index": 264,
        "question": "What person who's a citizen of Romania has the highest EGF rating?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P4105 ?obj . ?ent wdt:P27 wd:Q218 } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q5>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4105>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P27> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q218> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q3038855"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "What Romanian has the top rating via EGF?",
        "simplified_query": "SELECT ?e WHERE { ?e rdf:type ontology:human . ?e property:EGF_rating ?q . ?e property:country_of_citizenship resource:Romania }",
        "solved_answer": [
            "Drago\u0219 B\u0103jenaru"
        ]
    },
    {
        "NNQT_question": "What is the {dwarf planet} with the {MAX(argument of periapsis)} whose {child astronomical body} is {Dysnomia}  ?",
        "uid": 3051,
        "subgraph": "rank",
        "template_index": 250,
        "question": "Can you tell me which dwarf planet with the largest argument of periapsis has a moon called Dysnomia?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q2199 . ?ent wdt:P2248 ?obj . ?ent wdt:P398 wd:Q102656 } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q2199>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2248>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P398> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q102656> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q611"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "Which small plant with large periapsis has a moon Dysnomia?",
        "simplified_query": "SELECT ?d WHERE { ?d property:argument_of_periapsis ?p . ?d property:child_astronomical_body resource:Dysnomia . ?d rdf:type ontology:dwarf_planet }",
        "solved_answer": [
            "Eris"
        ]
    },
    {
        "NNQT_question": "What is the {destroyer} with the {MAX(draft)} whose {instance of} is {destroyer}  ?",
        "uid": 3032,
        "subgraph": "rank",
        "template_index": 231,
        "question": "What destroyer has the largest draft?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q174736 . ?ent wdt:P2262 ?obj . ?ent wdt:P31 wd:Q174736 } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q174736>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2262>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q174736> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q5630698",
            "http://www.wikidata.org/entity/Q1029315",
            "http://www.wikidata.org/entity/Q3180556",
            "http://www.wikidata.org/entity/Q3334295",
            "http://www.wikidata.org/entity/Q3334296"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "which of the Destroyer Craft has the most substantial draft?",
        "simplified_query": "SELECT ?e WHERE { ?e property:draft ?y . ?e rdf:type ontology:destroyer . ?e rdf:type ontology:destroyer }",
        "solved_answer": [
            "HMCS Annapolis",
            "HMS Hero",
            "USS Aaron Ward",
            "HMCS Huron",
            "HMCS Iroquois"
        ]
    },
    {
        "NNQT_question": "What is the {geographic region} with the {MAX(number of out of school children)} whose {part of} is {Asia}  ?",
        "uid": 2910,
        "subgraph": "rank",
        "template_index": 109,
        "question": "What is the geographic region with the highest number of out of school children whose part of is Asia ?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q82794 . ?ent wdt:P2573 ?obj . ?ent wdt:P361 wd:Q48 } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q82794>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2573>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P361> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q48> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q771405",
            "http://www.wikidata.org/entity/Q11708",
            "http://www.wikidata.org/entity/Q27231",
            "http://www.wikidata.org/entity/Q27293",
            "http://www.wikidata.org/entity/Q27275"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "Which Asian geographic region has the highest number of children who are out of school?",
        "simplified_query": "SELECT ?p WHERE { ?p property:part_of resource:Asia . ?p property:number_of_out-of-school_children ?r . ?p rdf:type ontology:geographic_region }",
        "solved_answer": [
            "South Asia",
            "Southeast Asia",
            "East Asia",
            "West Asia",
            "Central Asia"
        ]
    },
    {
        "NNQT_question": "What is the {asteroid} with the {MAX(radius)} whose {site of astronomical discovery} is {Mauna Kea Observatories}  ?",
        "uid": 3000,
        "subgraph": "rank",
        "template_index": 199,
        "question": "In the Mauna Kea Observatories, which asteroid had the maximum radius?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2120 ?obj . ?ent wdt:P65 wd:Q831790 } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q3863>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2120>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P65> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q831790> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q12782095",
            "http://www.wikidata.org/entity/Q15040226",
            "http://www.wikidata.org/entity/Q15033490",
            "http://www.wikidata.org/entity/Q15040223"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "Which asteroid in the Manuna Kea Observatories has the maximum radius?",
        "simplified_query": "SELECT ?p WHERE { ?p property:radius ?i . ?p rdf:type ontology:asteroid . ?p property:site_of_astronomical_discovery resource:Mauna_Kea_Observatories }",
        "solved_answer": [
            "(60621) 2000 FE8",
            "(364171) 2006 JZ81",
            "(469420) 2001 XP254",
            "341520 Mors\u2013Somnus"
        ]
    },
    {
        "NNQT_question": "What is the {human} with the {MAX(Elo rating)} whose {sport} is {chess}  ?",
        "uid": 2974,
        "subgraph": "rank",
        "template_index": 173,
        "question": "What is the human with the highest Elo rating whose sport is chess?",
        "sparql_wikidata": "select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1087 ?obj . ?ent wdt:P641 wd:Q718 } ORDER BY DESC(?obj)LIMIT 5 ",
        "sparql_dbpedia18": "select ?ent where {\n?ent <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q5>.\n\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1087>.\n?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj1.\n\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?ent .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P641> .\n?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q718> .\n\n}\nORDER BY DESC(?obj1)\nLIMIT 5",
        "template": "?E is_a Type. ?E pred Obj. ?E-secondClause value. MAX (value)",
        "answer": [
            "http://www.wikidata.org/entity/Q28614"
        ],
        "template_id": "Rank2",
        "paraphrased_question": "What human has the highest Elo rating in chess?",
        "simplified_query": "SELECT ?s WHERE { ?s property:Elo_rating ?c . ?s property:sport resource:chess . ?s rdf:type ontology:human }",
        "solved_answer": [
            "Garry Kasparov"
        ]
    }
]