[
    {
        "NNQT_question": "What is the {horse} for {mount} of {Robert E. Lee}",
        "uid": 20399,
        "subgraph": "simple question right",
        "template_index": 745,
        "question": "Horse used by Robert E. Lee during mounting.",
        "sparql_wikidata": " select distinct ?obj where { wd:Q165557 wdt:P3091 ?obj . ?obj wdt:P31 wd:Q726 } ",
        "sparql_dbpedia18": "select distinct ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q165557> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3091> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?obj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q726> } ",
        "template": " <S P ?O ; ?O instanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q952566"
        ],
        "template_id": "1",
        "paraphrased_question": "Mention of the horse used during mounting by Robert E. Lee.",
        "simplified_query": "SELECT DISTINCT ?u WHERE { resource:Robert_E._Lee property:mount ?u . ?u rdf:type ontology:horse }",
        "solved_answer": [
            "Traveller"
        ]
    },
    {
        "NNQT_question": "Did {Sarah_Silverman} {instrument} {guitar}?",
        "uid": 201,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 201,
        "question": "Did Sarah Silverman play the guitar?",
        "sparql_wikidata": "ASK WHERE { wd:Q229013 wdt:P1303 wd:Q6607 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q229013> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1303> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6607>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            true
        ],
        "template_id": "1",
        "paraphrased_question": "Did Sarah Silverman knows to play the guitar?",
        "simplified_query": "ASK WHERE { resource:Sarah_Silverman property:instrument resource:guitar }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "Give me {milk tea} that contains the word {tarik} in their name",
        "uid": 23608,
        "subgraph": "string matching simple contains word",
        "template_index": 2913,
        "question": "Tell me milk tea whose name has the word tarik in it.",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1884224 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tarik')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1884224>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'tarik')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; contains word >",
        "answer": [
            "http://www.wikidata.org/entity/Q3174775"
        ],
        "template_id": "1",
        "paraphrased_question": "Let me know drain tea whose title has the word tarik in it.",
        "simplified_query": "SELECT DISTINCT ?r WHERE { FILTER ( CONTAINS ( LCASE ( ?r ) , 'tarik' ) ) . ?r rdf:type ontology:Milk_tea }",
        "solved_answer": [
            "Teh Tarik"
        ]
    },
    {
        "NNQT_question": "Did {Burt_Reynolds} {country of citizenship} {United States of America}?",
        "uid": 290,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 290,
        "question": "Is Burt Reynolds a citizen of America?",
        "sparql_wikidata": "ASK WHERE { wd:Q202148 wdt:P27 wd:Q30 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q202148> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P27> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q30>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            true
        ],
        "template_id": "1",
        "paraphrased_question": "Is Burt Reynolds a US citizen?",
        "simplified_query": "ASK WHERE { resource:Burt_Reynolds property:country_of_citizenship resource:United_States_of_America }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "What is {writer} of {On Liberty}, that has {birth date} is {1806-5-20} ?",
        "uid": 12150,
        "subgraph": "right-subgraph",
        "template_index": 1671,
        "question": "Who is the writer of On Liberty who's birthday is May 20, 1806?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1055881 wdt:P50 ?answer . ?answer wdt:P569 ?x FILTER(contains(YEAR(?x),'1806'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1055881> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P50>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P569> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1806-5-20> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q50020"
        ],
        "template_id": "1",
        "paraphrased_question": "Who is the creator of On Liberty who's birthday is May 20, 1806?",
        "simplified_query": "SELECT ?k WHERE { FILTER ( CONTAINS ( YEAR ( ?t ) , '1806' ) ) . resource:On_Liberty property:author ?k . ?k property:date_of_birth ?t }",
        "solved_answer": [
            "John Stuart Mill"
        ]
    },
    {
        "NNQT_question": "What is the {participant} and the {location} of {Battle_of_Gettysburg} ?",
        "uid": 9535,
        "subgraph": "two intentions right subgraph",
        "template_index": 137,
        "question": "Where was the location of the Battle of Gettysburg and who were the participation that fought in that war?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q33132 wdt:P710 ?ans_1 . wd:Q33132 wdt:P276 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q33132> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P710> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q33132> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P276> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q351865",
            "http://www.wikidata.org/entity/Q30",
            "http://www.wikidata.org/entity/Q81931",
            "http://www.wikidata.org/entity/Q165557",
            "http://www.wikidata.org/entity/Q297121"
        ],
        "template_id": "1",
        "paraphrased_question": "What was the location of, and who were the participants in the Battle of Gettysburg?",
        "simplified_query": "SELECT ?f ?x WHERE { resource:Battle_of_Gettysburg property:participant ?f . resource:Battle_of_Gettysburg property:location ?x }",
        "solved_answer": [
            "Adams County",
            "United States of America",
            "Confederate States",
            "Robert E. Lee",
            "George Meade"
        ]
    },
    {
        "NNQT_question": "Give me {human settlement} that contains the word {zanzibar} in their name",
        "uid": 23478,
        "subgraph": "string matching simple contains word",
        "template_index": 3015,
        "question": "TELL ME HUMAN SETTLEMENT WHOSE NAME HAS THE WORD ZANZIBAR IN  IT.",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q486972 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zanzibar')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q486972>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zanzibar')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; contains word >",
        "answer": [
            "http://www.wikidata.org/entity/Q5242993",
            "http://www.wikidata.org/entity/Q10838398"
        ],
        "template_id": "1",
        "paraphrased_question": "TELL ME HUMAN SETTLEMENT WHOSE NAME HAS THE WORD ZANZIBAR IN IT.",
        "simplified_query": "SELECT DISTINCT ?n WHERE { FILTER ( CONTAINS ( LCASE ( ?n ) , 'zanzibar' ) ) . ?n rdf:type ontology:human_settlement }",
        "solved_answer": [
            "Daya, Zanzibar",
            "Zanzibar South and Central"
        ]
    },
    {
        "NNQT_question": "Give me {chemical substance} that contains the word {zeolite} in their name",
        "uid": 23721,
        "subgraph": "string matching simple contains word",
        "template_index": 3729,
        "question": "Tell me chemical substance whose name has the word zeolite in it.",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q79529 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeolite')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q79529>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'zeolite')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; contains word >",
        "answer": [
            "http://www.wikidata.org/entity/Q191326"
        ],
        "template_id": "1",
        "paraphrased_question": "Let me know chemical substance whose title has the word zeolite in it.",
        "simplified_query": "SELECT DISTINCT ?h WHERE { ?h rdf:type ontology:Chemical_substance . FILTER ( CONTAINS ( LCASE ( ?h ) , 'zeolite' ) ) }",
        "solved_answer": [
            "zeolite Y"
        ]
    },
    {
        "NNQT_question": "Did {World_War_II} {location} {Mediterranean Sea}?",
        "uid": 244,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 244,
        "question": "Did World War II took place in Mediterranean Sea?",
        "sparql_wikidata": "ASK WHERE { wd:Q362 wdt:P276 wd:Q4918 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q362> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P276> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q4918>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            true
        ],
        "template_id": "1",
        "paraphrased_question": "Is it true that World War II took place in Mediterranean Sea?",
        "simplified_query": "ASK WHERE { resource:World_War_II property:location resource:Mediterranean_Sea }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "What is the {owned by} and the {founded by} of {JPMorgan_Chase} ?",
        "uid": 9973,
        "subgraph": "two intentions right subgraph",
        "template_index": 429,
        "question": "Who owns and founded the company JPMorgan Chase?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q192314 wdt:P127 ?ans_1 . wd:Q192314 wdt:P112 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q192314> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P127> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q192314> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P112> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q54168",
            "http://www.wikidata.org/entity/Q219635",
            "http://www.wikidata.org/entity/Q849363"
        ],
        "template_id": "1",
        "paraphrased_question": "Who is the founder and owner of the JPMorgan Chase company?",
        "simplified_query": "SELECT ?z ?s WHERE { resource:JPMorgan_Chase property:owned_by ?z . resource:JPMorgan_Chase property:founded_by ?s }",
        "solved_answer": [
            "J. P. Morgan",
            "BlackRock",
            "The Vanguard Group"
        ]
    },
    {
        "NNQT_question": "Did {John_Wayne} {partner} {Marlene Dietrich}?",
        "uid": 220,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 220,
        "question": "Is John Wayne and Marlene Dietricha a couple?",
        "sparql_wikidata": "ASK WHERE { wd:Q40531 wdt:P451 wd:Q4612 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q40531> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P451> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q4612>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            true
        ],
        "template_id": "1",
        "paraphrased_question": "Are John Wayne and Marlene Dietricha in a relationship?",
        "simplified_query": "ASK WHERE { resource:John_Wayne property:unmarried_partner resource:Marlene_Dietrich }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "What is the {discoverer or inventor} and the {named after} of {Titanium} ?",
        "uid": 9914,
        "subgraph": "two intentions right subgraph",
        "template_index": 99,
        "question": "Who is the Inventor who was named after Titanium?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q716 wdt:P61 ?ans_1 . wd:Q716 wdt:P138 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q716> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P61> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q716> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P138> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q58575",
            "http://www.wikidata.org/entity/Q45713"
        ],
        "template_id": "1",
        "paraphrased_question": "An inventor was named after Titanium- who?",
        "simplified_query": "SELECT ?g ?z WHERE { resource:titanium property:named_after ?z . resource:titanium property:discoverer_or_inventor ?g }",
        "solved_answer": [
            "Friedrich W\u00f6hler",
            "titan"
        ]
    },
    {
        "NNQT_question": "Did {Srinivasa_Ramanujan} {field of work} {number theory}?",
        "uid": 96,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 96,
        "question": "Was Srinivasa Ramanujan's field of work number theory?",
        "sparql_wikidata": "ASK WHERE { wd:Q83163 wdt:P101 wd:Q12479 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q83163> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P101> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q12479>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            true
        ],
        "template_id": "1",
        "paraphrased_question": "Did Srinivasa Ramanujan do number theory?",
        "simplified_query": "ASK WHERE { resource:Srinivasa_Ramanujan property:field_of_work resource:number_theory }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "Did {Stephen_King} {place of birth} {Portland}?",
        "uid": 461,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 461,
        "question": "Was Stephen King born in Portland?",
        "sparql_wikidata": "ASK WHERE { wd:Q39829 wdt:P19 wd:Q49201 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q39829> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q49201>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            true
        ],
        "template_id": "1",
        "paraphrased_question": "Was Portland the birth place of Stephen King?",
        "simplified_query": "ASK WHERE { resource:Stephen_King property:place_of_birth resource:Portland }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "What is the {director of photography} and the {director} of {Blade_Runner} ?",
        "uid": 9978,
        "subgraph": "two intentions right subgraph",
        "template_index": 499,
        "question": "Who is the Director of Photography and the Director of Blade Runner?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q184843 wdt:P344 ?ans_1 . wd:Q184843 wdt:P57 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q184843> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P344> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q184843> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P57> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q715198",
            "http://www.wikidata.org/entity/Q56005"
        ],
        "template_id": "1",
        "paraphrased_question": "In Blade Runner, who are the directory and the directory of photography?",
        "simplified_query": "SELECT ?p ?d WHERE { resource:Blade_Runner property:director_of_photography ?p . resource:Blade_Runner property:director ?d }",
        "solved_answer": [
            "Jordan Cronenweth",
            "Ridley Scott"
        ]
    },
    {
        "NNQT_question": "Did {John_F._Kennedy} {native language} {Old English}?",
        "uid": 133,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 133,
        "question": "Was Old English John F. Kennedy's native language?",
        "sparql_wikidata": "ASK WHERE { wd:Q9696 wdt:P103 wd:Q42365 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q9696> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P103> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q42365>. } ",
        "template": "Ask (ent-pred-obj`)",
        "answer": [
            false
        ],
        "template_id": "1",
        "paraphrased_question": "Was John F. Kennedy's native language Old English?",
        "simplified_query": "ASK WHERE { resource:John_F._Kennedy property:native_language resource:Old_English }",
        "solved_answer": [
            false
        ]
    },
    {
        "NNQT_question": "What is the {place of birth} and the {place of death} of {Jane_Austen} ?",
        "uid": 9477,
        "subgraph": "two intentions right subgraph",
        "template_index": 430,
        "question": "Where was Jane Austen born and where did she die?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q36322 wdt:P19 ?ans_1 . wd:Q36322 wdt:P20 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q36322> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q36322> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q1231836",
            "http://www.wikidata.org/entity/Q172157"
        ],
        "template_id": "1",
        "paraphrased_question": "Where was Jane Austen born and where did she die?",
        "simplified_query": "SELECT ?g ?t WHERE { resource:Jane_Austen property:place_of_birth ?g . resource:Jane_Austen property:place_of_death ?t }",
        "solved_answer": [
            "Steventon",
            "Winchester"
        ]
    },
    {
        "NNQT_question": "What is the {parent organization} and the {chief executive officer} of {Society_of_Jesus} ?",
        "uid": 9947,
        "subgraph": "two intentions right subgraph",
        "template_index": 279,
        "question": "Who is the parent organization and chief executive officer of the Society of Jesus?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q36380 wdt:P749 ?ans_1 . wd:Q36380 wdt:P169 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q36380> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P749> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q36380> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P169> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q597526",
            "http://www.wikidata.org/entity/Q365131",
            "http://www.wikidata.org/entity/Q27258137"
        ],
        "template_id": "1",
        "paraphrased_question": "Who is the Society of Jesus' parent organization and chief executive officer?",
        "simplified_query": "SELECT ?e ?t WHERE { resource:Society_of_Jesus property:parent_organization ?e . resource:Society_of_Jesus property:chief_executive_officer ?t }",
        "solved_answer": [
            "Latin Church",
            "Adolfo Nicol\u00e1s",
            "Arturo Sosa Abascal"
        ]
    },
    {
        "NNQT_question": "What is the {residence} and the {occupation} of {Derek_Hough} ?",
        "uid": 9646,
        "subgraph": "two intentions right subgraph",
        "template_index": 190,
        "question": "What is the residence and the work of Derek Hough?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q1189327 wdt:P551 ?ans_1 . wd:Q1189327 wdt:P106 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1189327> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P551> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1189327> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q23337",
            "http://www.wikidata.org/entity/Q33999",
            "http://www.wikidata.org/entity/Q177220",
            "http://www.wikidata.org/entity/Q639669",
            "http://www.wikidata.org/entity/Q2259451",
            "http://www.wikidata.org/entity/Q2490358",
            "http://www.wikidata.org/entity/Q5716684",
            "http://www.wikidata.org/entity/Q10798782",
            "http://www.wikidata.org/entity/Q10800557"
        ],
        "template_id": "1",
        "paraphrased_question": "What does Derek Hough do and where does he live?",
        "simplified_query": "SELECT ?q ?y WHERE { resource:Derek_Hough property:occupation ?y . resource:Derek_Hough property:residence ?q }",
        "solved_answer": [
            "Salt Lake City",
            "actor",
            "singer",
            "musician",
            "stage actor",
            "choreographer",
            "dancer",
            "television actor",
            "film actor"
        ]
    },
    {
        "NNQT_question": "Give me {physical constant} that contains the word {wavelength} in their name",
        "uid": 23142,
        "subgraph": "string matching simple contains word",
        "template_index": 3652,
        "question": "TELL ME PHYSICAL CONSTANT WHOSE NAME HAS THE WORD WAVELENGTH IN IT.",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q173227 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wavelength')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q173227>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'wavelength')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; contains word >",
        "answer": [
            "http://www.wikidata.org/entity/Q10843113",
            "http://www.wikidata.org/entity/Q97967308"
        ],
        "template_id": "1",
        "paraphrased_question": "Let Me know PHYSICAL Steady WHOSE Title HAS THE WORD WAVELENGTH IN IT.",
        "simplified_query": "SELECT DISTINCT ?r WHERE { ?r rdf:type ontology:physical_constant . FILTER ( CONTAINS ( LCASE ( ?r ) , 'wavelength' ) ) }",
        "solved_answer": [
            "Wien wavelength displacement law constant",
            "electron Compton wavelength"
        ]
    },
    {
        "NNQT_question": "What is the {residence} and the {occupation} of {Martin_Garrix} ?",
        "uid": 9955,
        "subgraph": "two intentions right subgraph",
        "template_index": 516,
        "question": "Where does Martin Garrix reside and what is his occupation?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q14544318 wdt:P551 ?ans_1 . wd:Q14544318 wdt:P106 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q14544318> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P551> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q14544318> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q9898",
            "http://www.wikidata.org/entity/Q130857",
            "http://www.wikidata.org/entity/Q2007572",
            "http://www.wikidata.org/entity/Q183945",
            "http://www.wikidata.org/entity/Q753110"
        ],
        "template_id": "1",
        "paraphrased_question": "What job does Martin Garrix have and where does he live?",
        "simplified_query": "SELECT ?a ?t WHERE { resource:Martin_Garrix property:occupation ?t . resource:Martin_Garrix property:residence ?a }",
        "solved_answer": [
            "Amstelveen",
            "disc jockey",
            "Corn\u00e9lio Proc\u00f3pio",
            "record producer",
            "songwriter"
        ]
    }
]