[
    {
        "NNQT_question": "What is the {place of burial} and the {place of death} of {Stonewall_Jackson} ?",
        "uid": 9901,
        "subgraph": "two intentions right subgraph",
        "template_index": 377,
        "question": "What are the places of death and burial of Stonewall Jackson?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q216124 wdt:P119 ?ans_1 . wd:Q216124 wdt:P20 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q216124> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P119> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q216124> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P20> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q15149549",
            "http://www.wikidata.org/entity/Q5616438"
        ],
        "template_id": "1",
        "paraphrased_question": "Where did Stonewall Jackson die and where was he buried?",
        "simplified_query": "SELECT ?u ?r WHERE { resource:Stonewall_Jackson property:place_of_burial ?u . resource:Stonewall_Jackson property:place_of_death ?r }",
        "solved_answer": [
            "Oak Grove Cemetery",
            "Guinea"
        ]
    },
    {
        "NNQT_question": "What is {employment} of {Michelangelo}, that has {shortened name} is {in\u017c.} ?",
        "uid": 13680,
        "subgraph": "right-subgraph",
        "template_index": 4301,
        "question": "What job did Michelangelo, also known as in\u017c, have?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q5592 wdt:P106 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'in\u017c.'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q5592> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P106>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1813> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <in\u017c.> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q81096"
        ],
        "template_id": "1",
        "paraphrased_question": "What work did Michelangelo, too known as in\u017c, have?",
        "simplified_query": "SELECT ?b WHERE { ?b property:short_name ?i . FILTER ( CONTAINS ( ?i , 'in\u017c . ' ) ) . resource:Michelangelo property:occupation ?b }",
        "solved_answer": [
            "engineer"
        ]
    },
    {
        "NNQT_question": "Did {Sarah_Michelle_Gellar} {sport} {taekwondo}?",
        "uid": 181,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 181,
        "question": "Did Sarah Michelle Gellar practice taekwondo?",
        "sparql_wikidata": "ASK WHERE { wd:Q180665 wdt:P641 wd:Q36389 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q180665> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P641> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q36389>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            true
        ],
        "template_id": "1",
        "paraphrased_question": "Does Sarah Michelle Gellar know taekwondo?",
        "simplified_query": "ASK WHERE { resource:Sarah_Michelle_Gellar property:sport resource:taekwondo }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "What is {developed by} of {SPICE}, that has {working languages} is {English} ?",
        "uid": 13705,
        "subgraph": "right-subgraph",
        "template_index": 22,
        "question": "What is developed by SPICE that has working languages in English?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q174907 wdt:P178 ?answer . ?answer wdt:P2936 wd:Q1860}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q174907> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P178>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2936> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1860> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q168756"
        ],
        "template_id": "1",
        "paraphrased_question": "What is developed through SPICE that has working languages in English?",
        "simplified_query": "SELECT ?h WHERE { resource:SPICE property:developer ?h . ?h property:language_used resource:English }",
        "solved_answer": [
            "University of California, Berkeley"
        ]
    },
    {
        "NNQT_question": "What is {head office location} of {Miss World}, that has {twin city} is {Los Angeles} ?",
        "uid": 14115,
        "subgraph": "right-subgraph",
        "template_index": 358,
        "question": "Where is the head office location of Miss World, whose twin city is Los Angeles?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q173402 wdt:P159 ?answer . ?answer wdt:P190 wd:Q65}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q173402> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P159>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q65> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q84"
        ],
        "template_id": "1",
        "paraphrased_question": "Where is the head workplace vicinity of Miss World, whose twin town is Los Angeles?",
        "simplified_query": "SELECT ?h WHERE { ?h property:twinned_administrative_body resource:Los_Angeles . resource:Miss_World property:headquarters_location ?h }",
        "solved_answer": [
            "London"
        ]
    },
    {
        "NNQT_question": "What is the {history of topic} and the {creator} of {Quantum_mechanics} ?",
        "uid": 9779,
        "subgraph": "two intentions right subgraph",
        "template_index": 62,
        "question": "Who is the creator of Quantum mechanics, and who was its creator?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q944 wdt:P2184 ?ans_1 . wd:Q944 wdt:P170 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q944> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2184> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q944> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P170> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q2358974",
            "http://www.wikidata.org/entity/Q937",
            "http://www.wikidata.org/entity/Q9021",
            "http://www.wikidata.org/entity/Q9130",
            "http://www.wikidata.org/entity/Q17455",
            "http://www.wikidata.org/entity/Q40904",
            "http://www.wikidata.org/entity/Q47480",
            "http://www.wikidata.org/entity/Q58978",
            "http://www.wikidata.org/entity/Q61761",
            "http://www.wikidata.org/entity/Q65989",
            "http://www.wikidata.org/entity/Q83331",
            "http://www.wikidata.org/entity/Q370077"
        ],
        "template_id": "1",
        "paraphrased_question": "Who created Quantum mechanics?",
        "simplified_query": "SELECT ?i ?m WHERE { resource:quantum_mechanics property:history_of_topic ?i . resource:quantum_mechanics property:creator ?m }",
        "solved_answer": [
            "history of quantum mechanics",
            "Albert Einstein",
            "Max Planck",
            "Erwin Schr\u00f6dinger",
            "John von Neumann",
            "Werner Heisenberg",
            "Paul Dirac",
            "Max Born",
            "Pascual Jordan",
            "Wolfgang Pauli",
            "Louis de Broglie",
            "John Stewart Bell"
        ]
    },
    {
        "NNQT_question": "What is {party membership} of {William Petty, 2nd Earl of Shelburne}, that has {founded} is {1678-1-1} ?",
        "uid": 12933,
        "subgraph": "right-subgraph",
        "template_index": 2537,
        "question": "On 1-1-1678 William Petty, 2nd Earl of Shelburne founded what party membership",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q312573 wdt:P102 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1678'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q312573> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P102>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P571> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1678-1-1> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q108700"
        ],
        "template_id": "1",
        "paraphrased_question": "On 1-1-1678 William Petty, 2nd Earl of Shelburne headquartered what celebration membership",
        "simplified_query": "SELECT ?j WHERE { FILTER ( CONTAINS ( YEAR ( ?c ) , '1678' ) ) . resource:William_Petty,_2nd_Earl_of_Shelburne property:member_of_political_party ?j . ?j property:inception ?c }",
        "solved_answer": [
            "Whigs"
        ]
    },
    {
        "NNQT_question": "Give me {bank} that contains the word {unicredit} in their name",
        "uid": 23582,
        "subgraph": "string matching simple contains word",
        "template_index": 2626,
        "question": "Tell me bank whose name has the word unicredit in it.",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22687 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'unicredit')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q22687>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'unicredit')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; contains word >",
        "answer": [
            "http://www.wikidata.org/entity/Q45568",
            "http://www.wikidata.org/entity/Q727011",
            "http://www.wikidata.org/entity/Q16474550",
            "http://www.wikidata.org/entity/Q2882033",
            "http://www.wikidata.org/entity/Q7884635"
        ],
        "template_id": "1",
        "paraphrased_question": "Let me know bank whose title has the word unicredit in it.",
        "simplified_query": "SELECT DISTINCT ?e WHERE { ?e rdf:type ontology:bank . FILTER ( CONTAINS ( LCASE ( ?e ) , 'unicredit' ) ) }",
        "solved_answer": [
            "UniCredit",
            "UniCredit Bank Russia",
            "UniCredit Bank Lithuania",
            "UniCredit Banca di Roma",
            "UniCredit Bulbank"
        ]
    },
    {
        "NNQT_question": "What is {place of interment} of {Albert Anastasia}, that has {foundation date} is {1838-0-0} ?",
        "uid": 13547,
        "subgraph": "right-subgraph",
        "template_index": 1506,
        "question": "What is the place of interment of Albert Anastasia, that has a foundation date of 1838-0-0?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q706235 wdt:P119 ?answer . ?answer wdt:P571 ?x FILTER(contains(YEAR(?x),'1838'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q706235> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P119>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P571> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <1838-0-0> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q239043"
        ],
        "template_id": "1",
        "paraphrased_question": "What is the put of interment of Albert Anastasia, that features a establishment date of 1838-0-0?",
        "simplified_query": "SELECT ?w WHERE { ?w property:inception ?c . FILTER ( CONTAINS ( YEAR ( ?c ) , '1838' ) ) . resource:Albert_Anastasia property:place_of_burial ?w }",
        "solved_answer": [
            "Green-Wood Cemetery"
        ]
    },
    {
        "NNQT_question": "What is the {designed by} and the {programming paradigm} of {SQL} ?",
        "uid": 10055,
        "subgraph": "two intentions right subgraph",
        "template_index": 153,
        "question": "Who designed SQL and what is the programming paradigm of SQL?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q47607 wdt:P287 ?ans_1 . wd:Q47607 wdt:P3966 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q47607> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P287> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q47607> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3966> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q531152",
            "http://www.wikidata.org/entity/Q93007",
            "http://www.wikidata.org/entity/Q93071"
        ],
        "template_id": "1",
        "paraphrased_question": "",
        "simplified_query": "SELECT ?k ?v WHERE { resource:Structured_Query_Language property:designed_by ?k . resource:Structured_Query_Language property:programming_paradigm ?v }",
        "solved_answer": [
            "declarative programming",
            "Raymond F. Boyce",
            "Donald D. Chamberlin"
        ]
    },
    {
        "NNQT_question": "What is <International Olympic Committee athlete ID> of <Mary Lou Retton> ?",
        "uid": 26800,
        "subgraph": "center",
        "template_index": 1097,
        "question": "What's Mary Lou Retton's International Olympic Committee athlete ID.",
        "sparql_wikidata": "select distinct ?answer where { wd:Q235975 wdt:P3171 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q235975> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3171> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "mary-lou-retton"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?a WHERE { resource:Mary_Lou_Retton property:Olympic.org_athlete_ID ?a }",
        "solved_answer": [
            "mary-lou-retton"
        ]
    },
    {
        "NNQT_question": "What is <Austrian municipality key> of <Klagenfurt> ?",
        "uid": 26196,
        "subgraph": "center",
        "template_index": 493,
        "question": "WHICH IS THE AUSTRIAN MUNICIPALITY KEY OF  KLAGENFURT",
        "sparql_wikidata": "select distinct ?answer where { wd:Q41753 wdt:P964 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q41753> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P964> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "20101"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?c WHERE { resource:Klagenfurt property:Austrian_municipality_key ?c }",
        "solved_answer": [
            "20101"
        ]
    },
    {
        "NNQT_question": "What is <Au\u00f1amendi ID> of <Miguel L\u00f3pez de Legazpi> ?",
        "uid": 26652,
        "subgraph": "center",
        "template_index": 949,
        "question": "What is Au\u00f1amendi ID of Miguel L\u00f3pez de Legazpi ?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q318500 wdt:P3218 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q318500> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3218> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "79975"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?z WHERE { resource:Miguel_L\u00f3pez_de_Legazpi property:Au\u00f1amendi_ID ?z }",
        "solved_answer": [
            "79975"
        ]
    },
    {
        "NNQT_question": "What is <ISNI> of <Marit Bj\u00f8rgen> ?",
        "uid": 29730,
        "subgraph": "center",
        "template_index": 4027,
        "question": "Which is the ISNI for Marit Bj\u00f8rgen?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q216256 wdt:P213 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q216256> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P213> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "0000000362525868"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?h WHERE { resource:Marit_Bj\u00f8rgen property:ISNI ?h }",
        "solved_answer": [
            "0000000362525868"
        ]
    },
    {
        "NNQT_question": "What is <nickname> of <Mike Krzyzewski> ?",
        "uid": 28935,
        "subgraph": "center",
        "template_index": 3232,
        "question": "mike krzyzewski name",
        "sparql_wikidata": "select distinct ?answer where { wd:Q434909 wdt:P1449 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q434909> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1449> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "Coach K"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?x WHERE { resource:Mike_Krzyzewski property:nickname ?x }",
        "solved_answer": [
            "Coach K"
        ]
    },
    {
        "NNQT_question": "What is <World Heritage Tentative List ID> of <University of Tehran> ?",
        "uid": 26456,
        "subgraph": "center",
        "template_index": 753,
        "question": "what is the world heritage Tentative liste ID of  Univirsity of Tahran",
        "sparql_wikidata": "select distinct ?answer where { wd:Q737835 wdt:P4171 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q737835> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4171> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "6201"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?y WHERE { resource:University_of_Tehran property:World_Heritage_Tentative_List_ID ?y }",
        "solved_answer": [
            "6201"
        ]
    },
    {
        "NNQT_question": "What is <dantai code> of <Ky\u014dto Prefecture> ?",
        "uid": 26639,
        "subgraph": "center",
        "template_index": 936,
        "question": "Which is dantai code for Ky\u014dto Prefecture?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q120730 wdt:P429 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q120730> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P429> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "260002"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?k WHERE { resource:Ky\u014dto_Prefecture property:dantai_code ?k }",
        "solved_answer": [
            "260002"
        ]
    },
    {
        "NNQT_question": "What is <Billboard artist ID> of <Vicente Fern\u00e1ndez> ?",
        "uid": 28800,
        "subgraph": "center",
        "template_index": 3097,
        "question": "Which is the Billboard artist ID for Vicente Fern\u00e1ndez?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q119069 wdt:P4208 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q119069> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4208> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "vicente-fern-ndez",
            "vicente-fernandez"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?l WHERE { resource:Vicente_P\u00e9rez property:Billboard_artist_ID ?l }",
        "solved_answer": [
            "vicente-fern-ndez",
            "vicente-fernandez"
        ]
    },
    {
        "NNQT_question": "What is <Dialnet author ID> of <L\u00e9opold S\u00e9dar Senghor> ?",
        "uid": 27448,
        "subgraph": "center",
        "template_index": 1745,
        "question": "What is L\u00e9opold S\u00e9dar Senghor's Dialnet author ID?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q154545 wdt:P1607 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q154545> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1607> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "2004082"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?b WHERE { resource:L\u00e9opold_S\u00e9dar_Senghor property:Dialnet_author_ID ?b }",
        "solved_answer": [
            "2004082"
        ]
    },
    {
        "NNQT_question": "What is <date of burial or cremation> of <Milo\u0161 Forman> ?",
        "uid": 28448,
        "subgraph": "center",
        "template_index": 2745,
        "question": "Which is the date of burial or cremation of Milo\u0161 Forman?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q51525 wdt:P4602 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q51525> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4602> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "2018-04-15T00:00:00Z"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?q WHERE { resource:Milo\u0161_Forman property:date_of_burial_or_cremation ?q }",
        "solved_answer": [
            "2018-04-15T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "What is <capital of> of <\u014ctsu> ?",
        "uid": 27970,
        "subgraph": "center",
        "template_index": 2267,
        "question": "What is capital of \u014ctsu ?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q202907 wdt:P1376 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q202907> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1376> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "http://www.wikidata.org/entity/Q131358",
            "http://www.wikidata.org/entity/Q11437356"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?b WHERE { resource:\u014ctsu property:capital_of ?b }",
        "solved_answer": [
            "Shiga Prefecture",
            "\u014ctsu Prefecture"
        ]
    },
    {
        "NNQT_question": "What is <INEGI locality ID> of <Torre\u00f3n> ?",
        "uid": 29556,
        "subgraph": "center",
        "template_index": 3853,
        "question": "Which is the INEGI locality ID for Torre\u00f3n?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q386991 wdt:P1976 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q386991> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1976> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "050350001"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?x WHERE { resource:Torre\u00f3n property:INEGI_locality_ID ?x }",
        "solved_answer": [
            "050350001"
        ]
    },
    {
        "NNQT_question": "What is <M\u00e9moire du cyclisme cyclist ID> of <Bradley Wiggins> ?",
        "uid": 29415,
        "subgraph": "center",
        "template_index": 3712,
        "question": "What is the M\u00e9moire du cyclisme cyclist ID for Bradley Wiggins?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q193876 wdt:P4516 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q193876> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4516> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "20756"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?b WHERE { resource:Bradley_Wiggins property:M\u00e9moire_du_cyclisme_cyclist_ID ?b }",
        "solved_answer": [
            "20756"
        ]
    },
    {
        "NNQT_question": "What is <Encyclop\u00e6dia Britannica Online ID> of <ton> ?",
        "uid": 26619,
        "subgraph": "center",
        "template_index": 916,
        "question": "What isEncyclop\u00e6dia Britannica Online ID for ton ?",
        "sparql_wikidata": "select distinct ?answer where { wd:Q11247037 wdt:P1417 ?answer}",
        "sparql_dbpedia18": "select distinct ?answer where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q11247037> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1417> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer. }",
        "template": "E REF ?F",
        "answer": [
            "science/ton"
        ],
        "template_id": "1.1",
        "paraphrased_question": [],
        "simplified_query": "SELECT DISTINCT ?q WHERE { resource:Ton property:Encyclop\u00e6dia_Britannica_Online_ID ?q }",
        "solved_answer": [
            "science/ton"
        ]
    }
]