[
    {
        "NNQT_question": "What is {award received} of {Susan Sarandon} that is {point in time} is {1994-1-1} ?",
        "uid": 7246,
        "subgraph": "statement_property",
        "template_index": 3691,
        "question": "What award did Susan Sarandon receive in the year 1994?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q133050 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1994')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q133050> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P166> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1994-1-1>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q103618",
            "http://www.wikidata.org/entity/Q908858",
            "http://www.wikidata.org/entity/Q56085709"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "In 1994, what award did Susan Sarandon receive?",
        "simplified_query": "SELECT ?b WHERE { ?g property:award_received ?b . resource:Susan_Sarandon property:award_received ?g . FILTER ( CONTAINS ( YEAR ( ?x ) , '1994' ) ) . ?g property:point_in_time ?x }",
        "solved_answer": [
            "Academy Award for Best Actress",
            "Donostia Award",
            "Crystal Award"
        ]
    },
    {
        "NNQT_question": "What is {place of burial} of {Franti\u0161ek Kupka} that is {catalog code} is {22696} ?",
        "uid": 3802,
        "subgraph": "statement_property",
        "template_index": 247,
        "question": "Where was the Frantisek Kupka burried whose catalog code is 22696",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q167414 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P528 ?x filter(contains(?x,'22696')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q167414> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P119> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P528> <22696>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q3006253"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "Could you provide the Frantisek Kupka burried place, whose catalog code is 22696?.",
        "simplified_query": "SELECT ?e WHERE { resource:Franti\u0161ek_Kupka property:place_of_burial ?u . ?u property:place_of_burial ?e . ?u property:catalog_code ?d . FILTER ( ?d = 22696 ) }",
        "solved_answer": [
            "Cr\u00e9matorium-columbarium du P\u00e8re-Lachaise"
        ]
    },
    {
        "NNQT_question": "What is {position held} of {Jean le Rond D'Alembert} that is {start time} is {1772-0-0} ?",
        "uid": 8758,
        "subgraph": "statement_property",
        "template_index": 5203,
        "question": "What position did Jean le Rond D'Alembert begin holding in 1772?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q153232 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'1772')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q153232> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P39> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <1772-0-0>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q3254304"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "What position did Jean le Rond D'Alembert hold in 1772?",
        "simplified_query": "SELECT ?b WHERE { resource:Jean_le_Rond_d'Alembert property:position_held ?r . ?r property:position_held ?b . ?r property:start_time ?i . FILTER ( CONTAINS ( YEAR ( ?i ) , '1772' ) ) }",
        "solved_answer": [
            "perpetual secretary of the French Academy"
        ]
    },
    {
        "NNQT_question": "What is {nominated for} of {Eyvind Johnson} that is {point in time} is {1963-1-1} ?",
        "uid": 5439,
        "subgraph": "statement_property",
        "template_index": 1884,
        "question": "What was Eyvind Johnson nominated for in 1963?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q131326 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1963')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q131326> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1963-1-1>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q37922"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "For which award did Eyvind Johnson receive a nomination in 1963?",
        "simplified_query": "SELECT ?f WHERE { ?p property:nominated_for ?f . ?p property:point_in_time ?j . FILTER ( CONTAINS ( YEAR ( ?j ) , '1963' ) ) . resource:Eyvind_Johnson property:nominated_for ?p }",
        "solved_answer": [
            "Nobel Prize in Literature"
        ]
    },
    {
        "NNQT_question": "What is {position held} of {Cyril Ramaphosa} that is {start time} is {2018-2-15} ?",
        "uid": 5268,
        "subgraph": "statement_property",
        "template_index": 1713,
        "question": "For what Cyril Ramaphosa was in position held in the year 2018?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1148669 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2018')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1148669> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P39> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <2018-2-15>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q273884"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "What position was held by Cyril Ramaphosa in the year 2018?",
        "simplified_query": "SELECT ?t WHERE { FILTER ( CONTAINS ( YEAR ( ?p ) , '2018' ) ) . ?u property:start_time ?p . resource:Matamela_Cyril_Ramaphosa property:position_held ?u . ?u property:position_held ?t }",
        "solved_answer": [
            "President of South Africa"
        ]
    },
    {
        "NNQT_question": "What is {shares border with} of {\u00cele-de-France} that is {start time} is {2016-1-1} ?",
        "uid": 5729,
        "subgraph": "statement_property",
        "template_index": 2174,
        "question": "Since 2016-1-1, what shares a border with Ile-de-France?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q13917 p:P47 ?s . ?s ps:P47 ?obj . ?s pq:P580 ?x filter(contains(YEAR(?x),'2016')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q13917> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P47> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P580> <2016-1-1>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "http://www.wikidata.org/entity/Q18578267",
            "http://www.wikidata.org/entity/Q18677767",
            "http://www.wikidata.org/entity/Q18677983",
            "http://www.wikidata.org/entity/Q18677875"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "What borders with Ile-de-France since January 1st, 2016?",
        "simplified_query": "SELECT ?i WHERE { FILTER ( CONTAINS ( YEAR ( ?x ) , '2016' ) ) . ?d property:start_time ?x . ?d property:shares_border_with ?i . resource:\u00cele-de-France property:shares_border_with ?d }",
        "solved_answer": [
            "Bourgogne-Franche-Comt\u00e9",
            "Hauts-de-France",
            "Grand Est",
            "Normandy"
        ]
    },
    {
        "NNQT_question": "What is {distinct from} of {carillon}, that has {Hornbostel-Sachs} is {111.212} ?",
        "uid": 12018,
        "subgraph": "right-subgraph",
        "template_index": 14,
        "question": "What is distinct from the 111.212 carillon of Hornbostel-Sachs?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q505174 wdt:P1889 ?answer . ?answer wdt:P1762 ?x FILTER(contains(?x,'111.212'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q505174> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1889>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1762> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <111.212> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q626035"
        ],
        "template_id": "1",
        "paraphrased_question": "What is unmistakable from the 111.212 carillon of Hornbostel-Sachs?",
        "simplified_query": "SELECT ?u WHERE { resource:carillon property:different_from ?u . ?u property:Hornbostel-Sachs_classification ?a . FILTER ( ?a = 111.212 ) }",
        "solved_answer": [
            "glockenspiel"
        ]
    },
    {
        "NNQT_question": "What is {musical instrument} of {tutor} of {Alexander Scriabin} ?",
        "uid": 17737,
        "subgraph": "right-subgraph",
        "template_index": 4696,
        "question": "Alexander Scriabin is a tutor of which musical instrument?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q185647 wdt:P1066 ?X . ?X wdt:P1303 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q185647> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1066>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1303> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q5994"
        ],
        "template_id": "2",
        "paraphrased_question": "Alexander Scriabin could be a mentor of which melodic instrument?",
        "simplified_query": "SELECT ?h WHERE { ?r property:instrument ?h . resource:Alexander_Scriabin property:student_of ?r }",
        "solved_answer": [
            "piano"
        ]
    },
    {
        "NNQT_question": "What is {government headed by} of {comes from} of {pizza} ?",
        "uid": 15043,
        "subgraph": "right-subgraph",
        "template_index": 12,
        "question": "What pizza comes from the head of government?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q177 wdt:P495 ?X . ?X wdt:P6 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q177> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P495>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P6> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q451791"
        ],
        "template_id": "2",
        "paraphrased_question": "What pizza comes from the head of government?",
        "simplified_query": "SELECT ?q WHERE { resource:pizza property:country_of_origin ?z . ?z property:head_of_government ?q }",
        "solved_answer": [
            "Giorgia Meloni"
        ]
    },
    {
        "NNQT_question": "What is {national anthem} of {topic of} of {history of Dagestan} ?",
        "uid": 15416,
        "subgraph": "right-subgraph",
        "template_index": 67,
        "question": "What is the national anthem the topic of in the history of Dagestan?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q2024068 wdt:P1269 ?X . ?X wdt:P85 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q2024068> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1269>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P85> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q2028103",
            "http://www.wikidata.org/entity/Q27921908"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the national song of praise the point of in the historical backdrop of Dagestan?",
        "simplified_query": "SELECT ?j WHERE { ?p property:anthem ?j . resource:history_of_Dagestan property:facet_of ?p }",
        "solved_answer": [
            "State Anthem of the Republic of Dagestan",
            "Dagestan, you holy fatherland"
        ]
    },
    {
        "NNQT_question": "What is {Carnegie Classification of Institutions of Higher Education} of {graduated from} of {Ben Affleck} ?",
        "uid": 14473,
        "subgraph": "right-subgraph",
        "template_index": 989,
        "question": "What's the Carnegie Classification of Institutions of Higher Education that Ben Affleck graduated from?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q483118 wdt:P69 ?X . ?X wdt:P2643 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q483118> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P69>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2643> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "http://www.wikidata.org/entity/Q23334891",
            "http://www.wikidata.org/entity/Q23622831",
            "http://www.wikidata.org/entity/Q23623483",
            "http://www.wikidata.org/entity/Q23662432",
            "http://www.wikidata.org/entity/Q23662488",
            "http://www.wikidata.org/entity/Q23662765",
            "http://www.wikidata.org/entity/Q23336065",
            "http://www.wikidata.org/entity/Q23622825",
            "http://www.wikidata.org/entity/Q23623476",
            "http://www.wikidata.org/entity/Q23662475",
            "http://www.wikidata.org/entity/Q23662737"
        ],
        "template_id": "2",
        "paraphrased_question": "What's the Carnegie Classification of Teach of Higher Instruction that Ben Affleck graduated from?",
        "simplified_query": "SELECT ?y WHERE { ?i property:Carnegie_Classification_of_Institutions_of_Higher_Education ?y . resource:Ben_Affleck property:educated_at ?i }",
        "solved_answer": [
            "doctoral university: higher research activity",
            "four-year, large, highly residential",
            "high undergraduate",
            "four-year, full-time, more selective, lower transfer-in",
            "research doctoral: humanities/social sciences-dominant",
            "balanced arts & sciences/professions, some graduate coexistence",
            "baccalaureate colleges: arts and sciences focus",
            "four-year, small, highly residential",
            "exclusively undergraduate four-year",
            "postbaccalaureate: single program - other",
            "arts & sciences focus, some graduate coexistence"
        ]
    },
    {
        "NNQT_question": "What is {unemployment rate} of {place of origin} of {The Sugarhill Gang} ?",
        "uid": 15100,
        "subgraph": "right-subgraph",
        "template_index": 2337,
        "question": "What is the unemployment rate where the The Sugarhill Gang were up?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q1413494 wdt:P495 ?X . ?X wdt:P1198 ?answer}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1413494> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P495>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?X . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?X. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1198> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . }",
        "template": "E REF xF . xF RFG ?G",
        "answer": [
            "6.7"
        ],
        "template_id": "2",
        "paraphrased_question": "What is the unemployment rate where the The Sugarhill Group were up?",
        "simplified_query": "SELECT ?f WHERE { resource:The_Sugarhill_Gang property:country_of_origin ?k . ?k property:unemployment_rate ?f }",
        "solved_answer": [
            "6.7"
        ]
    },
    {
        "NNQT_question": "Give me {instruction set architecture} that {designed by} {Intel} and which that starts with {'x'}",
        "uid": 25514,
        "subgraph": "string matching type + relation contains word",
        "template_index": 3093,
        "question": "tell  me instruction set architecture that designed by Intel  that starts with x",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q272683 . ?sbj wdt:P287 wd:Q248 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q272683>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P287> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q248>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'x')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q182933"
        ],
        "template_id": "4",
        "paraphrased_question": "let me know instruction set design that planned by Intel that begins with x",
        "simplified_query": "SELECT DISTINCT ?b WHERE { ?b property:designed_by resource:Intel . FILTER ( STRSTARTS ( LCASE ( ?b ) , 'x' ) ) . ?b rdf:type ontology:instruction_set_architecture }",
        "solved_answer": [
            "x86"
        ]
    },
    {
        "NNQT_question": "How many {victory} are for {Maureen Connolly} ?",
        "uid": 1076,
        "subgraph": "statement_property",
        "template_index": 76,
        "question": "Was Maureen Connolly victorious?",
        "sparql_wikidata": "SELECT (COUNT(?obj) AS ?value ) { wd:Q53390 wdt:P2522 ?obj }",
        "sparql_dbpedia18": "SELECT (COUNT(?obj) AS ?objs ) {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q53390> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2522> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n} \n",
        "template": "Count Obj (ent-pred-obj)",
        "answer": [
            "9"
        ],
        "template_id": "Count_1",
        "paraphrased_question": "Tell me if Maureen Connolly was victorious?",
        "simplified_query": "SELECT ( COUNT ( ?a ) AS ?p ) { resource:Maureen_Connolly property:victory ?a }",
        "solved_answer": [
            "9"
        ]
    },
    {
        "NNQT_question": "what is the {point in time} for {Henri Moissan} has {nominated for} as {Nobel Prize in Chemistry} ?",
        "uid": 7860,
        "subgraph": "statement_property",
        "template_index": 4305,
        "question": "When was Henri Moissan nominated for a Nobel Prize in Chemistry?",
        "sparql_wikidata": "SELECT ?value WHERE { wd:Q102804 p:P1411 ?s . ?s ps:P1411 wd:Q44585 . ?s pq:P585 ?value}",
        "sparql_dbpedia18": "select distinct ?value  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q102804> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1411> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q44585> .\n?statement <http://www.wikidata.org/entity/P585> ?value. \n} \n",
        "template": "(E pred ?Obj ) prop value",
        "answer": [
            "1901-01-01T00:00:00Z",
            "1906-01-01T00:00:00Z",
            "1905-01-01T00:00:00Z",
            "1904-01-01T00:00:00Z",
            "1902-01-01T00:00:00Z",
            "1903-01-01T00:00:00Z"
        ],
        "template_id": "statement_property_1",
        "paraphrased_question": "In what year was Henri Moissan nominated for a Nobel Prize for Chemistry?",
        "simplified_query": "SELECT ?f WHERE { resource:Henri_Moissan property:nominated_for ?q . ?q property:point_in_time ?f . ?q property:nominated_for resource:Nobel_Prize_in_Chemistry }",
        "solved_answer": [
            "1901-01-01T00:00:00Z",
            "1906-01-01T00:00:00Z",
            "1905-01-01T00:00:00Z",
            "1904-01-01T00:00:00Z",
            "1902-01-01T00:00:00Z",
            "1903-01-01T00:00:00Z"
        ]
    },
    {
        "NNQT_question": "What is {area} of {Indian Ocean} that is {point in time} is {1982-0-0} ?",
        "uid": 6236,
        "subgraph": "statement_property",
        "template_index": 2681,
        "question": "What was the area of the Indian ocean in 1982?",
        "sparql_wikidata": "SELECT ?obj WHERE { wd:Q1239 p:P2046 ?s . ?s ps:P2046 ?obj . ?s pq:P585 ?x filter(contains(YEAR(?x),'1982')) }",
        "sparql_dbpedia18": "select distinct ?obj  where {\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1239> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P2046> .\n?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj .\n?statement <http://www.wikidata.org/entity/P585> <1982-0-0>\n} \n",
        "template": "(E pred F) prop ?value",
        "answer": [
            "76174000"
        ],
        "template_id": "statement_property_2",
        "paraphrased_question": "In 1982, what were the dimensions of the area of the Indian Ocean?",
        "simplified_query": "SELECT ?r WHERE { resource:Indian_Ocean property:area ?h . FILTER ( CONTAINS ( YEAR ( ?z ) , '1982' ) ) . ?h property:area ?r . ?h property:point_in_time ?z }",
        "solved_answer": [
            "76174000"
        ]
    },
    {
        "NNQT_question": "Give me {historic county of England} that starts with {'y'}",
        "uid": 24070,
        "subgraph": "string matching simple contains word",
        "template_index": 1144,
        "question": "What are the historic county of England which start with the letter Y",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1138494 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q1138494>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'y')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q163"
        ],
        "template_id": "2",
        "paraphrased_question": "What are the memorable district of Britain which begin with the letter Y",
        "simplified_query": "SELECT DISTINCT ?e WHERE { ?e rdf:type ontology:historic_county_of_England . FILTER ( STRSTARTS ( LCASE ( ?e ) , 'y' ) ) }",
        "solved_answer": [
            "Yorkshire"
        ]
    },
    {
        "NNQT_question": "Give me {battle} that {participant} {Nazi Germany} and which that starts with {'s'}",
        "uid": 25371,
        "subgraph": "string matching type + relation contains word",
        "template_index": 404,
        "question": "which battle that participant nazi germany starts with s",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q178561 . ?sbj wdt:P710 wd:Q7318 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q178561>. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P710> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q7318>. ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 's')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; starts with character >",
        "answer": [
            "http://www.wikidata.org/entity/Q182240",
            "http://www.wikidata.org/entity/Q664581"
        ],
        "template_id": "4",
        "paraphrased_question": "which fight that member nazi germany begins with s",
        "simplified_query": "SELECT DISTINCT ?j WHERE { FILTER ( STRSTARTS ( LCASE ( ?j ) , 's' ) ) . ?j rdf:type ontology:battle . ?j property:participant resource:Nazi_Germany }",
        "solved_answer": [
            "Siege of Warsaw",
            "Siege of Breslau"
        ]
    }
]