[
    {
        "NNQT_question": "What is the {material used} and the {approved by} of {Mojito} ?",
        "uid": 10141,
        "subgraph": "two intentions right subgraph",
        "template_index": 427,
        "question": "What is the material used by Mojito and what is it approved by?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q487338 wdt:P186 ?ans_1 . wd:Q487338 wdt:P790 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q487338> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P186> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q487338> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P790> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q1430305",
            "http://www.wikidata.org/entity/Q11002",
            "http://www.wikidata.org/entity/Q13195",
            "http://www.wikidata.org/entity/Q264554",
            "http://www.wikidata.org/entity/Q488463",
            "http://www.wikidata.org/entity/Q2534652",
            "http://www.wikidata.org/entity/Q5361217",
            "http://www.wikidata.org/entity/Q26869768",
            "http://www.wikidata.org/entity/Q26876993",
            "http://www.wikidata.org/entity/Q26879639",
            "http://www.wikidata.org/entity/Q27640062"
        ],
        "template_id": "1",
        "paraphrased_question": "What is the material used and accredited by means of Mojito?",
        "simplified_query": "SELECT ?q ?s WHERE { resource:Mojito property:approved_by ?s . resource:Mojito property:made_from_material ?q }",
        "solved_answer": [
            "International Bartenders Association",
            "sugar",
            "lime",
            "carbonated water",
            "ice cube",
            "collins glass",
            "lime juice",
            "white rum",
            "lemon slice",
            "mint sprig",
            "mint leaf"
        ]
    },
    {
        "NNQT_question": "Did {Brittany_Murphy} {country of citizenship} {United States of America}?",
        "uid": 454,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 454,
        "question": "Was Brittany Murphy a citizen of the USA?",
        "sparql_wikidata": "ASK WHERE { wd:Q168847 wdt:P27 wd:Q30 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q168847> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P27> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q30>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            true
        ],
        "template_id": "1",
        "paraphrased_question": "Did Brittany Murphy have USA citizenship?",
        "simplified_query": "ASK WHERE { resource:Brittany_Murphy property:country_of_citizenship resource:United_States_of_America }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "What is {cartridge} of {Minigun}, that has {participated in conflict} is {Vietnam War} ?",
        "uid": 13100,
        "subgraph": "right-subgraph",
        "template_index": 176,
        "question": "What is the ammunition of the weapon, that has been used in the war in the Vietnam War?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q864060 wdt:P739 ?answer . ?answer wdt:P607 wd:Q8740}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q864060> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P739>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P607> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q8740> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q259210"
        ],
        "template_id": "1",
        "paraphrased_question": "What is the ammunition of the weapon, that has been used in the conflict in Southeast Asia?",
        "simplified_query": "SELECT ?y WHERE { ?y property:conflict resource:Vietnam_War . resource:Minigun property:ammunition ?y }",
        "solved_answer": [
            "7.62\u00d751mm NATO"
        ]
    },
    {
        "NNQT_question": "What is the {human} for {performer} of {Deadpool}",
        "uid": 21393,
        "subgraph": "simple question right",
        "template_index": 1739,
        "question": "Who are the actors for the movie Deadpool?",
        "sparql_wikidata": " select distinct ?obj where { wd:Q1631090 wdt:P175 ?obj . ?obj wdt:P31 wd:Q5 } ",
        "sparql_dbpedia18": "select distinct ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q1631090> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P175> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?obj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q5> } ",
        "template": " <S P ?O ; ?O instanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q192682",
            "http://www.wikidata.org/entity/Q952156",
            "http://www.wikidata.org/entity/Q1147104",
            "http://www.wikidata.org/entity/Q1582689",
            "http://www.wikidata.org/entity/Q2056174",
            "http://www.wikidata.org/entity/Q28310"
        ],
        "template_id": "1",
        "paraphrased_question": "Who was the lead performing artist for the motion picture Deadpool?",
        "simplified_query": "SELECT DISTINCT ?c WHERE { resource:Deadpool property:performer ?c . ?c rdf:type ontology:human }",
        "solved_answer": [
            "Ryan Reynolds",
            "Steve Blum",
            "Nolan North",
            "John Kassir",
            "Will Friedle",
            "Scott Adkins"
        ]
    },
    {
        "NNQT_question": "Did {Michael_J._Fox} {place of birth} {Edmonton}?",
        "uid": 364,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 364,
        "question": "Was Michael J. Fox's place of birth in Edmonton?",
        "sparql_wikidata": "ASK WHERE { wd:Q395274 wdt:P19 wd:Q2096 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q395274> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P19> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2096>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            true
        ],
        "template_id": "1",
        "paraphrased_question": "Where was Michael J. Fox born?",
        "simplified_query": "ASK WHERE { resource:Michael_J._Fox property:place_of_birth resource:Edmonton }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "What is the {architect} and the {heritage designation} of {Palace_of_Westminster} ?",
        "uid": 10093,
        "subgraph": "two intentions right subgraph",
        "template_index": 262,
        "question": "Who is Palace of Westminster's architect and heritage designation?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q62408 wdt:P84 ?ans_1 . wd:Q62408 wdt:P1435 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q62408> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P84> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q62408> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1435> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q15700818",
            "http://www.wikidata.org/entity/Q313288",
            "http://www.wikidata.org/entity/Q5075445"
        ],
        "template_id": "1",
        "paraphrased_question": "Tell me the architect and heritage designation of Westminster Palace.",
        "simplified_query": "SELECT ?r ?u WHERE { resource:Palace_of_Westminster property:architect ?r . resource:Palace_of_Westminster property:heritage_designation ?u }",
        "solved_answer": [
            "Grade I listed building",
            "Augustus Pugin",
            "Charles Barry, Jr."
        ]
    },
    {
        "NNQT_question": "What is the {monastery} for {headquarters location} of {Russian Orthodox Church}",
        "uid": 21021,
        "subgraph": "simple question right",
        "template_index": 1367,
        "question": "The headquarter monastery location of the Russian Orthodox Church.",
        "sparql_wikidata": " select distinct ?obj where { wd:Q60995 wdt:P159 ?obj . ?obj wdt:P31 wd:Q44613 } ",
        "sparql_dbpedia18": "select distinct ?obj where { ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q60995> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P159> . ?statement <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?obj . ?obj <http://www.wikidata.org/entity/P31> <http://wikidata.dbpedia.org/resource/Q44613> } ",
        "template": " <S P ?O ; ?O instanceOf Type>",
        "answer": [
            "http://www.wikidata.org/entity/Q658262"
        ],
        "template_id": "1",
        "paraphrased_question": "Say the headquarter area of the Russian Standard Church monastery.",
        "simplified_query": "SELECT DISTINCT ?d WHERE { resource:Russian_Orthodox_Church property:headquarters_location ?d . ?d rdf:type ontology:monastery }",
        "solved_answer": [
            "Danilov Monastery"
        ]
    },
    {
        "NNQT_question": "What is the {head coach} and the {named after} of {New_York_Yankees} ?",
        "uid": 9496,
        "subgraph": "two intentions right subgraph",
        "template_index": 476,
        "question": "Who is the head coach and what is the New York Yankees named after?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q213417 wdt:P286 ?ans_1 . wd:Q213417 wdt:P138 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q213417> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P286> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q213417> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P138> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q4661865",
            "http://www.wikidata.org/entity/Q60",
            "http://www.wikidata.org/entity/Q692062"
        ],
        "template_id": "1",
        "paraphrased_question": "The New York Yankees were named for which head coach?",
        "simplified_query": "SELECT ?v ?o WHERE { resource:New_York_Yankees property:head_coach ?v . resource:New_York_Yankees property:named_after ?o }",
        "solved_answer": [
            "Aaron Boone",
            "New York City",
            "Yankee"
        ]
    },
    {
        "NNQT_question": "What is the {headquarters location} and the {location of formation} of {Google} ?",
        "uid": 9864,
        "subgraph": "two intentions right subgraph",
        "template_index": 380,
        "question": "where is the headquarter of google and the location fo it's formation?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q95 wdt:P159 ?ans_1 . wd:Q95 wdt:P740 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q95> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P159> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q95> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P740> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q694178",
            "http://www.wikidata.org/entity/Q74195"
        ],
        "template_id": "1",
        "paraphrased_question": "Where was the first headquarters of Google located?",
        "simplified_query": "SELECT ?m ?a WHERE { resource:Google property:location_of_formation ?a . resource:Google property:headquarters_location ?m }",
        "solved_answer": [
            "Googleplex",
            "Menlo Park"
        ]
    },
    {
        "NNQT_question": "Did {Black_hole} {opposite of} {stellar atmosphere}?",
        "uid": 212,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 212,
        "question": "Is a black hole the opposite of a stellar atmosphere?",
        "sparql_wikidata": "ASK WHERE { wd:Q589 wdt:P461 wd:Q6311 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q589> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P461> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q6311>. } ",
        "template": "Ask (ent-pred-obj`)",
        "answer": [
            false
        ],
        "template_id": "1",
        "paraphrased_question": "The stellar atmospheres opposite id the black hole correct?",
        "simplified_query": "ASK WHERE { resource:black_hole property:opposite_of resource:stellar_atmosphere }",
        "solved_answer": [
            false
        ]
    },
    {
        "NNQT_question": "What is the {court} and the {applies to jurisdiction} of {Roe_v._Wade} ?",
        "uid": 9497,
        "subgraph": "two intentions right subgraph",
        "template_index": 583,
        "question": "What is the court and what jurisdication does of Roe v. Wade applies to?",
        "sparql_wikidata": "SELECT ?ans_1 ?ans_2 WHERE { wd:Q300950 wdt:P4884 ?ans_1 . wd:Q300950 wdt:P1001 ?ans_2 }",
        "sparql_dbpedia18": " SELECT ?ans_1 ?ans_2 WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q300950> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P4884> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_1. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q300950> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1001> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?ans_2. } ",
        "template": "select where (ent-pred-obj1 . ent-pred-obj2)",
        "answer": [
            "http://www.wikidata.org/entity/Q11201",
            "http://www.wikidata.org/entity/Q30"
        ],
        "template_id": "1",
        "paraphrased_question": "Which court did Roe v. Wade?",
        "simplified_query": "SELECT ?y ?e WHERE { resource:Roe_v._Wade property:applies_to_jurisdiction ?e . resource:Roe_v._Wade property:court ?y }",
        "solved_answer": [
            "Supreme Court of the United States",
            "United States of America"
        ]
    },
    {
        "NNQT_question": "Give me {nut} that contains the word {nut} in their name",
        "uid": 23920,
        "subgraph": "string matching simple contains word",
        "template_index": 1522,
        "question": "WHICH ARE THE NUT THAT CONTAINS THE WORD NUT IN THEIR NAME",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11009 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'nut')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q11009>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'nut')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; contains word >",
        "answer": [
            "http://www.wikidata.org/entity/Q104821775",
            "http://www.wikidata.org/entity/Q102330727",
            "http://www.wikidata.org/entity/Q104413072",
            "http://www.wikidata.org/entity/Q104817519"
        ],
        "template_id": "1",
        "paraphrased_question": "WHICH ARE THE NUT THAT CONTAINS THE WORD NUT IN THEIR Title",
        "simplified_query": "SELECT DISTINCT ?a WHERE { ?a rdf:type ontology:nut . FILTER ( CONTAINS ( LCASE ( ?a ) , 'nut' ) ) }",
        "solved_answer": [
            "kukui nut",
            "American chestnut",
            "buckeye nut",
            "Manchurian walnut"
        ]
    },
    {
        "NNQT_question": "What is {twin town} of {Port Vila}, that has {license plate code} is {\u6caaA} ?",
        "uid": 12087,
        "subgraph": "right-subgraph",
        "template_index": 795,
        "question": "What is the twin town of Port Vila, with the license plate code \u6caaA?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q37806 wdt:P190 ?answer . ?answer wdt:P395 ?x FILTER(contains(?x,'\u6caaA'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q37806> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P190>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P395> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <\u6caaA> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q8686"
        ],
        "template_id": "1",
        "paraphrased_question": "What is the twin town of Port Vila, with the license plate code \u6caaA?",
        "simplified_query": "SELECT ?e WHERE { FILTER ( CONTAINS ( ?a , '\u6caaA' ) ) . ?e property:licence_plate_code ?a . resource:Port_Vila property:twinned_administrative_body ?e }",
        "solved_answer": [
            "Shanghai"
        ]
    },
    {
        "NNQT_question": "What is {language official} of {Federated States of Micronesia}, that has {shortened name} is {\u0438\u043d\u0433\u043b\u0438\u0437\u0441\u04d9} ?",
        "uid": 13108,
        "subgraph": "right-subgraph",
        "template_index": 6788,
        "question": "What is the language official in Federated States of Micronesia having a shortened name of",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q702 wdt:P37 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'\u0438\u043d\u0433\u043b\u0438\u0437\u0441\u04d9'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q702> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P37>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1813> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <\u0438\u043d\u0433\u043b\u0438\u0437\u0441\u04d9> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q1860"
        ],
        "template_id": "1",
        "paraphrased_question": "What is the language authentic in Federated States of Micronesia having a shortened title of",
        "simplified_query": "SELECT ?q WHERE { resource:Federated_States_of_Micronesia property:official_language ?q . FILTER ( CONTAINS ( ?c , '\u0438\u043d\u0433\u043b\u0438\u0437\u0441\u04d9' ) ) . ?q property:short_name ?c }",
        "solved_answer": [
            "English"
        ]
    },
    {
        "NNQT_question": "Did {Mary_I_of_England} {sibling} {Edward VI of England}?",
        "uid": 288,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 288,
        "question": "Is Mary I of England a sibling of Edward VI of England?",
        "sparql_wikidata": "ASK WHERE { wd:Q82674 wdt:P3373 wd:Q83229 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q82674> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3373> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q83229>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            true
        ],
        "template_id": "1",
        "paraphrased_question": "Is it true that Mary I of England is a sibling of Edward VI of England",
        "simplified_query": "ASK WHERE { resource:Mary_I_of_England property:sibling resource:Edward_VI_of_England }",
        "solved_answer": [
            true
        ]
    },
    {
        "NNQT_question": "Did {Michael_Jordan} {wears} {jewellery}?",
        "uid": 203,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 203,
        "question": "Does Michael Jordan wear jewellery?",
        "sparql_wikidata": "ASK WHERE { wd:Q41421 wdt:P3828 wd:Q161439 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q41421> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P3828> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q161439>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            false
        ],
        "template_id": "1",
        "paraphrased_question": "Is Michael Jordan known to wear jewelry?",
        "simplified_query": "ASK WHERE { resource:Michael_Jordan property:wears resource:jewelry }",
        "solved_answer": [
            false
        ]
    },
    {
        "NNQT_question": "Give me {mantra} that contains the word {mantra} in their name",
        "uid": 23771,
        "subgraph": "string matching simple contains word",
        "template_index": 3752,
        "question": "Tell me  the mantra that contains the word mantra in their name.",
        "sparql_wikidata": "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131510 . ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'mantra')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 ",
        "sparql_dbpedia18": "SELECT DISTINCT ?sbj ?sbj_label { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?sbj . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P31> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q131510>. ?sbj rdfs:label ?sbj_label . FILTER(CONTAINS(lcase(?sbj_label), 'mantra')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25",
        "template": " <?S P O ; ?S instanceOf Type ; contains word >",
        "answer": [
            "http://www.wikidata.org/entity/Q99305078",
            "http://www.wikidata.org/entity/Q3047244",
            "http://www.wikidata.org/entity/Q10514119",
            "http://www.wikidata.org/entity/Q9413",
            "http://www.wikidata.org/entity/Q728880"
        ],
        "template_id": "1",
        "paraphrased_question": "Disclose to me the mantra that contains the word mantra in their name.",
        "simplified_query": "SELECT DISTINCT ?a WHERE { ?a rdf:type ontology:mantra . FILTER ( CONTAINS ( LCASE ( ?a ) , 'mantra' ) ) }",
        "solved_answer": [
            "Vajra Guru Mantra",
            "Mantra of Light",
            "Medicine Master's Initiation Mantra",
            "Namokar Mantra",
            "Gayatri Mantra"
        ]
    },
    {
        "NNQT_question": "What is {gender} of {Kartikeya}, that has {abreviated name} is {\u2642} ?",
        "uid": 13987,
        "subgraph": "right-subgraph",
        "template_index": 6,
        "question": "What is the gender of Kartikeya whose symbol is also \u2642?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q380817 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER(contains(?x,'\u2642'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q380817> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P21>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1813> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <\u2642> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q6581097"
        ],
        "template_id": "1",
        "paraphrased_question": "What is the sexual orientation of Kartikeya whose image is additionally \u2642?",
        "simplified_query": "SELECT ?y WHERE { FILTER ( CONTAINS ( ?n , '\u2642' ) ) . resource:Murugan property:sex_or_gender ?y . ?y property:short_name ?n }",
        "solved_answer": [
            "male"
        ]
    },
    {
        "NNQT_question": "What is {higher taxon} of {Mammut}, that has {vernacular name} is {Mastodonty} ?",
        "uid": 13481,
        "subgraph": "right-subgraph",
        "template_index": 13,
        "question": "What is the higher taxon of Mammut, whose vernacular name is Mastodonty?",
        "sparql_wikidata": "SELECT ?answer WHERE { wd:Q192272 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER(contains(?x,'Mastodonty'))}",
        "sparql_dbpedia18": "SELECT ?answer WHERE { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q192272> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P171>. ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> ?answer . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> ?answer. ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P1843> . ?statement2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <Mastodonty> . }",
        "template": "E REF ?F . ?F RFG G",
        "answer": [
            "http://www.wikidata.org/entity/Q13424536"
        ],
        "template_id": "1",
        "paraphrased_question": "What is the higher taxon of Mammut, whose vernacular title is Mastodonty?",
        "simplified_query": "SELECT ?h WHERE { ?h property:taxon_common_name ?t . FILTER ( CONTAINS ( ?t , 'Mastodonty' ) ) . resource:Mammut property:parent_taxon ?h }",
        "solved_answer": [
            "Mammutidae"
        ]
    },
    {
        "NNQT_question": "Did {Website} {software engine} {Microsoft}?",
        "uid": 9,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 9,
        "question": "Was Website software engine Microsoft?",
        "sparql_wikidata": "ASK WHERE { wd:Q35127 wdt:P408 wd:Q2283 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q35127> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P408> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q2283>. } ",
        "template": "Ask (ent-pred-obj`)",
        "answer": [
            false
        ],
        "template_id": "1",
        "paraphrased_question": "Is it true that Microsoft was a Website software engine?",
        "simplified_query": "ASK WHERE { resource:website property:software_engine resource:Microsoft }",
        "solved_answer": [
            false
        ]
    },
    {
        "NNQT_question": "Did {Thanksgiving} {location} {Panama}?",
        "uid": 137,
        "subgraph": "boolean one_hop right subgraph",
        "template_index": 137,
        "question": "Is there a Thanksgiving in Panama?",
        "sparql_wikidata": "ASK WHERE { wd:Q13959 wdt:P276 wd:Q804 }",
        "sparql_dbpedia18": " ASK { ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#subject> <http://wikidata.dbpedia.org/resource/Q13959> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#predicate> <http://www.wikidata.org/entity/P276> . ?statement1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#object> <http://wikidata.dbpedia.org/resource/Q804>. } ",
        "template": "Ask (ent-pred-obj)",
        "answer": [
            false
        ],
        "template_id": "1",
        "paraphrased_question": "Does Panama have a Thanksgiving?",
        "simplified_query": "ASK WHERE { resource:Thanksgiving property:location resource:Panama }",
        "solved_answer": [
            false
        ]
    }
]